[
  {
    "title": "Zelensky Says Russia Complicates War's End While Trump Seeks Peace",
    "link": "https://www.bbc.com/news/articles/c04rv2p3936o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 17 Aug 2025 06:42:55 GMT",
    "summary": "Asya Robins contributed to this report.\nVolodymyr Zelensky stated that Russia is complicating efforts to end the war as Donald Trump pursues a peace deal. Trump met with Vladimir Putin in Alaska on Friday to discuss the conflict. Following the meeting with Putin, Trump will meet with Zelensky in Washington on Monday. These discussions occur amidst ongoing efforts to resolve the conflict between Russia and Ukraine, with the United States attempting to mediate a peaceful resolution.",
    "date_str": "August 17, 2025"
  },
  {
    "title": "Trump's Ceasefire Shift Could Upset Kyiv and European Allies",
    "link": "https://www.bbc.com/news/articles/clyvd2jpy1no?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sat, 16 Aug 2025 15:02:32 GMT",
    "summary": "Donald Trump's shift in stance regarding a ceasefire before meeting with Vladimir Putin has caused consternation in Kyiv and Europe. Previously, Trump insisted on a ceasefire as a precondition for meeting Putin, but his change of heart now contradicts the desires of Ukraine and its European allies. This policy shift has implications for the ongoing war in Ukraine and highlights a divergence in strategic approaches between the United States, Ukraine, and European nations. The situation underscores the complex geopolitical dynamics surrounding the conflict, involving key players such as Trump, Putin, and Ukrainian leadership, and the differing priorities that shape their foreign policy decisions.",
    "date_str": "August 17, 2025"
  },
  {
    "title": "Palestinians Flee Gaza City Amid Israeli Protests of Occupation Plan",
    "link": "https://www.bbc.com/news/articles/c2018wx3zlgo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 17 Aug 2025 08:57:49 GMT",
    "summary": "Amidst the ongoing Israel-Gaza conflict, Israeli Defense Forces (IDF) launched attacks on Gaza City, specifically in the Zeitoun neighborhood, creating what the Hamas-run authority describes as a \"catastrophic\" situation that forces Palestinians to flee. Simultaneously, within Israel, citizens stage protests against the government's plan for the occupation. These events underscore the complex dynamics of the conflict, with both military action and internal dissent shaping the trajectory of Israeli-Palestinian relations. Tabby Wilson reports on these developments.",
    "date_str": "August 17, 2025"
  },
  {
    "title": "Ukrainians Fleeing Attacks Called the Alaska Summit an Insult",
    "text": "Evacuees at a shelter in eastern Ukraine reacted angrily to talk that land that has long been theirs could be given to Russia in exchange for peace.",
    "link": "https://www.nytimes.com/2025/08/17/world/europe/ukraine-evacuation-donetsk.html",
    "date_str": "August 17, 2025",
    "source": "NYT",
    "summary": "Amidst ongoing conflict, displaced Ukrainians in eastern Ukraine vocally opposed proposals suggesting territorial concessions to Russia for peace, highlighting the deep emotional and economic ties citizens maintain with their land. These evacuees, representing a population uprooted by Russian aggression, directly challenged diplomatic efforts that might cede Ukrainian territory to Russia. Their reactions underscore the complex human dimension of the war, revealing the potential for significant civilian resistance to any negotiated settlement that involves relinquishing sovereign land. The stance of these evacuees represents the will of many Ukrainians and reflects their long-held sense of ownership of that land."
  },
  {
    "title": "Israel Prepares for a Nationwide Strike in Solidarity with Hostages",
    "text": "Nearly two years of demonstrations have failed to push Prime Minister Benjamin Netanyahu to reach a deal with Hamas that would end the war and free the remaining captives.",
    "link": "https://www.nytimes.com/2025/08/16/world/middleeast/israel-nationwide-strike-hostages.html",
    "date_str": "August 16, 2025",
    "source": "NYT",
    "summary": "Protracted demonstrations are pressuring Prime Minister Benjamin Netanyahu to secure a ceasefire agreement with Hamas and liberate Israeli captives, but he has resisted those calls for almost two years. This deadlock highlights the deep divisions within Israeli society regarding the war's objectives and the best path to secure the release of hostages. Netanyahu's reluctance to negotiate a deal reflects his commitment to destroying Hamas, even amid mounting domestic pressure and international scrutiny. The ongoing conflict underscores the complex geopolitical landscape and the challenges of achieving lasting peace between Israel and Hamas."
  }
]