[
  {
    "title": "BBC And News Agencies Warn Gaza Journalists Face Starvation",
    "link": "https://www.bbc.com/news/articles/c8j1j7n72ywo",
    "source": "BBC",
    "pub_date": "Thu, 24 Jul 2025 10:25:51 GMT",
    "summary": "BBC News and other news organizations highlight the increasing risk of starvation faced by local journalists in Gaza, who now struggle to secure basic necessities amid the ongoing crisis. These journalists, essential for reporting on the ground, find themselves in circumstances mirroring those of the population they cover. The organizations emphasize the urgent need to address the humanitarian crisis affecting journalists' ability to report from Gaza. This situation occurs against the backdrop of the broader Israel-Gaza conflict, where access to resources remains a critical challenge for civilians and media personnel alike.",
    "date_str": "July 24, 2025"
  },
  {
    "title": "Russia and Ukraine Exchanged Drone Attacks Following Recent Ceasefire Talks",
    "link": "https://www.bbc.com/news/articles/crene7d5w2jo",
    "source": "BBC",
    "pub_date": "Thu, 24 Jul 2025 12:04:35 GMT",
    "summary": "Following the latest round of ceasefire talks in Turkey, Russia and Ukraine engaged in mutual drone attacks, resulting in reported deaths on both sides of the border. These renewed hostilities underscore the fragility of diplomatic efforts to de-escalate the ongoing conflict between the two nations. The persistent violence highlights the deep-seated tensions and challenges in achieving a lasting peace, despite international mediation attempts. The situation remains volatile as Russia continues its military operations within Ukraine, while Ukraine utilizes drone technology to defend its territory. The back-and-forth attacks jeopardize prospects for future negotiations and exacerbate the humanitarian crisis.",
    "date_str": "July 24, 2025"
  },
  {
    "title": "Humanitarian Groups Warn Gazans Face Mass Starvation as They Waste Away",
    "link": "https://www.bbc.com/news/articles/ce9xkx7vnmxo",
    "source": "BBC",
    "pub_date": "Wed, 23 Jul 2025 21:28:02 GMT",
    "summary": "More than 100 humanitarian organizations issued a joint statement warning that mass starvation threatens Gaza due to the Israeli government's ongoing \"siege,\" which they assert has \"totally depleted\" aid supplies. The groups highlight the dire consequences for the civilian population, particularly children, who are already suffering from severe malnutrition and lack of access to essential resources. This warning arrives amidst the ongoing conflict between Israel and Hamas, which has severely restricted the entry of humanitarian aid and essential goods into the Gaza Strip. The situation underscores the complex challenges of balancing security concerns with the urgent need to address the humanitarian crisis and protect vulnerable populations in conflict zones.",
    "date_str": "July 24, 2025"
  },
  {
    "title": "Russia and Ukraine Held Another Meeting to Discuss Peace Negotiations",
    "text": "The warring sides remain far apart after the third round of U.S.-brokered peace negotiations on Wednesday. But there was progress on humanitarian issues.",
    "link": "https://www.nytimes.com/2025/07/23/world/europe/russia-ukraine-peace-talks.html",
    "date_str": "July 23, 2025",
    "source": "NYT",
    "summary": "U.S.-brokered peace negotiations between the warring sides concluded their third round with limited success, highlighting the deep divisions persisting in the conflict. While negotiators achieved progress on humanitarian issues, the core political disagreements remain unresolved. The United States continues to mediate as a key player, aiming to bridge the gap between the parties amidst ongoing hostilities. The limited breakthrough on humanitarian aid underscores the urgent need to address the conflict's devastating impact on civilians, even as broader political settlements elude resolution."
  }
]