[
  {
    "title": "Iran Held a State Funeral for Military Leaders Killed in the Israel Conflict",
    "link": "https://www.bbc.com/news/articles/cvg978nkwxro",
    "source": "BBC",
    "pub_date": "Sat, 28 Jun 2025 12:22:23 GMT",
    "summary": "Following a recent ceasefire, Iran held a state funeral for military leaders and nuclear scientists who were killed in the conflict with Israel. The ceremony underscores the ongoing tensions between Iran and Israel amidst regional instability. The deaths and subsequent funeral come in the context of heightened conflict, potentially exacerbating existing geopolitical frictions. This event is especially important due to the potential for further escalation between the involved parties.",
    "date_str": "June 28, 2025"
  },
  {
    "title": "Iran Held a State Funeral for Military Commanders and Nuclear Scientists",
    "text": "A procession of marchers honored prominent figures killed during the 12-day war with Israel.",
    "link": "https://www.nytimes.com/2025/06/28/world/middleeast/iran-funerals-israel-war.html",
    "date_str": "June 28, 2025",
    "source": "NYT",
    "summary": "A procession recently commemorated individuals killed in the recent 12-day conflict with Israel, highlighting the enduring impact of the war. The event underscores persistent tensions between unnamed parties involved in the conflict. These memorial events offer a somber reflection on the consequences of escalating regional disputes. While specific affiliations and goals of the marchers remain unstated, the remembrance reflects the ongoing political and social ramifications of the conflict."
  },
  {
    "title": "Twelve Days of Attacks Have Passed, Raising Concerns About Iran's Nuclear Capability",
    "text": "How an atomic weapon is built, and what the recent Israeli and U.S. attacks on Iran may mean for the country’s nuclear ambitions.",
    "link": "https://www.nytimes.com/interactive/2025/06/27/world/middleeast/iran-us-nuclear-weapons.html",
    "date_str": "June 27, 2025",
    "source": "NYT",
    "summary": "The article analyzes the intricate process of constructing a nuclear weapon, underscoring the technical challenges and proliferation risks involved. It examines recent Israeli and U.S. actions targeting Iran, specifically in light of Tehran's nuclear program, and probes how these events could impact Iran's determination to pursue nuclear capabilities. By detailing the steps needed for atomic weapons development and placing it alongside geopolitical tensions, the analysis brings context to the larger conversation surrounding regional security dynamics in the Middle East. The piece also touches on how international relations are related to nuclear ambitions."
  }
]