[
  {
    "title": "Nine Civilians Died After a Russian Strike Hit a Bus in Ukraine",
    "link": "https://www.bbc.com/news/articles/cz0d31ydlg7o",
    "source": "BBC",
    "pub_date": "Sat, 17 May 2025 13:39:51 GMT",
    "summary": "In the northeastern Sumy region of Ukraine, a Russian strike on a civilian bus has resulted in the reported deaths of nine people, with an additional seven injured. This attack, which occurred on May 17, 2025, underscores the ongoing conflict between Russia and Ukraine and the targeting of civilian infrastructure. Local officials are the primary source of information regarding the casualties, emphasizing the humanitarian impact of the war. This incident follows a pattern of strikes within the conflict zone, highlighting the continued violence and its effect on the Ukrainian population.",
    "date_str": "May 18, 2025"
  },
  {
    "title": "Surgeon in UK Shares Gaza Hospital Footage After Israeli Strike",
    "link": "https://www.bbc.com/news/videos/cd0lj4rnre9o",
    "source": "BBC",
    "pub_date": "Thu, 15 May 2025 21:34:27 GMT",
    "summary": "In the wake of a deadly Israeli strike on a Gaza hospital that killed 28 people, a UK surgeon has released video footage from the site.  The attack, which the Hamas-run civil defense has reported on,  prompted the sharing of the video, highlighting the destruction within the hospital.  Israel maintains the strike was a precise operation targeting Hamas.  The incident underscores the ongoing conflict's impact on civilian infrastructure and the conflicting narratives surrounding the conflict between Israel and Hamas in Gaza.",
    "date_str": "May 18, 2025"
  },
  {
    "title": "One Woman Is Challenging Military Stereotypes in Ukraine",
    "text": "Ukraine’s only female combat pilot flies helicopter missions against Russian troops. The military says it wants more women fighting, but sexism remains an obstacle, activists and female soldiers say.",
    "link": "https://www.nytimes.com/2025/05/18/world/europe/ukraine-woman-combat-pilot.html",
    "date_str": "May 18, 2025",
    "source": "NYT",
    "summary": "Ukraine's only female combat pilot continues to fly helicopter missions against Russian forces, representing a small but significant step toward greater female participation in the country's military. While the Ukrainian military publicly expresses interest in increasing the number of women in combat roles, entrenched sexism continues to hinder progress, according to activists and female soldiers. This situation highlights the challenges faced in fully integrating women into the armed forces even amidst the urgent needs of a protracted war. The disparity between stated goals and lived experiences underscores a broader struggle for gender equality within the Ukrainian military."
  },
  {
    "title": "Russian Troops Show Fatigue Yet Aim to Expand Ukraine Control",
    "text": "Many Russian soldiers say they would see a cease-fire along the current front lines as a failure, hinting at the nationalist discontent the Kremlin could face in accepting a cease-fire.",
    "link": "https://www.nytimes.com/2025/05/17/world/europe/russian-troops-peace-putin.html",
    "date_str": "May 17, 2025",
    "source": "NYT",
    "summary": "Russian soldiers are reportedly expressing a preference for continued fighting over a cease-fire along the current front lines in Ukraine, a stance that reveals the Kremlin's vulnerability to nationalist sentiment. This position suggests potential domestic backlash for Moscow if it were to agree to a negotiated end to the conflict. These views indicate a significant challenge for any potential peace process and highlight the internal pressures the Russian government faces in managing public expectations regarding the war's outcome. Ultimately, these sentiments underscore the complex political landscape within Russia and the potential risks associated with a settlement that does not fully achieve its stated objectives."
  },
  {
    "title": "Zelensky Attended Leo's Inauguration After Pope Francis Offered to Mediate the War",
    "text": "Ukraine’s president was among the dignitaries and world leaders in St. Peter’s Square after the pope proposed the Vatican as a venue for peace talks.",
    "link": "https://www.nytimes.com/2025/05/18/world/europe/zelensky-attends-the-mass-after-the-pope-offered-the-vatican-as-a-venue-for-peace-talks.html",
    "date_str": "May 18, 2025",
    "source": "NYT",
    "summary": "In a symbolic gesture, Ukrainian President Zelenskyy joined other international figures in St. Peter's Square after Pope Francis suggested the Vatican as a potential location for peace negotiations. This move, occurring amidst the ongoing war in Ukraine, highlights the Vatican's continued diplomatic efforts to facilitate dialogue between Russia and Ukraine. Pope Francis, a key player in this initiative, aims to provide neutral ground for discussions between the warring parties. This development takes place against the backdrop of stalled diplomatic progress and a prolonged conflict, underscoring the urgent need for a peaceful resolution."
  }
]