[
  {
    "title": "Congolese Singer Fatally Shot While Filming in Conflict-Ridden City",
    "date_str": "February 14, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cr46ydpp3ddo",
    "url": ""
  },
  {
    "title": "Confusion Hinders Efforts to Preserve Gaza Ceasefire",
    "date_str": "February 14, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cd7d9p0j5qeo",
    "url": ""
  },
  {
    "title": "Austria's Political Crisis Exacerbates as Far-Right Party Struggles to Establish Government",
    "date_str": "February 14, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c78x3klx4rjo",
    "url": ""
  },
  {
    "title": "Germany's Car Industry Faces Crisis: Can it Regain its Former Glory?",
    "date_str": "February 14, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cz6pzwj6qq7o",
    "url": ""
  },
  {
    "title": "Trump Asserts Ukraine's Involvement in Russia Peace Negotiations",
    "date_str": "February 13, 2025",
    "summary": "The Ukrainian President reversed his stance on excluding Ukraine from ongoing peace negotiations with Russia, declaring their inclusion is \"of course\" necessary. This reversal follows his previous suggestion of concessions opposed by Ukraine. Key players involved in the negotiations include the President and representatives from Ukraine and Russia. The negotiations aim to resolve the ongoing conflict between the two countries.",
    "source": "NYT",
    "link": "https://www.nytimes.com/live/2025/02/13/world/russia-ukraine-war-trump",
    "url": ""
  },
  {
    "title": "Deteriorating Relations Between the US and Russia Impact Ukraine's Future",
    "date_str": "February 13, 2025",
    "summary": "Amidst concerns about potential Russian influence, Ukrainian President Zelensky has raised concerns over President Trump's recent actions, including his undisclosed conversation with Russian President Putin and a request for information on Ukrainian mineral rights. These moves have sparked worries that Trump may be seeking to pressure Zelensky into compromising Ukrainian sovereignty. The implications of these interactions are significant, as Ukraine remains pivotal in the ongoing regional conflict and its future aligns closely with Western interests.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/13/world/europe/ukraine-russia-us-diplomacy.html",
    "url": ""
  },
  {
    "title": "Russia May Witness the Most Intense Combat in the Ukraine War",
    "date_str": "February 12, 2025",
    "summary": "Russian soldiers face a fierce battle against determined Ukrainian forces to reclaim an occupied territory. The conflict has trapped civilians, raising concerns of a humanitarian catastrophe. The Times interviewed both sides of the conflict, highlighting the intense fighting and the desperation of those impacted.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/12/world/europe/kursk-russia-war-ukraine.html",
    "url": ""
  },
  {
    "title": "Gazans Confront the Trauma of Recovering Their Lost Loved Ones in the Aftermath of Conflict",
    "date_str": "February 14, 2025",
    "summary": "Authorities in Gaza estimate that thousands of bodies may be recovered from the destruction, causing anguish for families searching for missing relatives. This discovery has compounded the horrors of the conflict, as key players seek to stabilize the region and address the dire humanitarian situation. The tragic loss of life serves as a stark reminder of the devastating consequences of ongoing violence.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/14/world/middleeast/gaza-rubble-missing-bodies.html",
    "url": ""
  },
  {
    "title": "Vance Says All Options on Table to Pressure Russia to End Ukraine War",
    "date_str": "February 14, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/14/world/europe/vance-russia-ukraine-war.html",
    "url": ""
  }
]