[
  {
    "title": "Two Killed in Ukraine's Odesa Region Amid Russian Power Grid Attacks",
    "link": "https://apnews.com/article/ukraine-russia-war-drones-energy-power-infrastructure-odesa-d4da17ce7fbb0a7b58c62bc290eedaf7",
    "source": "Associated Press",
    "date_str": "November 02, 2025",
    "summary": "Russian forces continue to target Ukraine's critical infrastructure, specifically the power grid in the Odesa region, resulting in the death of two people. These attacks, reportedly carried out with drones, demonstrate Russia's ongoing strategy to cripple Ukraine's energy capabilities as the conflict persists. Ukrainian authorities are currently assessing the extent of the damage and working to restore power. The relentless strikes on essential infrastructure underscore the escalating humanitarian crisis and economic strain within Ukraine."
  },
  {
    "title": "Ukraine Claims Strike on Key Russian Fuel Pipeline Near Moscow",
    "link": "https://apnews.com/article/russia-ukraine-drone-fuel-pipeline-8a66ccb8bf59f1dc045266a088efe67e",
    "source": "Associated Press",
    "date_str": "November 01, 2025",
    "summary": "Ukraine claims its forces successfully struck a critical fuel pipeline near Moscow, which supplies fuel to the Russian military, marking a strategic blow against Russia's war effort. While details of the attack remain limited, the Ukrainian military intelligence asserts responsibility for the operation, escalating the conflict within Russian territory. This action follows a pattern of increased Ukrainian strikes targeting Russian infrastructure, aiming to disrupt logistical support for Russian forces engaged in the ongoing war, and demonstrates Kyiv's resolve in countering Moscow's aggression. The continued conflict involves key players such as Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin."
  },
  {
    "title": "Ukraine's Long-Range Drone Attacks on Russia Heighten War Risks and Market Concerns",
    "link": "https://apnews.com/article/ukraine-russia-war-drones-economy-refineries-strikes-24fb93e0fab5dbba1a323b92510125bb",
    "source": "Associated Press",
    "date_str": "October 31, 2025",
    "summary": "Ukraine ramps up its long-range drone production in clandestine facilities to strike targets deep within Russia. These domestically produced drones, such as the An-196 Liutyi, enable Ukraine to hit oil refineries, fuel depots, and military installations, thereby challenging Russia's air defenses. Ukrainian engineers, supported by figures like Vasyl Maliuk, head of the Security Service of Ukraine, have indigenously developed these capabilities amidst the ongoing conflict. This development shifts the dynamics of the war, demonstrating Ukraine's growing capacity to project force and disrupt Russian operations despite resource constraints. The drone strikes signal a significant escalation, as Ukraine increasingly targets Russia's economic and military infrastructure."
  },
  {
    "title": "Former Israeli Military Lawyer Arrested in Video Leak Scandal",
    "link": "https://www.bbc.com/news/articles/cy0kpd97qqko?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Mon, 03 Nov 2025 11:17:28 GMT",
    "summary": "The arrest of Major General Yifat Tomer-Yerushalmi, the Israeli military's former top lawyer, intensifies a scandal involving the leak of a video depicting the alleged abuse of a Palestinian detainee. Tomer-Yerushalmi resigned from her position after admitting to leaking the video, raising concerns about transparency and accountability within the Israel Defense Forces. This incident occurs amidst ongoing scrutiny of the IDF's conduct in the Palestinian territories, potentially exacerbating tensions and legal challenges related to human rights. The unfolding investigation will likely examine the extent of the abuse depicted in the video and the motivations behind the leak, impacting the IDF's image and potentially influencing Israeli-Palestinian relations.",
    "date_str": "November 03, 2025"
  },
  {
    "title": "US Energy Secretary States Trump's Planned Tests Are Not Nuclear Explosions",
    "link": "https://www.bbc.com/news/articles/cpd26yxxx3lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Mon, 03 Nov 2025 09:10:35 GMT",
    "summary": "Amidst global concerns about nuclear proliferation, the Trump administration is reportedly planning to conduct tests that the US Energy Secretary, Chris Wright, characterizes as \"non-critical explosions.\" Wright assures the public that these tests will not produce mushroom clouds, suggesting a scale far below that of actual nuclear detonations. The potential move occurs within the broader context of ongoing tensions with countries like North Korea, China, and Russia, all of which possess nuclear capabilities, prompting scrutiny regarding the message these tests send to the international community. These tests potentially signal a shift in U.S. nuclear policy under the Trump administration.",
    "date_str": "November 03, 2025"
  }
]