[
  {
    "title": "Russian Strikes Have Caused Power Outages for Over 600,000 Ukrainians",
    "link": "https://www.bbc.com/news/articles/cx2gylngx7go?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sat, 29 Nov 2025 12:16:26 GMT",
    "summary": "Russian forces launched overnight strikes against Ukraine, causing power outages for over 600,000 people, particularly in the capital city of Kyiv, and resulting in at least three deaths. These attacks continue Russia's strategy of targeting Ukrainian infrastructure, exacerbating the ongoing humanitarian crisis and testing the resilience of Ukraine's energy grid during the conflict. Ukraine's government and international partners face the challenge of providing emergency assistance and bolstering defenses against further Russian attacks. The strikes occur amidst the broader context of the Russia-Ukraine war, which began in February 2022, as Russia attempts to exert its influence over the region.",
    "date_str": "November 29, 2025"
  },
  {
    "title": "Thirteen People Died in Southern Syria During the Deadliest Israeli Raid in Months",
    "link": "https://www.bbc.com/news/articles/cp89k31krz4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 28 Nov 2025 16:12:58 GMT",
    "summary": "Israel conducted a deadly raid in Beit Jinn, southern Syria, resulting in thirteen fatalities in what they claim targeted militants. In response, the Syrian Foreign Ministry condemned Israel's actions as a war crime. These events occur against the backdrop of ongoing tensions between Israel and Syria, particularly regarding the presence of Iranian-backed groups near the Golan Heights. Israel has repeatedly stated it will prevent Iranian entrenchment in Syria, leading to frequent strikes against targets it identifies as threats. The incident marks the deadliest Israeli operation in Syria in recent months, potentially escalating regional tensions.",
    "date_str": "November 29, 2025"
  },
  {
    "title": "Drawn by Employment, Individuals Were Ultimately Forced to Fight for Russia",
    "text": "The South African government is investigating how more than a dozen men unwittingly ended up on the front line in Russia’s war on Ukraine.",
    "link": "https://www.nytimes.com/2025/11/29/world/africa/south-africa-russia-ukraine-fighters-zuma.html",
    "date_str": "November 29, 2025",
    "source": "NYT",
    "summary": "South Africa launched an investigation into the recruitment and deployment of its citizens to fight for Russia in the Ukraine war, a move that could strain relations between Pretoria and Moscow. The probe seeks to determine how over a dozen South African men were misled into joining the conflict, potentially violating South Africa’s official policy of neutrality regarding the war and its laws against mercenary activity. This inquiry unfolds amidst ongoing scrutiny of South Africa's close ties with Russia, particularly in the context of the BRICS economic alliance and past military cooperation. Ultimately, the investigation could lead to legal action against recruiters and those who facilitated the South Africans' involvement."
  },
  {
    "title": "Israeli Forces Reportedly Killed Two Palestinians After Apparent Surrender, Video Shows",
    "text": "The Israeli authorities said they were investigating the shooting, which came amid days of extensive military operations in the West Bank.",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/israel-west-bank-shooting-palestinians-video.html",
    "date_str": "November 28, 2025",
    "source": "NYT",
    "summary": "Israeli authorities are investigating a recent shooting in the West Bank, a development that unfolds against a backdrop of escalated Israeli military operations in the region. This investigation gains significance as it could further inflame tensions between Israelis and Palestinians and potentially influence international perceptions of the conflict. The Israeli government's actions are closely scrutinized by global actors who are calling for de-escalation and accountability. The ongoing military operations and the shooting underscore the persistent volatility and complex security challenges present in the West Bank."
  }
]