[
  {
    "title": "European Drone Industry Sees Opportunity Amid NATO's Counter-Threat Measures",
    "link": "https://apnews.com/article/denmark-drones-mydefence-weibel-scientific-russia-ukraine-dfc8f1c5bf7f1592d4c1fc940e4c88ce",
    "source": "Associated Press",
    "date_str": "November 12, 2025",
    "summary": "Following increased drone warfare since Russia's 2022 invasion of Ukraine and a surge in drone intrusions into NATO airspace in September, companies like MyDefence and Weibel Scientific developed and deployed anti-drone technology in Ukraine and NATO member states. These systems detect and counter unmanned aerial vehicles, mitigating risks posed by their surveillance or potential weaponization. NATO countries are increasingly vigilant after the unprecedented scale of drone flyovers. This technological response highlights the evolving security landscape and the need for advanced countermeasures against emerging drone threats."
  },
  {
    "title": "Houthi Rebels in Yemen Indicate Ceasing Attacks",
    "link": "https://apnews.com/article/mideast-wars-yemen-houthis-red-sea-ee7be23641e9e3fd227d2c1677e03472",
    "source": "Associated Press",
    "date_str": "November 11, 2025",
    "summary": "Amidst a shaky ceasefire in the Gaza Strip, Yemen's Houthi rebels signal a halt to their attacks targeting Israel and commercial shipping in the Red Sea. The Houthis, a key player in Yemen's ongoing conflict, previously launched these attacks purportedly in support of Hamas, impacting international maritime trade. This de-escalation occurs as broader efforts continue to resolve both the Israeli-Palestinian conflict and the Yemeni civil war, where the Houthis control significant territory. The cessation of Houthi attacks could ease tensions in the region and alleviate some pressure on global supply chains, but the situation remains fragile and dependent on the durability of the Gaza ceasefire. Yusuf Hassan al-Madani is mentioned as being involved."
  },
  {
    "title": "Kenyan Minister Says Over 200 Citizens Are Fighting in Ukraine for Russia",
    "link": "https://www.bbc.com/news/articles/cddrj3mzgz2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 13 Nov 2025 11:01:48 GMT",
    "summary": "Kenyan authorities report that over 200 Kenyan citizens are fighting for Russia in Ukraine, recruited through networks offering deceptive job opportunities. Musalia Mudavadi, a key Kenyan government figure, brought attention to this issue, highlighting Russia's ongoing recruitment efforts targeting Kenyans amidst the protracted conflict in Ukraine. This situation raises concerns about foreign involvement in the war and the exploitation of vulnerable populations seeking employment. The recruitment preys on economic hardship, with individuals likely unaware of the true nature of the \"jobs\" they are accepting.",
    "date_str": "November 13, 2025"
  },
  {
    "title": "The United States Urges International Action to Halt Weapons Supply to Sudanese Paramilitaries",
    "link": "https://www.bbc.com/news/articles/c17p1nwy7q8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 13 Nov 2025 12:25:56 GMT",
    "summary": "Amidst ongoing conflict in Sudan, U.S. Secretary of State Marco Rubio urges the international community to halt weapons supplies to the Rapid Support Forces (RSF) due to credible reports of sexual violence and atrocities. Rubio's call for action highlights growing concerns about the RSF's conduct and the need to address the escalating humanitarian crisis. The conflict in Sudan involves clashes between the Sudanese army and the RSF, exacerbating instability in a region already facing numerous challenges. International intervention aims to mitigate further violence and facilitate a path toward a peaceful resolution. The United States, along with other nations, are grappling with how to effectively pressure the warring parties to end the conflict.",
    "date_str": "November 13, 2025"
  },
  {
    "title": "Russian Attacks Intensify as Ukraine Battles to Survive the Winter",
    "link": "https://www.bbc.com/news/articles/cly98qp99l8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 13 Nov 2025 06:00:11 GMT",
    "summary": "As the conflict continues, Ukraine braces for what it anticipates will be its most challenging winter yet, with Russia intensifying attacks on critical infrastructure. Ukrainians are striving to maintain morale amidst a war of attrition that has taken a toll on the homefront. The ongoing conflict between Ukraine and Russia, led by figures like Volodymyr Zelensky and Vladimir Putin, respectively, forms the backdrop. Years of conflict have strained resources, and Ukrainians are trying to fight back hard by keeping morale high.",
    "date_str": "November 13, 2025"
  },
  {
    "title": "The War-Protected Haven Transformed Into a Besieged Wasteland",
    "text": "The Ukrainian city of Pokrovsk is on the verge of becoming another shattered trophy for the Russian Army.",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-russia-pokrovsk.html",
    "date_str": "November 13, 2025",
    "source": "NYT",
    "summary": "Russia intensifies its offensive on Pokrovsk, a strategically important city in eastern Ukraine, aiming to seize control and further its territorial gains in the Donbas region. Ukrainian forces are struggling to defend the city amidst relentless Russian artillery and troop advancements, prompting concerns about a potential collapse of defensive lines. The potential fall of Pokrovsk would provide Russia with a crucial logistical hub and bolster its efforts to consolidate control over the Donetsk Oblast. The ongoing battle exemplifies the escalating conflict and the precarious situation faced by Ukraine as it attempts to repel Russian aggression."
  }
]