[
  {
    "title": "'no-one Slept in Syria Last Night' - How News of Assad's Toppling Spread",
    "date": "2024-12-08T08:58:20+00:00",
    "date_str": "December 08, 2024",
    "summary": "Residents in Damascus have told of an anxious wait for news on what was happening in Syria 's capital city overnight. Unverified videos circulating on social media show people cheering in the streets and welcoming the rebel fighters. Yazan Al Amari runs a small phone shop in Deraa, a city south of Damascus where civilian militias affiliated with Hayat Tahrir al-Sham have already taken control. He says he is travelling with friends to the Syrian capital today to celebrate.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2772e082do",
    "region": "Middle East"
  },
  {
    "title": "Who Are the Rebels in Syria?",
    "date": "2024-12-08T07:40:24+00:00",
    "date_str": "December 08, 2024",
    "summary": "Rebel forces have entered the Syrian capital Damascus with reports that President Bashar al-Assad has fled the country by plane to an unknown location. The initial attack was led by the Islamist militant group Hayat Tahrir al-Sham ( HTS ) - which has a long and involved history in the Syrian conflict. HTS is designated as a terrorist organisation by the UN, US, Turkey and other countries. It appears to have brought down the end of the regime in less than two weeks.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce313jn453zo",
    "region": "Middle East"
  },
  {
    "title": "Analysis: End of Assad Rule Will Reshape Region's Balance of Power",
    "date": "2024-12-08T07:32:16+00:00",
    "date_str": "December 08, 2024",
    "summary": "The fall of Bashar al-Assad was almost unthinkable just a week ago. With the help of Russia and Iran, he crushed the rebels, and survived. The end of the Assad family 's five-decade rule will reshape the balance of power in the region. The dramatic changes could lead to a dangerous power vacuum and eventually result in chaos and even more violence. Residents in the Syrian capital tell of an anxious night waiting for news of the fall.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8j99447gj1o",
    "region": "Middle East"
  },
  {
    "title": "What Has Just Happened in Syria?",
    "date": "2024-12-08T07:28:59+00:00",
    "date_str": "December 08, 2024",
    "summary": "Syrian rebel forces have entered Damascus amid reports that President Bashar al-Assad has fled the country after 13 years of civil war. Prime Minister Mohammed al-Jalali has said he is ready to support continuity of governance in the country. It comes only 12 days after the Islamist militant group Hayat Tahrir al-Sham and allied factions launched a major offensive in the north-west. The rebels first captured the second city of Aleppo and then swept southwards down the highway to the capital as the Syrian military collapsed.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c99x0l1d432o",
    "region": "Middle East"
  },
  {
    "title": "Crowds Gather in Damascus After Rebels Declare City 'free'",
    "date": "2024-12-08T05:39:16+00:00",
    "date_str": "December 08, 2024",
    "summary": "Rebel forces in Damascus have declared the capital city free of long-time ruler Bashar al-Assad in the early hours of Sunday. Drone footage released by the Israeli military on Thursday is said to show Sinwar in the moments before he was killed. Lebanon 's health ministry says 22 people have died and more than 117 were left wounded after air strikes in central Beirut. The BBC's Nick Eardley analyses videos that reveal the extent of damage caused by Israeli strikes. Jeremy Bowen speaks to young Palestinians and Israelis about the ongoing war.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c75wwppvkp3o",
    "region": "Middle East"
  },
  {
    "title": "A $6.2m Banana, a Crypto Empire and Trump's Potential Conflicts",
    "date": "2024-12-08T01:54:44+00:00",
    "date_str": "December 08, 2024",
    "summary": "Chinese crypto entrepreneur Justin Sun invested $ 30m into a cryptocurrency firm called World Liberty Financial. Mr Sun 's investment tipped the company over the threshold that allowed the president-elect to begin profiting from the venture. Trump and his family are now in the position to collect roughly $ 20m - and potentially far more. The episode set off alarm bells among government ethics experts who see it as an indication that Trump 's expanding business ventures have made it easier than ever for those hoping to influence US policy.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c4gzz5wdg41o",
    "region": "Global"
  },
  {
    "title": "Prince William and Trump Meet After Notre-dame Reopening",
    "date": "2024-12-07T23:19:30+00:00",
    "date_str": "December 07, 2024",
    "summary": "The Prince of Wales met US President-elect Donald Trump while visiting France for the ceremonial reopening of Notre-Dame cathedral. Prince William joined other world leaders in Paris to mark the restoration of the world-famous landmark. The medieval cathedral has been closed since a major fire tore through it in 2019. William and Trump discussed a range of global issues but focused on the importance of the UK/US special relationship.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c05ppeym6jro",
    "region": "Asia"
  },
  {
    "title": "Where Is Bashar? Rumours Swirl in Syria Despite Official Denials",
    "date": "2024-12-07T21:20:55+00:00",
    "date_str": "December 07, 2024",
    "summary": "Mood in Damascus appears to be one of confusion and fear, with many unable to find out exactly what is going on. symbols of the power of the Assad dynasty have been torn down or toppled. Rumours are swirling over the whereabouts of President Bashar al-Assad, with people logging flights in and out of Damascus to work out whether he might have left. If he is now out of the picture, a power vacuum will re-emerge, with no clear indication of how it will be filled. There are wider fears that Syria could plunge into an even more calamitous state, with various factions battling each other for control.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/czxdd2r2191o",
    "region": "Middle East"
  },
  {
    "title": "Five Dead, More Feared Missing After the Hague Flat Explosions",
    "date": "2024-12-07T21:17:05+00:00",
    "date_str": "December 07, 2024",
    "summary": "At least five people have died and four others injured after explosions rocked a block of flats in The Hague in the Netherlands. The cause of the explosions is not yet clear, but Dutch police said a car drove away at very high speed shortly after. Rescue teams with sniffer dogs have been deployed to sift through the debris, but parts of the site remain too dangerous to access. There are concerns the unrest has damaged community relations and tensions have spilled over into politics too.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/clykk717n1ko",
    "region": "Middle East"
  },
  {
    "title": "Romanian Court Annuls Result of Presidential Election First Round",
    "date": "2024-12-06T20:59:13+00:00",
    "date_str": "December 06, 2024",
    "summary": "Romania 's constitutional court has annulled the result of the first round of voting in the presidential election. It means the process will be restarted from scratch, with the government due to decide a date for a new vote. The first round was won by Calin Georgescu, an almost unknown far-right Nato-sceptic who has previously praised Vladimir Putin. The court 's decision comes after intelligence documents were declassified, suggestingGeorgescu benefitted from a mass influence operation to interfere with the vote.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cn4x2epppego",
    "region": "Africa"
  }
]