[
  {
    "title": "Young Couple Preserves Memories with Old-School Photo Lab Driven by Passion and Nostalgia",
    "date_str": "January 12, 2025",
    "summary": "In Central America, a young couple, Fabriccio and Lucía, are dedicated to preserving film photography and the memories it captures. They operate the region's only fully equipped film lab, driven by their shared passion for the medium and the desire to counter the decline of film photography in the digital age.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c77j7n4kyy5o",
    "url": ""
  },
  {
    "title": "Female Inventor Creates Innovative Aidbot for Displaced Communities in Lebanon",
    "date_str": "January 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cpwx870enjno",
    "url": ""
  },
  {
    "title": "Ukraine's Cultural Heritage at Risk: A Battle for Painting and Photography",
    "date_str": "January 11, 2025",
    "summary": "In response to Kyiv's struggle for identity, an image of Ukrainian soldiers superimposed over a renowned 19th-century Cossack painting has gained widespread resonance. This artistic adaptation symbolizes Ukraine's historical ties to the Cossacks, a legendary group of warriors who defended Ukrainian lands for centuries. The image's significance underscores the ongoing efforts of key players, including Ukrainian soldiers and artists, to reinforce the country's national identity amidst the ongoing conflict.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/11/world/europe/ukraine-photo-painting-culture-war.html",
    "url": ""
  },
  {
    "title": "Sudan's Military Regains Control of Vital City from Accused Genocidal Paramilitary",
    "date_str": "January 11, 2025",
    "summary": "Celebrations broke out in military-controlled regions of Sudan, raising optimism that the military's victory could mark a crucial turning point in the devastating civil war. The military's success was a significant event, as it gave them control over key areas and potentially paved the way for a peaceful resolution. The key players involved included the Sudanese military and rebel groups that had been fighting for years. The conflict had a lengthy and complex history, marked by ethnic and political tensions that had hindered stability in the region.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/11/world/africa/sudan-military-recaptures-city.html",
    "url": ""
  },
  {
    "title": "Ukraine Captures Two North Korean Soldiers Supporting Russian Forces",
    "date_str": "January 11, 2025",
    "summary": "In a significant development, President Volodymyr Zelensky announced the capture of Ukrainian soldiers in the Kursk region, which Ukraine had previously secured last summer. This event underscores the ongoing conflict between Ukraine and Russia, with both sides seeking to establish control over contested territories. The key player, President Zelensky, continues to play a pivotal role in Ukraine's defense efforts while Russia's position remains notably absent from the article. The capturing of Ukrainian soldiers serves as a reminder of the ongoing human cost of the conflict and the importance of finding a diplomatic resolution.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/11/world/europe/ukraine-north-korea-kursk.html",
    "url": ""
  },
  {
    "title": "United States Tightens Sanctions Against Russian Energy Sector",
    "date_str": "January 10, 2025",
    "summary": "The Biden administration intensifies its campaign against Russia by targeting its \"shadow fleet\" of oil tankers and implementing measures to restrict oil and gas production. This action aims to reduce Russia's revenue and its ability to finance its ongoing military operations in Ukraine. The administration collaborates with allies and partners to limit the illicit transportation of Russian oil, while simultaneously promoting energy independence and strengthening economic stability.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/10/us/politics/us-russia-sanctions.html",
    "url": ""
  },
  {
    "title": "The Year 2024 Marked a Critical Milestone in Global Warming",
    "date_str": "January 09, 2025",
    "summary": "In 2022, global temperatures exceeded a critical target, exacerbating concerns about the feasibility of achieving climate mitigation goals. The United Nations and other international organizations are closely monitoring the situation, while governments and scientists continue to implement adaptation and mitigation strategies. The rise in temperatures underscores the urgent need for collective action to address the climate crisis.",
    "source": "NYT",
    "link": "https://www.nytimes.com/interactive/2025/01/09/climate/2024-heat-record-climate-goal.html",
    "url": ""
  }
]