[
  {
    "title": "Israel and Lebanon's Hezbollah start a ceasefire after nearly 14 months of fighting",
    "link": "https://apnews.com/article/israel-palestinians-hamas-lebanon-hezbollah-11-26-2024-aa165645d900a3d681ad127e05b0c561",
    "source": "Associated Press",
    "pub_date": "2024-11-26T20:45:00Z",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "ICC issues arrest warrants for Netanyahu, Hamas officials...",
    "link": "https://apnews.com/article/icc-israel-hamas-warrants-netanyahu-palestinian-arrest-73c854d072e0a1a41b19b2cb2cdd07fa",
    "source": "Associated Press",
    "pub_date": "2024-11-21T13:00:03Z",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Media Mogul Murdoch Fails in Trust Revision Attempt in Corporate Family Feud",
    "link": "https://www.bbc.com/news/articles/c2ld084z8jjo",
    "source": "BBC",
    "pub_date": "Tue, 10 Dec 2024 02:12:25 GMT",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Israel Confirms Attack on Syrian Naval Forces",
    "link": "https://www.bbc.com/news/articles/cqx808q7lrno",
    "source": "BBC",
    "pub_date": "Tue, 10 Dec 2024 17:46:37 GMT",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Israel Conducts Widespread Air Strikes in Syria",
    "link": "https://www.bbc.com/news/articles/c4gxplxy550o",
    "source": "BBC",
    "pub_date": "Tue, 10 Dec 2024 03:03:57 GMT",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Reactions from Loved Ones of Deceased and Incarcerated Victims Following Assad's Downfall",
    "link": "https://www.bbc.com/news/videos/cy0n8z7gjxvo",
    "source": "BBC",
    "pub_date": "Mon, 09 Dec 2024 20:26:49 GMT",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Prison Head Fatally Injured in Car Explosion in Ukraine",
    "link": "https://www.bbc.com/news/articles/c5y867penn8o",
    "source": "BBC",
    "pub_date": "Mon, 09 Dec 2024 16:45:10 GMT",
    "date_str": "December 10, 2024",
    "summary": "No summary available",
    "url": ""
  },
  {
    "title": "Israel Claims Destruction of Syrian Navy, Continues Post-Assad Military Operations",
    "text": "Israel says it is striking Syrian military sites to keep them out of “the hands of extremists.” The rebels who toppled the Assad government began laying out their plans while rival groups fought fierce battles for territory.",
    "link": "https://www.nytimes.com/live/2024/12/10/world/syria-news-assad-rebels",
    "date": "2024-12-10T05:01:57",
    "source": "NYT",
    "summary": "Israel is carrying out airstrikes on Syrian military sites to prevent their seizure by extremist groups. This action is a response to the ongoing conflict in Syria, which has resulted in the toppling of the Assad government and fierce battles between rival rebel groups seeking to control territory.",
    "date_str": "December 10, 2024",
    "url": ""
  },
  {
    "title": "Georgia Protests Reflect Echoes of Ukraine's Historic Revolutions",
    "text": "This former Soviet Republic has been rocked by anti-government demonstrations over the same issues that hurtled Ukraine into war — its relationship with Europe and Russia.",
    "link": "https://www.nytimes.com/2024/12/10/world/asia/georgia-protests-russia-ukraine.html",
    "date": "2024-12-10T05:03:32",
    "source": "NYT",
    "summary": "Mass demonstrations in a former Soviet Republic are fueled by tensions with both Europe and Russia, echoing the conflicts that preceded the Ukraine war. These demonstrations highlight the ongoing struggle over geopolitical allegiances and the influence of both Russia and Europe in the region.",
    "date_str": "December 10, 2024",
    "url": ""
  },
  {
    "title": "Arctic Tundra, a Natural Carbon Sink, Now Contributes to Global Warming",
    "text": "Wildfires and thawing permafrost are causing the region to release more carbon dioxide than its plants remove, probably for the first time in thousands of years.",
    "link": "https://www.nytimes.com/2024/12/10/climate/arctic-emissions-carbon-ice-warming.html",
    "date": "2024-12-10T11:00:04",
    "source": "NYT",
    "summary": "Due to increased wildfires and thawing permafrost, the Arctic is now emitting more carbon dioxide than its plants can absorb, potentially reversing a centuries-old carbon sink. This phenomenon, likely occurring for the first time in thousands of years, highlights the region's rapidly changing climate.",
    "date_str": "December 10, 2024",
    "url": ""
  },
  {
    "title": "Israel Seizes Opportunity to Neutralize Military Assets in Syria",
    "text": "Israel capitalized on the power vacuum in Syria to bomb targets across the country, saying it aims to keep weapons away from extremists.",
    "link": "https://www.nytimes.com/2024/12/10/world/middleeast/israel-strikes-syria.html",
    "date": "2024-12-10T07:12:45",
    "source": "NYT",
    "summary": "Amidst the conflict in Syria, Israel conducted airstrikes targeting locations throughout the country, seeking to prevent the proliferation of weapons to extremist groups. The airstrikes were motivated by concerns over potential threats to regional security.",
    "date_str": "December 10, 2024",
    "url": ""
  },
  {
    "title": "Australia and Nauru Secure Defense Agreement with Focus on China",
    "text": "In return for financial support, the Pacific island nation of Nauru pledged not to enter any security pacts without Australia’s assent.",
    "link": "https://www.nytimes.com/2024/12/10/world/australia/australia-treaty-nauru.html",
    "date": "2024-12-10T02:23:06",
    "source": "NYT",
    "summary": "Nauru has pledged to avoid security pacts without Australia's approval in exchange for financial support. This agreement ensures Australia's continued influence over Nauru's foreign policy and security arrangements.",
    "date_str": "December 10, 2024",
    "url": ""
  }
]