[
  {
    "title": "Trump Accuses Ukraine of Escalating Conflict",
    "date_str": "February 19, 2025",
    "summary": "Former US President Donald Trump has asserted that Ukraine could have negotiated an earlier peace deal with Russia. Despite concerns that Ukraine is not involved in peace talks, Trump remains confident in the possibility of a successful outcome. This statement comes amid Russia's ongoing invasion of Ukraine, which has fueled a protracted conflict between the two nations.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cd0n5e1pdz9o",
    "url": ""
  },
  {
    "title": "Trump and Musk Engage in Discussion on Conflict of Interest Concerns",
    "date_str": "February 19, 2025",
    "summary": "In an interview, former President Donald Trump and Tesla CEO Elon Musk discussed potential conflicts of interest between Musk's businesses and his government role. Musk denied requesting any favors from Trump, highlighting that his involvement in government initiatives was solely based on his belief in the importance of space exploration and renewable energy. These initiatives included SpaceX's $2.9 billion contract with NASA and Tesla's efforts to promote electric vehicles.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c1enp4gpdgqo",
    "url": ""
  },
  {
    "title": "President Zelensky Demands Truth Amidst Allegations from Trump on War Origins",
    "date_str": "February 19, 2025",
    "summary": "In pointed remarks, Ukrainian President Volodymyr Zelensky directly addressed concerns regarding President Trump's perceptions of the ongoing war in Ukraine. This escalating rhetorical exchange highlights a growing rift between the two leaders and underscores the importance of supportive diplomatic ties between the United States and Ukraine amid the ongoing conflict with Russia.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/19/world/europe/ukraine-zelensky-trump-russia-war.html",
    "url": ""
  },
  {
    "title": "Gil Won-ok, Crusading Victim of Wartime Sex Slavery, Dies at 96",
    "date_str": "February 18, 2025",
    "summary": "In pursuit of justice, a Korean woman campaigned for an official apology and compensation from Japan for the enslavement of Korean women, known as \"comfort women,\" during World War II. The campaign sought to address the historical trauma and suffering endured by these women, highlighting the importance of acknowledging and addressing past wrongs. The campaign involved both activists and the Japanese government, who were urged to take responsibility for the atrocities committed.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/world/asia/korea-comfort-women-advocate-obituary.html",
    "url": ""
  },
  {
    "title": "US Policy Upends as Trump Shifts Focus to Russia",
    "date_str": "February 18, 2025",
    "summary": "At peace talks facilitated by Saudi Arabia, President Trump signaled an end to Russia's diplomatic isolation. Trump's comments sparked controversy, implying that Ukraine had contributed to its own invasion by Russia. The talks mark a significant diplomatic development, highlighting key players such as Saudi Arabia and suggesting a shift in international perceptions towards Russia.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/us/politics/trump-russia-putin.html",
    "url": ""
  },
  {
    "title": "Brazil Accuses Bolsonaro of Conspiracy to Overturn 2022 Election",
    "date_str": "February 18, 2025",
    "summary": "Brazil's attorney general has accused former President Jair Bolsonaro of orchestrating a scheme to maintain power, potentially leading to his arrest. The Supreme Court will determine the outcome of the case. This accusation stems from Bolsonaro's alleged involvement in a plan to incite riots and prevent the peaceful transfer of power following his defeat in the 2022 election. Key players include Attorney General Augusto Aras and the judges of the Supreme Court, who will play a significant role in deciding the fate of Bolsonaro. The context highlights Brazil's ongoing efforts to address political instability and hold former leaders accountable for their actions.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/world/americas/brazil-bolsonaro-coup-charges.html",
    "url": ""
  },
  {
    "title": "Florida Man Pleads Insanity in Israeli Tourist Shooting",
    "date_str": "February 18, 2025",
    "summary": "A Jewish gunman opened fire on tourists in Jerusalem, believing them to be Palestinians. Police responded swiftly, detaining the suspect. The incident underscored the ongoing tensions between Jewish and Palestinian communities in Israel and the potential for further violence. The gunman's motive, if confirmed, would indicate a dangerous rise in inter-communal hostility.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/world/middleeast/florida-shooting-israeli-tourists.html",
    "url": ""
  }
]