[
  {
    "title": "BBC Launches Educational Program for War-Affected Children: \"I Miss My School\"",
    "date_str": "February 10, 2025",
    "summary": "The BBC World Service has launched an Arabic-language edition of its award-winning educational program, Dars, to provide children in war zones with access to educational resources. The program, which targets children aged 3-16, aims to bridge the learning gaps caused by conflict and displacement. The initiative is led by the BBC Media Action, a charity funded by the UK's Department for International Development.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cvgezj3v78ro",
    "url": ""
  },
  {
    "title": "Who Controls the Conflict in the Democratic Republic of Congo?",
    "date_str": "February 10, 2025",
    "summary": "In response to the M23 rebel's advance in the Democratic Republic of Congo (DRC), regional players convened a meeting to mitigate the escalating crisis. Rwanda, Burundi, and Uganda have been implicated in the escalating conflict. The M23 is a Congolese rebel group that has been active since 2012. While some parties allege Rwanda's support to the M23, Rwanda denies the allegations. Burundi has announced its withdrawal from the joint forces deployed to fight the M23, while Uganda has not officially taken a position.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp8qp6p39e9o",
    "url": ""
  },
  {
    "title": "Scientists Estimate Duration of Santorini Seismic Activity",
    "date_str": "February 10, 2025",
    "summary": "A series of earthquakes have struck the idyllic Greek island of Santorini, triggering an ongoing \"seismic crisis.\" The severity and duration of these earthquakes remain uncertain, according to scientists, as the island continues to experience tremors. Key players in the response include seismologists, emergency services, and government officials. The crisis emerged against a backdrop of Santorini's history of volcanic activity and proximity to the active Santorini-Milas fault line.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp8qpn2p795o",
    "url": ""
  },
  {
    "title": "Trump Targets Somalia with Military Operations",
    "date_str": "February 10, 2025",
    "summary": "The United States government, led by President Donald Trump, has intensified its military operations against Islamic State (ISIS) in Somalia to combat the group's growing presence in the mountains of northeastern Somalia, which has emerged as a hub for ISIS activities in Africa. The US has conducted airstrikes, ground raids, and partnered with local forces to weaken the militant group, which poses a significant security threat to the region and beyond.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cyv4270gljpo",
    "url": ""
  },
  {
    "title": "Trump's Trade War Paused, but Motives and Resolution Remain Elusive",
    "date_str": "February 08, 2025",
    "summary": "President Trump levied substantial tariffs against Canada, which could have severely impacted its economy. However, the tariffs were subsequently suspended for 30 days. The reasoning behind the tariffs and what would appease Trump's demands remains uncertain. The decision was met with mixed reactions, with Canada expressing both frustration and cautious optimism.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/canada/a-trade-war-is-on-hold-but-trumps-motives-and-a-fix-remain-uncertain.html",
    "url": ""
  },
  {
    "title": "War's Destructive Impact on Ukrainian Education",
    "date_str": "February 08, 2025",
    "summary": "Ukrainian students are being forced to attend classes underground or online, particularly in frontline areas. This disruption is due to ongoing hostilities and has significant consequences for their academic and social development. Education experts express concern that Ukrainian children are falling behind due to the lack of regular, in-person learning opportunities. The conflict has also forced many schools to close, exacerbating the issue.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/europe/ukraine-russia-war-education.html",
    "url": ""
  }
]