[
  {
    "title": "US President Trump Announces Ukraine Peace Talks Following Conversation with Putin",
    "date_str": "February 13, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c04n622gzx7o",
    "url": ""
  },
  {
    "title": "Confusion Hinders Efforts to Preserve Gaza Truce",
    "date_str": "February 13, 2025",
    "summary": "Egypt and Qatar are intensifying diplomatic efforts to prevent the resumption of fighting amidst growing concerns that the recently established Gaza ceasefire is fragile. Key players involved include officials from Egypt and Qatar, who are mediating between Hamas and Israel. The background of the situation involves a history of conflict and tensions between Israel and the Palestinians, specifically in the Gaza Strip.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cd7d9p0j5qeo",
    "url": ""
  },
  {
    "title": "Austria's Political Instability Deepens as Far-Right Fails to Form Cabinet",
    "date_str": "February 13, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c78x3klx4rjo",
    "url": ""
  },
  {
    "title": "Ballistic Missile Attack Kills One in Kyiv, Confirms Ukraine",
    "date_str": "February 13, 2025",
    "summary": "On February 12, 2025, a ballistic missile attack in Kyiv, Ukraine resulted in the death of one individual. Ukrainian President Volodymyr Zelensky had previously suggested the possibility of a territory swap as part of peace negotiations with Russia. The attack underscores the ongoing conflict in Ukraine and its impact on the country's civilian population.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce85x4792w6o",
    "url": ""
  },
  {
    "title": "Shell Ignored Whistleblower's Warnings of Oil Clean-Up Scam",
    "date_str": "February 13, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c0rqe85q1jno",
    "url": ""
  },
  {
    "title": "U.S. and Russia's Improving Relations Leave Ukraine in a Difficult Position",
    "date_str": "February 13, 2025",
    "summary": "President Donald Trump's recent actions, including a phone call with Russian President Vladimir Putin and a reported demand for access to Ukrainian mineral rights, have raised concerns for Ukrainian President Volodymyr Zelensky. These developments underscore the complex geopolitical landscape and the potential impact of foreign powers on Ukrainian sovereignty.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/13/world/europe/ukraine-russia-us-diplomacy.html",
    "url": ""
  },
  {
    "title": "Hamas Indicates Steps Taken for Renewed Release of Captives",
    "date_str": "February 13, 2025",
    "summary": "Mediators are actively attempting to resolve obstacles and bridge differences in the ceasefire negotiations between Hamas and Israel, despite a previous setback. Hamas and Israel remain the key players involved in the negotiations, which aim to end the recent conflict. The roadblock in the ceasefire deal underscores the ongoing challenges and complexities in the Middle East peace process.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/13/world/middleeast/gaza-israel-ceasefire-hostages.html",
    "url": ""
  },
  {
    "title": "Russia Faces the Toughest Conflict Yet in the Ukrainian War",
    "date_str": "February 12, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/12/world/europe/kursk-russia-war-ukraine.html",
    "url": ""
  },
  {
    "title": "Powerful Tropical Cyclone Zelia Approaches Northwest Australia",
    "date_str": "February 13, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/13/world/cyclone-zelia-australia.html",
    "url": ""
  },
  {
    "title": "Thursday Briefing: Trump and Putin Discuss an End to Ukraine War",
    "date_str": "February 12, 2025",
    "summary": "Thailand anticipates a surge in tourism due to the popularity of the television series \"White Lotus,\" which showcases the country's stunning landscapes and cultural customs. This phenomenon, known as the \"White Lotus effect,\" is expected to attract foreign visitors, boosting Thailand's tourism industry and economic recovery following the pandemic. Key players in this trend include the Thai Tourism Authority and tourism operators who are actively promoting the country's attractions inspired by the series. This development builds upon Thailand's reputation as a popular tourist destination, known for its tropical beaches, historical temples, and vibrant nightlife.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/12/briefing/trump-putin-ukraine-india-modi-venezuela-colombia-rebels.html",
    "url": ""
  }
]