[
  {
    "title": "Witnesses Say Israeli Air Strikes Displaced Hundreds of Families in Gaza",
    "link": "https://www.bbc.com/news/articles/c62884y1pl5o",
    "source": "BBC",
    "pub_date": "Mon, 30 Jun 2025 09:27:42 GMT",
    "summary": "Israeli air strikes on Gaza displaced hundreds of families and reportedly killed at least five people, fueling fears of an imminent and intensified ground offensive. Witnesses report widespread damage, including to facilities sheltering displaced people, exacerbating the humanitarian crisis. These actions occur within the broader context of the ongoing Israel-Gaza conflict, involving Israel and Hamas, and raise concerns about further escalation. The international community closely monitors the situation, with potential implications for regional stability.",
    "date_str": "June 30, 2025"
  },
  {
    "title": "Russian Attacks with Drones and Missiles Strike Outside Typical Ukrainian Areas",
    "text": "The overnight attack was one of the largest on Ukraine and included strikes in the western part of the country, which is hit less often.",
    "link": "https://www.nytimes.com/2025/06/29/world/europe/russia-ukraine-war.html",
    "date_str": "June 29, 2025",
    "source": "NYT",
    "summary": "Russia launched a major overnight attack on Ukraine, significantly expanding the scope of its strikes to include the country's western regions, marking a notable shift in tactics. This intensification of the conflict demonstrates Russia's ongoing commitment to degrading Ukrainian infrastructure and military capabilities. The Ukrainian government continues to seek increased international support to bolster its air defenses and resilience against these escalating attacks. The attack highlights the war's persistent threat to civilians and underscores the urgent need for de-escalation efforts and a diplomatic resolution."
  },
  {
    "title": "Conflicts Reshape Air Travel Amidst Iran-Israel Strikes and Russia's War",
    "text": "Whether caused by a long war or brief skirmish, the closing of skies to air travel is having big effects on cost, convenience and safety.",
    "link": "https://www.nytimes.com/2025/06/30/world/asia/iran-israel-airlines-war.html",
    "date_str": "June 30, 2025",
    "source": "NYT",
    "summary": "Sky closures, regardless of their cause, are significantly disrupting global air travel, impacting costs, convenience, and safety for both passengers and cargo operations. Military conflicts, whether protracted or short-lived, directly lead to airspace restrictions and rerouting of flights, consequently increasing fuel consumption and flight times. Airlines and passengers bear the brunt of these disruptions, facing higher ticket prices, delays, and potential security risks associated with navigating conflict zones. Policymakers and aviation authorities must collaborate to mitigate the impact of these closures and ensure the safe and efficient movement of people and goods amidst increasing geopolitical instability."
  }
]