[
  {
    "title": "Ghana Vice-president Accepts Election Defeat",
    "date": "2024-12-08T10:56:38+00:00",
    "date_str": "December 08, 2024",
    "summary": "Ghana 's Vice-President Mahamudu Bawumia has accepted defeat in Saturday 's election. He congratulated former President John Mahama on his victory. The elections come amid the country 's worst economic crisis in a generation. No official results have been declared because supporters of the two main parties were impeding the process. President Nana Akufo-Addo is stepping down after reaching the official limit of two terms.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cdx9nlyjke4o",
    "region": "Middle East"
  },
  {
    "title": "Watch: Bbc Reports from Inside Damascus",
    "date": "2024-12-08T10:08:25+00:00",
    "date_str": "December 08, 2024",
    "summary": "BBC 's Barbara Plett-Usher says she has heard gunfire and explosions but it is relatively calm in Damascus. President Assad is said to have left by plane to an unknown location. Planes wobble at Heathrow during Storm Darragh. Cranes work to stabilise growing sinkhole. Moment earthquake hits California and damages store. The DNA tests with life-changing results. The magazine of the 90s lad culture. Read about our approach to external linking.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/ce8xy02n4mjo",
    "region": "Middle East"
  },
  {
    "title": "'no-one Slept in Syria Last Night' - How News of Assad's Toppling Spread",
    "date": "2024-12-08T08:58:20+00:00",
    "date_str": "December 08, 2024",
    "summary": "Residents in Damascus have told of an anxious wait for news on what was happening in Syria 's capital city overnight. Unverified videos circulating on social media show people cheering in the streets and welcoming the rebel fighters. Yazan Al Amari runs a small phone shop in Deraa where civilian militias affiliated with Hayat Tahrir al-Sham have already taken control. His family are making preparations to leave Syria, but the borders with Lebanon and Jordan are closed.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2772e082do",
    "region": "Middle East"
  },
  {
    "title": "New Images Released As Hunt for New York Shooter Continues",
    "date": "2024-12-08T08:30:19+00:00",
    "date_str": "December 08, 2024",
    "summary": "Police have released two new images of a suspect in the hunt for the gunman who killed a health insurance chief executive in New York. UnitedHealthcare boss Brian Thompson, 50, was shot in the back as he made his way to a conference on Wednesday. The FBI has offered a $ 50,000 ( £39,000 ) reward for information leading to the suspect 's arrest. The latest images of the man being sought are both taken from a vehicle.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cpw22ger4gjo",
    "region": "Middle East"
  },
  {
    "title": "End of Assad Rule Will Reshape Region's Balance of Power",
    "date": "2024-12-08T07:32:16+00:00",
    "date_str": "December 08, 2024",
    "summary": "The fall of Bashar al-Assad was almost unthinkable just a week ago. With the help of Russia and Iran, he crushed the rebels, and survived. The end of the Assad family 's five-decade rule will reshape the balance of power in the region. Iran, again, is seeing its influence suffer a significant blow. At the same time, the dramatic changes could lead to a dangerous power vacuum.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8j99447gj1o",
    "region": "Middle East"
  }
]