[
  {
    "title": "Justin Baldoni Stripped of Women's Solidarity Award After Allegations",
    "date_str": "December 24, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/clyvz4rvvpyo",
    "url": ""
  },
  {
    "title": "Russian Ship Affected by US Sanctions Sinks Due to Engine Room Explosion",
    "date_str": "December 24, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c627n83ezlwo",
    "url": ""
  },
  {
    "title": "Hong Kong Seeks International Assistance in Apprehending Fugitive Activists",
    "date_str": "December 24, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cvgmj87248no",
    "url": ""
  },
  {
    "title": "BBC Reporter Returns Home Ravaged by Syria's Civil War",
    "date_str": "December 24, 2024",
    "summary": "During the brutal fighting between rebel and government forces in Syria's Yarmouk district, BBC journalist Feras Killani recently visited his former childhood home, which had been destroyed. The conflict has had a significant impact on the region, notably in the Yarmouk district, which witnessed intense fighting. Killani, a former resident of the area, returned to the ruins, providing a first-hand account of the devastation.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/cdjgryg391jo",
    "url": ""
  },
  {
    "title": "Kenyan Forces Patrol Haiti's Gang-Ridden War Zone",
    "date_str": "December 24, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8xj5xqq9w8o",
    "url": ""
  },
  {
    "title": "U.S.-Backed Militias in Afghanistan Surpass Taliban in Brutality",
    "date_str": "December 24, 2024",
    "summary": "The U.S. laid the foundation for the Taliban's conquest of Afghanistan through inadvertent actions that weakened the Afghan military and government over time. These actions, despite public finger-pointing by former President Trump and President Biden, contributed significantly to the Taliban's rapid and unexpected victory in 2021. Key players involved in these actions include the U.S. military, the Afghan government, and the Taliban. The investigation reveals the complex and often unintended consequences of U.S. policies in the region.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/24/world/asia/afghanistan-taliban-us-militias.html",
    "url": ""
  },
  {
    "title": "Israel Intercepts Houthi Missile and Threatens Militant Group’s Leaders",
    "date_str": "December 24, 2024",
    "summary": "Israeli forces intercepted a Houthi missile fired from Yemen, prompting a stern response from Defense Minister Yoav Gallant, who vowed to eliminate the group's leadership. The incident underscores the escalating tensions between Israel and the Iran-aligned Houthi movement amid ongoing conflict in Yemen.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/24/world/middleeast/israel-houthis-yemen-missile.html",
    "url": ""
  },
  {
    "title": "Romania's Postponed Vote Gives Russia a Propaganda Win",
    "date_str": "December 23, 2024",
    "summary": "The annulment of the first round of Romania's presidential election has sparked concerns about democratic integrity. Despite criticism from some quarters, the decision to invalidate the victory of a pro-Russian candidate has been met with approval by Western observers. Key players include President Klaus Iohannis, who has supported the annulment, and ex-Prime Minister Victor Ponta, the defeated frontrunner. The background includes a long-standing perception that Romania is vulnerable to Russian influence, making the election and its outcome politically sensitive.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/23/world/europe/romania-election-russia.html",
    "url": ""
  },
  {
    "title": "The War's Impact on Tradition: 'The Nutcracker' Faces Cultural Loss in Ukraine",
    "date_str": "December 22, 2024",
    "summary": "Lithuania's national opera house halted performances of Tchaikovsky's \"Swan Lake\" in support of Ukraine during the ongoing conflict with Russia. However, newly appointed Culture Minister Simonas Kairys sparked controversy by voicing his admiration for the Russian composer. This decision has reignited debate about the role of Russian art in Lithuania, where historical tensions with Russia remain strong and there is concern about Russian influence in the country.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/22/world/europe/-nutcracker-lithuania-russia-ukraine.html",
    "url": ""
  },
  {
    "title": "Iran's Energy Crisis Reaches Critical Levels, Shutting Down Industries",
    "date_str": "December 21, 2024",
    "summary": "Iran's energy emergency, exacerbated by its abundant natural gas and crude oil reserves, has intensified amidst geopolitical challenges. Despite its substantial energy resources, Iran's energy situation has deteriorated, leading to a crisis that poses significant risks to the country's economy and stability. This emergency comes at a time of heightened tensions between Iran and the West, further complicating the situation.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/21/world/middleeast/iran-economy-energy-crisis.html",
    "url": ""
  }
]