[
  {
    "title": "The UN Food Programme Warns Almost a Third of Gazans Are Going Days Without Food",
    "link": "https://www.bbc.com/news/articles/ckgjg81qqwvo",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 04:08:43 GMT",
    "summary": "The UN warns that nearly one-third of Gaza's population face severe food insecurity, with many reportedly going days without eating. Israel faces increasing pressure from Western allies to ease restrictions on aid flowing into Gaza amid concerns about the humanitarian crisis. This development unfolds against the backdrop of the ongoing conflict between Israel and Hamas and further exacerbates the already dire living conditions for Palestinians in the region. The restrictions imposed by Israel significantly impede the delivery of essential supplies to civilians. The international community closely monitors the situation, urging all parties to facilitate humanitarian assistance.",
    "date_str": "July 26, 2025"
  },
  {
    "title": "Former GHF Aid Site Worker Tells BBC He Witnessed War Crimes in Gaza",
    "link": "https://www.bbc.com/news/videos/cy8k8045nx9o",
    "source": "BBC",
    "pub_date": "Fri, 25 Jul 2025 22:10:39 GMT",
    "summary": "A former worker at the Israel and US-backed Gaza Humanitarian Foundation (GHF) told the BBC he witnessed war crimes in Gaza, leading him to resign from his position. The retired US soldier, Anthony Aguilar, cited his experiences at the aid site as the primary reason for his departure. His accusations raise concerns about the conduct of the ongoing Israel-Gaza conflict and the operations of humanitarian aid organizations in the region. This development adds to the existing scrutiny surrounding the conflict, as international bodies and governments continue to assess the situation and seek avenues for resolution and accountability.",
    "date_str": "July 26, 2025"
  },
  {
    "title": "Five People Died During Ukrainian and Russian Drone Attacks",
    "link": "https://www.bbc.com/news/articles/cvgv3ppl7m3o",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 11:31:12 GMT",
    "summary": "Ukraine and Russia exchanged drone attacks, resulting in casualties on both sides of the conflict. Russian strikes on Dnipro, Ukraine killed three individuals, while Ukrainian attacks in Russia's Rostov region led to two fatalities. These attacks highlight the escalating use of drone warfare by both Ukraine and Russia, demonstrating the ongoing expansion of the conflict's geographic scope. The reciprocal attacks underscore the persistent tensions and lack of de-escalation between the two countries, further complicating diplomatic efforts. The international community closely monitors the conflict, particularly the increasing reliance on unmanned aerial vehicles, which could potentially trigger further escalation.",
    "date_str": "July 26, 2025"
  },
  {
    "title": "School-Leavers Are Dying for Russia in Putin's War Against Ukraine",
    "link": "https://www.bbc.com/news/articles/ce9xkg7dmd5o",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 00:54:03 GMT",
    "summary": "Amidst the ongoing Russia-Ukraine war, the BBC reports that Russia has deployed and suffered losses among soldiers as young as 18, despite assurances from Moscow that it would not send school-leavers to the front lines. This deployment contradicts Russia's stated policy and raises questions about troop recruitment and resource management under Vladimir Putin's leadership. The investigation highlights the human cost of the conflict, particularly for inexperienced conscripts, and challenges the Kremlin's narrative regarding the scope and nature of its military involvement in Ukraine. This news comes as the conflict continues to escalate and places further scrutiny on Russia's military practices and adherence to international norms.",
    "date_str": "July 26, 2025"
  },
  {
    "title": "Israeli Military Officials Say There Is No Proof Hamas Routinely Stole U.N. Aid",
    "text": "Israel has long restricted or completely blocked aid to Gaza on the argument that Hamas steals it to use as a weapon of control over the population.",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/hamas-un-aid-theft.html",
    "date_str": "July 26, 2025",
    "source": "NYT",
    "summary": "Israel has historically restricted or completely blocked humanitarian aid to Gaza, citing concerns that Hamas appropriates the supplies for its own purposes and to consolidate control over the Gazan population. These restrictions, imposed due to Israel's security concerns and its designation of Hamas as a terrorist organization, significantly impact the availability of essential resources within Gaza. This dynamic creates a complex challenge, as the need to provide humanitarian assistance clashes with Israel's efforts to prevent aid from bolstering Hamas's authority and capabilities. The ongoing conflict exacerbates this situation, further complicating the delivery of vital supplies to civilians."
  }
]