[
  {
    "title": "US Envoy Will Visit Gaza After Hospital Reports Dozens Killed While Seeking Food",
    "link": "https://www.bbc.com/news/articles/c74d82pdxjzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 31 Jul 2025 19:05:14 GMT",
    "summary": "Amidst dire humanitarian conditions, US envoy Steve Witkoff will travel to Gaza to assess food distribution sites. The visit occurs as a hospital reports the deaths of dozens of Palestinians seeking food, highlighting the acute food shortages and desperation within the region. This mission underscores the US's concern over the humanitarian crisis unfolding in Gaza and aims to evaluate the effectiveness of aid delivery. The broader context involves the ongoing conflict and its severe impact on the civilian population's access to basic necessities. The White House hopes Witkoff's assessment will inform future aid strategies and diplomatic efforts.",
    "date_str": "August 01, 2025"
  },
  {
    "title": "Zelensky Calls for Stricter Sanctions After Russian Strikes Kill 31 in Kyiv",
    "link": "https://www.bbc.com/news/articles/c5ypdxnz6k2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 01 Aug 2025 10:40:21 GMT",
    "summary": "Following one of the deadliest assaults on Kyiv since the 2022 invasion, Ukrainian President Volodymyr Zelensky demands increased sanctions against Russia. Russian strikes on the capital killed 33 people, prompting Zelensky to call for a stronger international response. The strikes underscore the ongoing vulnerability of Kyiv despite previous efforts to bolster air defenses, and highlight the continuing human cost of the conflict, increasing pressure on Western allies to escalate measures against Moscow. This event takes place amidst the broader context of the ongoing war in Ukraine, with Russia continuing its military offensive and Ukraine seeking greater international support to defend its sovereignty.",
    "date_str": "August 01, 2025"
  },
  {
    "title": "Myanmar Ends Emergency Rule, Enabling Disputed Election",
    "text": "The military government hopes elections can bring more international legitimacy. But the generals will still rule, and opposition groups are boycotting.",
    "link": "https://www.nytimes.com/2025/07/31/world/asia/myanmar-emergency-election.html",
    "date_str": "July 31, 2025",
    "source": "NYT",
    "summary": "Myanmar's military junta plans elections to bolster its international standing, yet these elections are unlikely to resolve the ongoing political crisis. The generals intend to maintain control regardless of the outcome, signaling a continuation of authoritarian rule. Opposition groups are actively boycotting the process, highlighting the lack of genuine political participation and further undermining the election's legitimacy. This situation extends the power vacuum in the nation following the 2021 coup."
  }
]