[
  {
    "title": "Israel and Lebanon's Hezbollah start a ceasefire after nearly 14 months of fighting",
    "date_str": "December 09, 2024",
    "summary": "Israel approved a ceasefire with Lebanon's Hezbollah on Tuesday, ending 14 months of fighting. Displaced Lebanese families celebrated the ceasefire, while displaced Israelis and relatives of hostages expressed mixed views.",
    "source": "AP",
    "link": "https://apnews.com/article/israel-palestinians-hamas-lebanon-hezbollah-11-26-2024-aa165645d900a3d681ad127e05b0c561"
  },
  {
    "title": "ICC issues arrest warrants for Netanyahu, Hamas officials..",
    "date_str": "December 09, 2024",
    "summary": "The International Criminal Court issued arrest warrants on Thursday for Israeli Prime Minister Benjamin Netanyahu and top Hamas officials, accusing them of crimes against humanity during the ongoing war that began over a year ago. Israeli Prime Minister Benjamin Netanyahu denounced the arrest warrants as a \"black day\" in history, while the accused Hamas officials have not yet commented.",
    "source": "AP",
    "link": "https://apnews.com/article/icc-israel-hamas-warrants-netanyahu-palestinian-arrest-73c854d072e0a1a41b19b2cb2cdd07fa"
  },
  {
    "title": "Occupied Ukrainian Prison Director Murdered in Vehicle Explosion",
    "date_str": "December 09, 2024",
    "summary": "Sergei Yevsyukov, the former head of the Olenivka Prison in Russian-occupied Ukraine, was killed in a car blast in Donetsk. Russian authorities have opened a criminal investigation, while Ukrainian media report that the blast was the latest in a series of attacks targeting pro-Kremlin figures.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c5y867penn8o"
  },
  {
    "title": "Aftermath of Assad's Overthrow: Bereaved and Incarcerated Families Respond",
    "date_str": "December 09, 2024",
    "summary": "Following the collapse of Assad's regime, relatives of those killed or imprisoned have gathered at notorious Syrian jails, including Saydnaya prison, seeking news of loved ones who disappeared during the regime's crackdown on dissent. The collapse came after a rebel offensive led by Hayat Tahrir al-Sham (HTS",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/cy0n8z7gjxvo"
  },
  {
    "title": "Ukrainian President Zelensky Announces the Loss of 43,000 Troops in Conflict with Russia",
    "date_str": "December 09, 2024",
    "summary": "Around 43,000 Ukrainian soldiers have died, with 370,000 more injured, since the start of Russia's invasion. President Zelensky believes Trump's false claims sparked his admission, which is significantly higher than his previous estimate of 31,000 deaths.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c5yv75nydy3o"
  },
  {
    "title": "South Korea's Protesters Express Disappointment as Impeachment Hopes Diminish",
    "date_str": "December 09, 2024",
    "summary": "Tens of thousands of protesters gathered in Seoul, demanding President Yoon Suk Yeol's impeachment over his failed martial law attempt, despite his apology. Despite a festive atmosphere, the impeachment vote failed due to a boycott by the ruling party, which left the opposition short of the necessary votes.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cj0rrn7e1qgo"
  },
  {
    "title": "President Zelensky: Ukraine Has Lost 43,000 Soldiers in Russia's Invasion",
    "date_str": "December 09, 2024",
    "summary": "The U.S. and military analysts estimate that 70,000 Russian soldiers have been killed in Ukraine, but Russia claims the losses are far lower. Russia did not provide an official figure for its casualties.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/08/world/europe/ukrainian-war-dead.html"
  },
  {
    "title": "Syrians Forced to Flee by Conflict Return Amidst Uncertain Future",
    "date_str": "December 09, 2024",
    "summary": "The Syrian Civil War has resulted in a massive displacement crisis, with countless people attempting to return home after 13 years. So far, the number of returnees remains undocumented.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/09/world/middleeast/syria-displaced.html"
  },
  {
    "title": "Turkish Forces Engage U.S.-Supported Rebel Groups Amidst Syrian Instability",
    "date_str": "December 09, 2024",
    "summary": "Turkish-backed rebels clashed with U.S.-backed Kurdish forces in northern Syria, resulting in an armed conflict between proxies of NATO allies. No official responses from relevant parties have been reported.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/08/world/middleeast/syria-turkey-kurds.html"
  }
]