[
  {
    "title": "What we know about leaked US draft plan to end Russia's Ukraine war",
    "link": "https://www.bbc.com/news/articles/cde6yld78d6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 21 Nov 2025 20:15:11 GMT",
    "summary": "A leaked U.S. draft plan proposes a framework to end the Russia-Ukraine war, outlining 28 key points that could serve as a basis for negotiations. While some aspects of the plan might prove acceptable to Kyiv, others reportedly cross Ukraine's red lines, potentially complicating the path to a resolution. The plan's emergence highlights the ongoing efforts by the U.S. to find a diplomatic solution involving Russia and Ukraine, though the specific details and the reactions of key players like Presidents Vladimir Putin and Volodymyr Zelenskyy remain crucial factors in determining its viability. The leak occurs amidst continued fighting and underscores the complex geopolitical considerations involved in mediating the conflict.",
    "date_str": "November 22, 2025"
  },
  {
    "title": "Ukrainians Endure Pain While Hope of Finding Survivors Diminishes",
    "text": "Russian missiles hit apartment buildings in Ternopil this week, far from the war’s front line. Dozens of civilians, including children, were killed.",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-ukraine.html",
    "date_str": "November 22, 2025",
    "source": "NYT",
    "summary": "Russian forces targeted apartment buildings in Ternopil, western Ukraine, this week, killing dozens of civilians, including children, and demonstrating Russia's continued capacity to strike deep within Ukrainian territory. These strikes, far from the active front lines, highlight the deliberate targeting of civilian infrastructure and represent a potential escalation of the conflict by Russia. The Russian military's actions prompted international condemnation and raised concerns regarding potential war crimes. This latest attack comes amidst ongoing Ukrainian calls for increased air defense systems from Western allies to counter Russia's aerial bombardment campaign."
  },
  {
    "title": "Zelensky Says Ukraine Faces Tough Decision on US Plan to End War",
    "text": "A U.S.-Russian proposal would require Kyiv to give up territory and reduce its army. If Moscow complies with the terms, it could receive benefits including reintegration into the global economy.",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/ukraine-russia-trump-peace-plan.html",
    "date_str": "November 21, 2025",
    "source": "NYT",
    "summary": "A U.S.-Russian proposal seeks to end the conflict in Ukraine by compelling Kyiv to cede territory and downsize its military, potentially altering the country's sovereignty and defense capabilities. The proposal also outlines potential benefits for Moscow, including renewed access to the global economy, if Russia adheres to the agreement's terms. These negotiations, involving the United States and Russia, occur against the backdrop of ongoing war and strained relations, impacting the geopolitical balance in Eastern Europe and the broader international order. The proposal's success hinges on the willingness of all parties, including Ukraine, to accept the proposed compromises and the enforceability of the terms."
  }
]