[
  {
    "title": "Ukraine Says Russia Launched Massive Drone Attack Before Putin-Trump Call",
    "link": "https://www.bbc.com/news/articles/c1ldm42eyzmo",
    "source": "BBC",
    "pub_date": "Sun, 18 May 2025 17:19:03 GMT",
    "summary": "Ukraine reports Russia launched its largest drone attack of the war, a significant escalation of hostilities.  This attack, the largest since the invasion began, occurred ahead of a planned phone call between Presidents Trump and Putin.  The United States is reportedly pushing for a ceasefire in the ongoing conflict.  This development suggests a potential shift in the dynamics of the war, as major powers explore avenues for de-escalation and a possible resolution.",
    "date_str": "May 19, 2025"
  },
  {
    "title": "Nine Civilians Died After a Russian Strike Hit a Bus in Ukraine",
    "link": "https://www.bbc.com/news/articles/cz0d31ydlg7o",
    "source": "BBC",
    "pub_date": "Sat, 17 May 2025 13:39:51 GMT",
    "summary": "In Ukraine's northeastern Sumy region, a Russian strike on a civilian bus resulted in the reported deaths of nine individuals, with an additional seven sustaining injuries. This attack, purportedly carried out by a drone, marks another instance of civilian casualties amid the ongoing conflict. While the exact details of the attack, including the specific weaponry used and the circumstances surrounding the bus's presence in the area, are still under investigation, the incident underscores the persistent risks faced by civilians in the war. This event is a further escalation of hostilities, highlighting the disregard for civilian safety as the conflict continues.",
    "date_str": "May 19, 2025"
  },
  {
    "title": "Trump and Putin Will Discuss the Ukraine War During a High-Stakes Call",
    "text": "A telephone call between the two leaders would be the latest chapter in a flurry of diplomatic maneuvering over ending the three-year conflict.",
    "link": "https://www.nytimes.com/2025/05/19/world/europe/trump-putin-ukraine.html",
    "date_str": "May 19, 2025",
    "source": "NYT",
    "summary": "Following a period of intense diplomatic activity, a telephone call between the leaders signals a crucial moment in efforts to resolve the ongoing three-year conflict. This high-level communication, the latest in a series of maneuvers, underscores the importance of direct engagement in seeking a cessation of hostilities. The involved leaders, whose identities remain unspecified in this brief report, are central to any potential peace negotiations. The call's outcome will likely determine the trajectory of the conflict and impact the wider regional stability."
  },
  {
    "title": "Israel Announced a New Gaza Invasion, but Its Intent Remains Unclear",
    "text": "After warning of a major ground operation, Israel has bombarded Gaza but has yet to start a big advance. The threat to do so may be an attempt to force Hamas to compromise in cease-fire talks.",
    "link": "https://www.nytimes.com/2025/05/19/world/middleeast/israel-new-invasion-of-gaza.html",
    "date_str": "May 19, 2025",
    "source": "NYT",
    "summary": "Following warnings of a large-scale ground offensive, Israel has intensified its bombardment of Gaza. This action comes amid ongoing negotiations for a ceasefire with Hamas, suggesting a strategic effort to pressure the militant group into concessions. Israeli military leaders are the key actors in this dynamic. This strategy is unfolding against the backdrop of escalating conflict, with the potential for significant escalation depending on Hamas's response and the progress of diplomatic efforts."
  }
]