[
  {
    "title": "The European Union Has Agreed Upon New Sanctions Targeting Russia",
    "link": "https://apnews.com/article/europe-ukraine-russia-sanctions-gaza-30a4a1ed77e8e59d0692d18c1252838b",
    "source": "Associated Press",
    "date_str": "October 23, 2025",
    "summary": "The European Union has agreed to impose new sanctions on Russia, targeting its \"shadow fleet\" of oil tankers and banning imports of Russian liquefied natural gas (LNG). This action by the EU aims to further limit Russia's revenue streams, which support its ongoing war in Ukraine. These measures build upon previous sanctions packages implemented by the EU and other Western nations since Russia's invasion of Ukraine, designed to pressure Moscow to de-escalate the conflict. European Commission President Ursula von der Leyen and European Council President Antonio Costa are key players involved in the EU's decision making."
  },
  {
    "title": "Photos Illustrate Ukrainians Coping With Blackouts After Russian Energy Infrastructure Strikes",
    "link": "https://apnews.com/photo-gallery/russian-strikes-ukraine-energy-blackouts-photos-57d4dbe07444e55a154b4f4acba40d24",
    "source": "Associated Press",
    "date_str": "October 21, 2025",
    "summary": "Russia intensifies its strikes against Ukraine's energy infrastructure, causing widespread blackouts as Ukrainians prepare for another difficult winter. These renewed attacks by Russia exacerbate the existing humanitarian crisis and pose significant challenges to Ukraine's resilience. The strikes, part of the broader Russia-Ukraine war, aim to cripple Ukraine's ability to function and further pressure its government. As the conflict continues, the international community monitors the situation, with various actors providing aid and support to Ukraine."
  },
  {
    "title": "Millions of Ukrainians Experience Power Outages Due to Russian Energy Grid Attacks",
    "link": "https://apnews.com/article/russia-ukraine-war-blackout-energy-winter-grid-074fafac8a4b5bb556308379808d041b",
    "source": "Associated Press",
    "date_str": "October 21, 2025",
    "summary": "Russia intensifies its energy assault on Ukraine, launching renewed strikes targeting the country's power grid and pushing millions of Ukrainians into another winter of blackouts. These attacks, orchestrated by Moscow, deliberately target critical infrastructure, exacerbating the ongoing humanitarian crisis. As Ukrainians brace for prolonged power outages, they face immense challenges in accessing essential services like heating, healthcare (including dialysis), and basic necessities. The repeated targeting of Ukraine's energy infrastructure underscores Russia's strategy of weakening Ukrainian resilience and imposing further hardship on the civilian population amidst the broader conflict."
  },
  {
    "title": "Blackouts Plague Belgorod, Russia, Amidst Increased Ukrainian Drone Attacks",
    "link": "https://www.bbc.com/news/articles/clyl2wjp4nyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 23 Oct 2025 06:19:23 GMT",
    "summary": "Ukrainian drone attacks have intensified against Belgorod, Russia, causing blackouts and prompting a retaliatory response rationale from Ukraine, citing Russia's frequent strikes on Ukrainian cities. This escalation marks a new phase in the conflict, bringing the war more directly to Russian territory. The attacks and counter-attacks highlight the ongoing vulnerability of civilian infrastructure on both sides of the Russia-Ukraine border. These events underscore the potential for further escalation and broaden the geographic scope of the conflict.",
    "date_str": "October 24, 2025"
  },
  {
    "title": "U.S. Diplomats and Troops Will Collaborate to Preserve the Gaza Cease-Fire, According to Rubio",
    "text": "Secretary of State Marco Rubio said during a visit to Israel that the State Department would increase its presence at a center set up to monitor the peace deal.",
    "link": "https://www.nytimes.com/2025/10/24/world/middleeast/gaza-ceasefire-israel-hamas-rubio-us.html",
    "date_str": "October 24, 2025",
    "source": "NYT",
    "summary": "During a visit to Israel, Secretary of State Marco Rubio announced the State Department will augment its personnel at a monitoring center established to oversee the Israeli-Palestinian peace agreement, signaling increased U.S. commitment to the accord's implementation. Rubio's announcement underscores the U.S. role as a key mediator and facilitator in the region, emphasizing a hands-on approach to ensuring adherence to the terms of the negotiated settlement. This move follows recent concerns about compliance and aims to foster greater transparency and accountability from both Israeli and Palestinian authorities. The expanded U.S. presence seeks to bolster confidence in the peace process amidst ongoing tensions and disputes."
  }
]