[
  {
    "title": "Israeli Missile Strike Hits BBC Inside Iranian State TV Building",
    "link": "https://www.bbc.com/news/videos/cgmw8g782pro",
    "source": "BBC",
    "pub_date": "Thu, 26 Jun 2025 23:10:55 GMT",
    "summary": "Amidst ongoing conflict between Israel and Iran, an Israeli missile struck an Iranian state television building. The BBC's Lyse Doucet reported from the damaged site in Tehran, highlighting the escalating tensions between the two nations. This event underscores the increasingly direct nature of the conflict, moving beyond proxy engagements and heightening concerns about regional stability. The strike against a state media outlet carries significant symbolic weight, potentially fueling further escalation in the already strained relationship between Israel and Iran.",
    "date_str": "June 27, 2025"
  },
  {
    "title": "Refugees From Ukraine Faced War Again in Israel",
    "text": "A family of five Ukrainians was killed by an Iranian missile strike in Israel, in a tragic intersection of two wars.",
    "link": "https://www.nytimes.com/2025/06/26/world/europe/ukrainian-family-israel-iran-war.html",
    "date_str": "June 26, 2025",
    "source": "NYT",
    "summary": "An Iranian missile strike in Israel killed a Ukrainian family of five, underscoring the broadening impact of both the Russia-Ukraine war and the ongoing tensions in the Middle East. The incident highlights the interconnectedness of global conflicts as Iranian-supplied weaponry, often used in Ukraine, now claims civilian lives far from its origin. This tragic event exacerbates diplomatic challenges for Israel and Ukraine, forcing them to navigate complex relationships with actors involved in both conflicts. The deaths also further intensify global concerns about the proliferation of Iranian missile technology and its destabilizing effects beyond the immediate conflict zones."
  },
  {
    "title": "Following Israeli and U.S. Strikes, Experts Assess Iran's Nuclear Program",
    "text": "President Trump’s claimed Iran’s capabilities were “obliterated.” The full extent of the damage is still emerging.",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-nuclear-program-israeli-us-attacks.html",
    "date_str": "June 26, 2025",
    "source": "NYT",
    "summary": "President Trump asserted that Iranian capabilities suffered obliteration, though the degree of the impact remains unclear. The statement follows escalating tensions between the United States and Iran, rooted in disagreements over Iran's nuclear program and regional influence. This declaration comes amid ongoing efforts to assess the actual consequences of recent events. Further investigation is needed to confirm the scope and implications of any potential damage."
  }
]