[
  {
    "title": "Von Der Leyen Claims Moscow Lacks Genuine Interest in Peace Talks",
    "link": "https://www.bbc.com/news/articles/c208wjpv4r9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Wed, 26 Nov 2025 11:33:24 GMT",
    "summary": "European Commission President Ursula von der Leyen asserted that Moscow demonstrates no genuine intention to engage in peace negotiations regarding the conflict in Ukraine. Von der Leyen affirmed the European Union's commitment to stand by Ukraine and provide unwavering support. This statement occurs amidst the ongoing war in Ukraine, where diplomatic efforts to de-escalate the conflict have thus far failed to yield substantial progress, highlighting the continued impasse between Russia and the international community. The EU's continued support signals a resolve to counter Russian aggression and uphold Ukrainian sovereignty.",
    "date_str": "November 26, 2025"
  },
  {
    "title": "As Trump Seeks to End Ukraine War, Europe Strives for Influence",
    "text": "Initially cut out of development of the 28-point peace plan, European leaders are now trying to recast its pro-Russia slant. So far, it seems to be working.",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/trump-ukraine-war-peace-plan-merz-macron-starmer.html",
    "date_str": "November 25, 2025",
    "source": "NYT",
    "summary": "European leaders are actively working to revise a 28-point peace plan initially perceived as pro-Russia. Their efforts aim to reframe the plan's perspective, suggesting a shift away from its original pro-Russia bias. This intervention highlights the ongoing geopolitical maneuvering surrounding the peace initiative and its potential impact on the conflict's resolution. The successful recalibration signifies Europe's growing influence and its desire to play a more central role in mediating the situation."
  },
  {
    "title": "Russia Launched Attacks on Ukraine, Signaling Opposition to Peace Plan Changes",
    "text": "The attack killed at least seven people in Kyiv, the authorities said, as Moscow suggested it would resist changes negotiated by Ukraine.",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/ukraine-russia-strike-peace-plan.html",
    "date_str": "November 25, 2025",
    "source": "NYT",
    "summary": "Russian forces attacked Kyiv, killing at least seven individuals, escalating tensions amidst ongoing negotiations. This attack underscores Moscow's apparent resistance to Ukrainian-negotiated changes, signaling a potential breakdown in diplomatic efforts. The Kremlin's actions risk further destabilizing the region and undermining prospects for a peaceful resolution to the conflict. This event occurs against the backdrop of protracted conflict and international efforts to mediate a ceasefire."
  }
]