[
  {
    "title": "Prison Guard Describes Widespread Abuse Within the Facility",
    "link": "https://apnews.com/article/israel-prison-deaths-palestinians-6da95374213f35f6e6ef30802d970d1e",
    "source": "Associated Press",
    "date_str": "November 18, 2025",
    "summary": "Since the start of the recent Gaza war, at least 98 Palestinians have died while in Israeli custody, according to a report by an Israeli human rights group. The report raises concerns about human rights and treatment of prisoners amidst the ongoing conflict between Israel and Hamas. This surge in deaths highlights the need for greater scrutiny of detention conditions and due process for Palestinians held by Israel. The deaths occurred in the context of heightened tensions and increased security measures following the October 7th attacks and subsequent Israeli military operations. The international community and human rights organizations are closely monitoring the situation, urging Israel to ensure the safety and well-being of all prisoners."
  },
  {
    "title": "Palestinian Deaths in Israeli Custody Have Increased",
    "link": "https://apnews.com/video/palestinian-deaths-in-israeli-custody-have-surged-a-prison-guard-describes-rampant-abuse-ap-explains-31ddf235f7804236b92741bb337ae828",
    "source": "Associated Press",
    "date_str": "November 18, 2025",
    "summary": "Since the start of the war in Gaza, deaths of Palestinians in Israeli custody have surged to nearly 100, raising concerns about systematic violence and denial of medical care within Israeli prisons and detention centers. A human rights group released a report detailing these allegations, citing the accounts of a prison guard who described rampant abuse. These deaths and reported abuses occur against the backdrop of the ongoing Israel-Hamas conflict and broader tensions in the West Bank. Figures like Itamar Ben-Gvir oversee the prison system, and the treatment of Palestinian prisoners remains a contentious issue between Israel and Palestinian society. The situation exacerbates existing human rights concerns in the region."
  },
  {
    "title": "Zelensky Is Prepared to Collaborate with the US on a Plan to End the Ukraine War",
    "link": "https://www.bbc.com/news/articles/cly1ypqlle0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 21 Nov 2025 08:06:21 GMT",
    "summary": "Amidst the ongoing conflict, Ukraine, led by President Volodymyr Zelensky, signals its readiness to collaborate with the United States on a proposed peace plan to resolve the war with Russia. Kyiv's willingness to engage with Washington reflects a potential shift in negotiation strategies and highlights the significant role the U.S. seeks to play in mediating a resolution. This development occurs within the context of continued international efforts to de-escalate the conflict, with the United States aiming to leverage its influence to foster dialogue between Ukraine and Russia. The engagement between Zelensky and the U.S. marks a crucial step towards exploring potential avenues for a negotiated settlement, though substantial challenges remain in reconciling the divergent positions of the involved parties.",
    "date_str": "November 21, 2025"
  },
  {
    "title": "Trump's Desire to End the Ukraine War Worries Kyiv",
    "link": "https://www.bbc.com/news/articles/ce3w1zeerywo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 21 Nov 2025 10:19:25 GMT",
    "summary": "Kyiv expresses concern as the United States, under a potentially accelerated timeline, pushes for a resolution to the conflict in Ukraine. Donald Trump's growing desire to end the war drives the US push, and Ukrainian officials worry the proposed deal favors Moscow's demands. The US initiative occurs against the backdrop of the ongoing conflict between Ukraine and Russia, with key figures including Trump and Ukrainian President Volodymyr Zelensky navigating complex geopolitical considerations. This situation highlights the divergence in priorities between the US and Ukraine, potentially impacting the future trajectory of the war and regional stability.",
    "date_str": "November 21, 2025"
  },
  {
    "title": "U.S.-Russian Peace Plan Demands Ukraine Cede Territory and Reduce Military",
    "text": "The 28-point proposal, which comes as the Trump administration tries to restart settlement talks, includes demands long rejected by Kyiv as  nonstarters.",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/us-russia-ukraine-peace-plan.html",
    "date_str": "November 19, 2025",
    "source": "NYT",
    "summary": "Amidst Trump administration efforts to revive settlement negotiations, an unnamed party presented a 28-point proposal to Ukraine containing demands Kyiv has historically rejected. This proposal, details of which remain undisclosed, threatens to derail renewed peace talks due to its inclusion of known Ukrainian red lines. The Trump administration's involvement highlights the US's continuing role in mediating the conflict, but the proposal's contentious nature casts doubt on its potential for success and raises questions regarding the intentions of its authors. The proposal's timing, during a period of renewed diplomatic engagement, underscores the fragile state of negotiations and the challenges in finding common ground between involved parties."
  }
]