[
  {
    "title": "Israeli Airstrike in Yemen Kills Houthi Official Ahmed al-Rahawi",
    "link": "https://apnews.com/article/yemen-houthis-israeli-strike-494d91b05e04a5dbaeda0205ef349a39",
    "source": "Associated Press",
    "date_str": "August 30, 2025",
    "summary": "No summary available"
  },
  {
    "title": "BBC Reports on Deadly Russian Attack in Kyiv",
    "link": "https://www.bbc.com/news/videos/c9wy42kjndzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 28 Aug 2025 19:20:44 GMT",
    "summary": "Russia launched a major attack on Kyiv, Ukraine, resulting in at least 19 deaths, including four children. This recent escalation highlights the ongoing conflict between Russia and Ukraine, a situation that continues to draw international concern. The BBC reported from the scene, underscoring the severity of the attack and its impact on the civilian population. This event serves as a stark reminder of the human cost of the war. The international community closely monitors these developments as they significantly impact regional stability and geopolitical dynamics.",
    "date_str": "September 02, 2025"
  },
  {
    "title": "Ukraine Is Building a Powerful Arsenal, Surpassing Security Guarantees",
    "text": "Kyiv sees a well-equipped army as a stronger deterrent to Moscow than any Western pledges to defend it. It is working to attract billions to buy more arms.",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/ukraine-weapons-security.html",
    "date_str": "September 02, 2025",
    "source": "NYT",
    "summary": "Ukraine prioritizes building a robust, domestically-equipped military as its primary defense against Russian aggression, believing tangible strength surpasses Western security guarantees. Kyiv actively seeks substantial foreign investment to modernize its armed forces and procure advanced weaponry. This push for self-reliance stems from the ongoing conflict with Russia and a desire to control its own security destiny, rather than relying solely on external actors. By strengthening its military, Ukraine aims to deter further Russian encroachment and assert its sovereignty."
  },
  {
    "title": "Experts Say Israel's Pursuit of a Gaza Deal Could Prolong the Conflict",
    "text": "A shift toward pressing for a permanent cease-fire deal, alongside plans for a new offensive in Gaza City, means the fighting is unlikely to end soon.",
    "link": "https://www.nytimes.com/2025/09/01/world/middleeast/israel-gaza-cease-fire-negotiations.html",
    "date_str": "September 01, 2025",
    "source": "NYT",
    "summary": "The ongoing conflict in Gaza intensifies as involved parties simultaneously pursue a permanent cease-fire agreement and prepare for a new offensive in Gaza City. These parallel strategies, while seemingly contradictory, highlight the complex geopolitical calculations at play, indicating that the fighting will likely continue. The pursuit of a permanent cease-fire, typically involving key international mediators and regional powers, contrasts sharply with the potential expansion of military operations, pointing to a prolonged and challenging path towards resolution. Ultimately, these developments indicate a struggle to achieve a lasting peace, leaving the region bracing for continued instability."
  }
]