[
  {
    "title": "Former President Trump Expresses Doubt Over Israel-Gaza Ceasefire's Longevity",
    "date_str": "January 21, 2025",
    "summary": "On January 21, 2025, United States President Donald Trump expressed doubt about the stability of the recent ceasefire between Israel and Gaza. The three-day ceasefire was brokered by Egypt. Trump's comments come amid concerns about the ongoing conflict and the potential for further violence. International leaders hope the ceasefire will lead to a lasting peace agreement between the two sides.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/ce9n25j375jo",
    "url": ""
  },
  {
    "title": "Trump Greeted with Awkward Air Kiss and Applause Upon Entering Capitol",
    "date_str": "January 21, 2025",
    "summary": "Former President Donald Trump entered the Capitol to applause as his wife, Melania, attempted to kiss him on the cheek, but her hat allegedly interfered. The incident raised questions about the significance of the gesture and its potential implications for the couple's relationship.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/cz9e5y9vlwzo",
    "url": ""
  },
  {
    "title": "Trump's Refugee Admission Ban Threatens Afghans, Warns Advocate",
    "date_str": "January 20, 2025",
    "summary": "The head of a resettlement group expressed concern that an executive order from the Biden administration could abandon thousands of Afghan wartime allies who aided Americans during the Taliban takeover. The order has raised concerns among humanitarian organizations and Afghan communities, who fear that the allies facing imminent danger will be left behind. This issue highlights the ongoing challenges in resettling Afghan allies and the significance of international cooperation in providing support to vulnerable individuals displaced by conflict.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/20/world/asia/refugees-afghanistan-trump.html",
    "url": ""
  },
  {
    "title": "Latin American Leaders Extend Welcome While Issuing Cautions to Trump",
    "date_str": "January 20, 2025",
    "summary": "President Trump implemented controversial immigration policies that impacted multiple nations. He also declared his intent to impose tariffs on Mexico and Canada, leading to tension among these countries. The motivations behind these actions stemmed from perceived imbalances in immigration and trade, prompting international concerns and potential economic consequences.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/20/world/americas/latin-america-trump-reaction.html",
    "url": ""
  },
  {
    "title": "Gaza Fighting Paused, but Conflict Persists",
    "date_str": "January 20, 2025",
    "summary": "The delayed start of the truce on Sunday was a minor setback in the ongoing negotiations to end the war. Key players, including the United States, exercised their leverage to facilitate the transition into the second phase, which has the potential to bring about a resolution to the conflict. The success of this critical juncture relies heavily on the parties' ability to navigate difficult choices and the active role played by the United States in mediating a lasting agreement.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/20/world/europe/gaza-war-fighting-ceasefire-hamas-israel.html",
    "url": ""
  },
  {
    "title": "Trump's Pre-Election Promise to End Ukraine Conflict Remains Unfulfilled",
    "date_str": "January 19, 2025",
    "summary": "Former President Donald Trump's pledge to secure peace between Russia and Ukraine within 24 hours of taking office failed to materialize, despite his repeated assertions. Despite the absence of a peace agreement, key players, including Trump, Russian President Vladimir Putin, and Ukrainian President Volodymyr Zelenskyy, engaged in diplomatic efforts. The background of the conflict includes a history of Russian aggression in Ukraine, including the annexation of Crimea in 2014.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/19/us/politics/trump-promise-ending-ukraine-war.html",
    "url": ""
  }
]