[
  {
    "title": "More Than 40 Killed in Democratic Republic of Congo Attack, Tied to Islamic State",
    "link": "https://www.bbc.com/news/articles/c3ezjg34lw4o",
    "source": "BBC",
    "pub_date": "Mon, 28 Jul 2025 08:05:16 GMT",
    "summary": "Islamist militants, allegedly linked to the Islamic State (IS), attacked Christian worshippers during a night vigil in Komanda, Democratic Republic of Congo, killing over forty people. The Allied Democratic Forces (ADF), a Ugandan armed group operating in the DRC and associated with IS, stands accused of perpetrating the massacre, further destabilizing the already volatile region. This incident underscores the persistent threat posed by armed groups and the expansion of IS-affiliated networks in Central Africa, exacerbating religious tensions and humanitarian concerns. The Congolese government faces mounting pressure to address the security vacuum that allows groups like the ADF to operate with impunity.",
    "date_str": "July 28, 2025"
  },
  {
    "title": "School Leavers Are Dying for Russia in Putin's War in Ukraine",
    "link": "https://www.bbc.com/news/articles/ce9xkg7dmd5o",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 00:54:03 GMT",
    "summary": "Despite Russia's assurances that it would not deploy soldiers under 18, a BBC investigation reveals that recent school leavers have been killed in action in Ukraine, raising concerns about recruitment practices and potential violations of international law. The investigation uncovers this contradiction as the war continues under the leadership of Vladimir Putin. This challenges Moscow's claims and highlights the human cost of the conflict for young Russians. The findings add a new layer to the ongoing scrutiny of Russia's military conduct and its impact on the Ukrainian populace.",
    "date_str": "July 28, 2025"
  },
  {
    "title": "Israelis Are Voicing Dissent Against the Gaza War, Saying \"Revenge Is Not a Policy.\"",
    "text": "After a long silence, prominent Israelis and activists are increasingly raising alarms about potential war crimes being carried out by the government.",
    "link": "https://www.nytimes.com/2025/07/28/world/middleeast/israel-dissent-war-gaza.html",
    "date_str": "July 28, 2025",
    "source": "NYT",
    "summary": "Mounting concerns are emerging in Israel as prominent figures and activists allege potential war crimes committed by the Israeli government. This development breaks a period of relative silence and suggests a growing divide within Israeli society regarding military conduct. The allegations, while unspecified in the original statement, likely stem from ongoing conflicts and carry significant implications for Israel's international standing and legal accountability. This internal dissent could prompt investigations and potentially reshape Israel's foreign policy approach."
  }
]