[
  {
    "title": "A Pregnant Israeli Woman Was Killed in a West Bank Shooting",
    "link": "https://www.bbc.com/news/articles/cvgq89yd7p7o",
    "source": "BBC",
    "pub_date": "Thu, 15 May 2025 07:55:53 GMT",
    "summary": "On May 14, 2025, a pregnant Israeli woman, Tzeela Gez, was killed in a shooting attack in the West Bank near the settlement of Bruchin. The attack resulted in the delivery of her baby, but Gez succumbed to her injuries.  This incident occurred within the volatile context of the Israeli-Palestinian conflict, highlighting the ongoing security challenges in the West Bank. The circumstances of the attack and the perpetrators are not provided in the article, but this event is likely to inflame tensions and could have significant implications for the peace process.",
    "date_str": "May 15, 2025"
  },
  {
    "title": "Drone Attacks Escalate Stakes in Sudan's Civil War",
    "link": "https://www.bbc.com/news/articles/cg4vz0qy77no",
    "source": "BBC",
    "pub_date": "Thu, 15 May 2025 08:58:48 GMT",
    "summary": "The recent drone strikes in Port Sudan mark a significant escalation in the ongoing civil war, highlighting the growing sophistication of drone warfare in Africa. These attacks, which targeted fuel depots, underscore a shift towards a more intense phase of the conflict. While the article does not explicitly name key players, the utilization of advanced drone technology suggests involvement from armed factions or external actors capable of deploying such weaponry. This development comes amidst a backdrop of protracted instability, with the use of drones likely to further destabilize the region and potentially prolong the bloody civil war.",
    "date_str": "May 15, 2025"
  },
  {
    "title": "A Strike on a Hospital Illustrates Israeli Attacks on Gaza's Health System",
    "text": "Aid groups and U.N. investigations have accused Israel of aiming to destroy Gaza’s health infrastructure. Israel says it is forced to strike hospitals it says are used by Hamas for military purposes.",
    "link": "https://www.nytimes.com/2025/05/14/world/middleeast/israel-medical-facility-strikes-gaza-hamas.html",
    "date_str": "May 14, 2025",
    "source": "NYT",
    "summary": "Aid organizations and UN investigations have leveled accusations against Israel, alleging a deliberate campaign to dismantle Gaza's healthcare infrastructure. This significant claim comes amid the ongoing Israeli-Palestinian conflict, where Israel maintains it targets hospitals only when they are utilized by Hamas for military operations. The accusations, which could constitute a violation of international humanitarian law, come as the conflict continues to destabilize the region, raising serious concerns about the protection of civilians and medical facilities. The dispute highlights the complex challenges of armed conflict in densely populated areas and the difficulty in verifying conflicting narratives."
  },
  {
    "title": "Israeli Strikes in Gaza Have Killed Dozens, According to the Health Ministry",
    "text": "Israel has threatened to escalate military campaign against Hamas, despite a U.S.-backed push to agree a new cease-fire.",
    "link": "https://www.nytimes.com/2025/05/15/world/middleeast/israel-strikes-gaza.html",
    "date_str": "May 15, 2025",
    "source": "NYT",
    "summary": "Israel has warned it may intensify its military operations against Hamas, creating a potential obstacle to ongoing, U.S.-led efforts to broker a new cease-fire agreement in the Gaza Strip. This escalation threat follows weeks of conflict and underscores the precariousness of the situation, with the U.S. seeking to mediate a truce between Israeli and Hamas forces. The differing approaches between Israel and the U.S. regarding the optimal strategy for ending the conflict highlight the complexities of the current negotiations and the potential for the situation to deteriorate further."
  }
]