[
  {
    "title": "As Migrant Crisis Swirled, Mexico Found Someone to Blame: Its Immigration Chief",
    "date_str": "January 14, 2025",
    "summary": "Amidst escalating border crossings, the United States exerted pressure on Mexico. Mexican officials reprimanded their immigration chief and revoked his authority to address the crisis. This move highlights the ongoing efforts by the U.S. to manage the influx of migrants and its reliance on Mexico's cooperation in controlling border flows.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/14/world/americas/mexico-migrant-crisis-us.html",
    "url": ""
  },
  {
    "title": "Ukraine Launches ‘Massive’ Drone Attacks Inside Russia, Officials Say",
    "date_str": "January 14, 2025",
    "summary": "Ukrainian forces launched a series of missile strikes against Russian military targets in its most significant offensive on Russian soil in recent times. This barrage aimed to disrupt Russia's war effort by damaging its military infrastructure. The attacks were carried out by Ukrainian forces, targeting key military sites belonging to the Russian armed forces. The missile strikes are seen as a major escalation in the conflict, as they extend the battle directly into Russian territory.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/14/world/europe/ukraine-russia-massive-drone-strikes.html",
    "url": ""
  },
  {
    "title": "Biden Officials Cautioned Putin Regarding Russia's Subversive Activities Posing an Aerial Hazard",
    "date_str": "January 13, 2025",
    "summary": "In response to intelligence about a potential Russian plot to send explosives, the White House proactively contacted President Putin. Intelligence agencies had detected Russian military preparations to ship explosive packages via cargo planes, prompting the administration to take immediate action to mitigate the threat. The incident highlights the ongoing geopolitical tensions and the crucial role of intelligence in safeguarding national security.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/13/us/politics/russia-putin-airplane-shadow-war.html",
    "url": ""
  },
  {
    "title": "Eight Supreme Court Justices Determine President's Destiny in South Korean Crisis",
    "date_str": "January 13, 2025",
    "summary": "The Constitutional Court of South Korea will deliberate on the impeachment of President Yoon Suk Yeol, who declared martial law following his election. The Court's decision will have a significant impact on the nation's political landscape, as it could lead to Yoon's removal from office. Key figures involved include Yoon and the Court justices, who are tasked with interpreting the constitutionality of his actions. The impeachment stems from allegations of corruption and abuse of power, reflecting the deep political divisions within South Korea.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/13/world/asia/south-korea-yoon-court-impeachment.html",
    "url": ""
  },
  {
    "title": "Sudanese Military Regains Control of Key City After Paramilitary Accusations",
    "date_str": "January 11, 2025",
    "summary": "Celebrations marked military victories in Sudan, signaling potential progress in the protracted civil war. Key players include the military and rebel groups, with the war's devastating impact providing critical context. The victories have sparked hopes for a turning point in the conflict, raising expectations that the parties involved could move towards a negotiated settlement. The international community closely monitors the situation, recognizing the importance of stable governance and peace for Sudan and the region.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/11/world/africa/sudan-military-recaptures-city.html",
    "url": ""
  }
]