[
  {
    "title": "Zelensky Must Decide Between Dignity and a Key Ally",
    "link": "https://apnews.com/article/russia-ukraine-war-bomb-apartment-block-zaporizhzhia-0f90db569cf222e80cfb2c1eb5ea07e1",
    "source": "Associated Press",
    "date_str": "November 21, 2025",
    "summary": "In November 2025, Ukrainian President Volodymyr Zelenskyy addressed his nation, emphasizing the difficult choice Ukraine faces regarding its sovereignty and the potential loss of crucial American support. This stark warning comes as leaders deliberate a U.S. peace proposal, which Zelenskyy suggests may favor Russia, thus putting Ukraine in a precarious position. The proposal forces Ukraine to weigh its territorial integrity against maintaining its alliance with the United States, a critical backer in its ongoing conflict. This situation unfolds against the backdrop of the continuing Russia-Ukraine war, where international support, particularly from the U.S., remains vital for Ukraine's defense."
  },
  {
    "title": "Israeli Strikes in Gaza Kill Twenty-Two Palestinians, Officials Report",
    "link": "https://www.bbc.com/news/articles/c20879zzqn8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sat, 22 Nov 2025 20:43:36 GMT",
    "summary": "Following an incident where an armed individual crossed the \"yellow line\" and engaged Israeli soldiers, Israel launched strikes across Gaza, resulting in the deaths of 22 Palestinians, according to the Hamas-run health ministry and civil defense. This recent exchange occurs within the broader context of ongoing tensions and conflict between Israel and Hamas in the Gaza Strip. The Israeli military maintains that the strikes targeted militant infrastructure in response to the initial attack. These events underscore the fragility of the security situation and the potential for escalation between the involved parties.",
    "date_str": "November 23, 2025"
  },
  {
    "title": "Here's What's Known About the Leaked US Draft Plan for Ending the Russia-Ukraine War",
    "link": "https://www.bbc.com/news/articles/cde6yld78d6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 21 Nov 2025 20:15:11 GMT",
    "summary": "A leaked U.S. draft plan proposes a framework to end the Russia-Ukraine war, outlining 28 key points. While some of the proposals might be acceptable to Kyiv, others reportedly cross Ukraine's red lines, creating potential obstacles to a negotiated settlement. The plan, if accurate, highlights ongoing efforts by the U.S. to mediate and find a resolution to the conflict between Russia and Ukraine, involving key figures such as Volodymyr Zelensky and Vladimir Putin. This development arrives amidst a complex geopolitical landscape, where previous attempts at diplomatic solutions have failed to yield lasting peace.",
    "date_str": "November 23, 2025"
  },
  {
    "title": "Ukrainians Wait in Pain as Hope to Find Strike Survivors Fades",
    "text": "Russian missiles hit apartment buildings in Ternopil this week, far from the war’s front line. Dozens of civilians, including children, were killed.",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-ukraine.html",
    "date_str": "November 22, 2025",
    "source": "NYT",
    "summary": "Russian forces struck apartment buildings in Ternopil this week, causing significant civilian casualties, including children, and marking a concerning escalation of attacks against civilian areas away from the front lines. This action highlights Russia's continued willingness to disregard civilian safety in pursuit of its military objectives in Ukraine. The attacks occurred amidst the ongoing conflict initiated by Russia, demonstrating the Kremlin's persistent strategy of targeting Ukrainian infrastructure and cities. These developments underscore the deepening humanitarian crisis and the urgent need for international efforts to protect civilians and de-escalate the conflict."
  },
  {
    "title": "20 Killed in Israeli Strikes as Israel and Hamas Trade Blame Over Truce",
    "text": "Violence has repeatedly flared up in the weeks since a cease-fire was reached, killing hundreds of Palestinians and at least three Israeli soldiers.",
    "link": "https://www.nytimes.com/2025/11/22/world/middleeast/israeli-strikes-gaza.html",
    "date_str": "November 22, 2025",
    "source": "NYT",
    "summary": "Renewed violence jeopardizes the fragile ceasefire between Israelis and Palestinians, threatening regional stability. Hundreds of Palestinians and at least three Israeli soldiers have died in recent flare-ups, highlighting the deep-seated tensions and the ceasefire's tenuous nature. This surge in hostilities underscores the difficulty in achieving a lasting peace and may prompt international actors to re-engage in mediation efforts. The inability to maintain calm threatens to unravel any progress made toward a resolution."
  },
  {
    "title": "What Is Trump’s 28-Point Plan to End Russia’s War in Ukraine?",
    "text": "President Trump is pressing Kyiv to accept an outcome that yields to President Vladimir V. Putin’s demands.",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/trump-russia-ukraine-peace-plan.html",
    "date_str": "November 22, 2025",
    "source": "NYT",
    "summary": "President Trump is exerting pressure on Kyiv to concede to Vladimir Putin's demands, signaling a potential shift in U.S. policy towards the conflict in Ukraine. This pressure comes amidst ongoing tensions between Russia and Ukraine, with Russia seeking territorial and security concessions. The move highlights a divergence in approach between the U.S. and its allies regarding the resolution of the conflict, potentially undermining international efforts to support Ukrainian sovereignty. The situation is unfolding against the backdrop of continued fighting and diplomatic efforts to find a peaceful resolution."
  },
  {
    "title": "Ukrainian and U.S. Officials Convene to Discuss Trump's Proposed War-Ending Plan",
    "text": "The talks, which Ukraine said would include European officials, come as the Trump administration’s pushes Kyiv to accept a 28-point peace plan.",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
    "date_str": "November 23, 2025",
    "source": "NYT",
    "summary": "Ukraine is scheduled to hold discussions with European officials amid escalating pressure from the Trump administration. The United States is actively encouraging Kyiv to consider a 28-point peace plan. This pressure comes as the Trump administration seeks to resolve the conflict, potentially reshaping geopolitical dynamics in Eastern Europe. These negotiations are particularly significant as they represent a concerted effort to implement a specific peace framework amidst ongoing tensions."
  }
]