[
  {
    "title": "Israel and Lebanon's Hezbollah start a ceasefire after nearly 14 months of fighting",
    "date_str": "December 10, 2024",
    "summary": "Israel and Lebanon's Hezbollah reached a US-brokered ceasefire agreement, ending 14 months of fighting related to the Gaza Strip conflict. The ceasefire was approved by Israel after consultations with displaced Israelis and families of hostages in Gaza, while displaced Lebanese families celebrated the news.",
    "source": "AP",
    "link": "https://apnews.com/article/israel-palestinians-hamas-lebanon-hezbollah-11-26-2024-aa165645d900a3d681ad127e05b0c561"
  },
  {
    "title": "ICC issues arrest warrants for Netanyahu, Hamas officials..",
    "date_str": "December 10, 2024",
    "summary": "The International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former defense minister Yoav Gallant, and Hamas officials for alleged war crimes and crimes against humanity. Netanyahu condemned the decision as a \"black day,\" while Israel has slammed the ICC's legitimacy.",
    "source": "AP",
    "link": "https://apnews.com/article/icc-israel-hamas-warrants-netanyahu-palestinian-arrest-73c854d072e0a1a41b19b2cb2cdd07fa"
  },
  {
    "title": "Rupert Murdoch's Attempt to Alter Trust Structure in Succession-Like Family Dispute Fails",
    "date_str": "December 10, 2024",
    "summary": "A recent Nevada court case denied Rupert Murdoch's attempt to modify a family trust and grant control of his media empire to his eldest son, Lachlan. The court found Murdoch and Lachlan had acted in \"bad faith.\" Murdoch's siblings welcomed the decision, hoping for reconciliation within the family, while Murdoch's lawyer expressed disappointment and plans to appeal.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c2ld084z8jjo"
  },
  {
    "title": "Israel Launches Attack on Syrian Naval Vessels",
    "date_str": "December 10, 2024",
    "summary": "Israel conducted massive airstrikes on Syria's naval fleet and military facilities, resulting in extensive damage and the destruction of the Syrian fleet. Israeli officials claim to have targeted strategic capabilities that threaten Israel and prevent weapons from falling into extremist hands. Despite acknowledging troop activity in Syrian territory beyond the demilitarized buffer zone, Israel denies reports of tanks approaching Damascus.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cqx808q7lrno"
  },
  {
    "title": "Relatives Respond to Assad's Overthrow after Loved Ones' Deaths and Incarcerations",
    "date_str": "December 10, 2024",
    "summary": "Syrian families hold out hope for loved ones imprisoned by the Assad regime, as survivors emerge following rebel advances. Assad's government has collapsed, leading to relatives' reactions and fears about the fates of those who dissented during his rule.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/cy0n8z7gjxvo"
  },
  {
    "title": "Prison Director Assassinated in Vehicle Explosion in Ukraine",
    "date_str": "December 10, 2024",
    "summary": "Sergei Yevsyukov, the former head of a prison in Russian-occupied Ukraine, was killed in a car blast in Donetsk. The incident is believed to be a targeted attack by Ukraine as part of a string of attacks on pro-Kremlin figures in occupied territories. Russian authorities have opened a criminal investigation, while Ukrainian media reports suggest Yevsyukov's wife was also injured.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c5y867penn8o"
  },
  {
    "title": "Georgia Protests Draw Parallels to Ukraine's Historic Uprisings",
    "date_str": "December 10, 2024",
    "summary": "Anti-government demonstrations in a former Soviet Republic have erupted due to tensions over alignment with Europe or Russia, similar to the conflict in Ukraine. While official responses are not specified in the provided article, it highlights the geopolitical struggle faced by the country.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/10/world/asia/georgia-protests-russia-ukraine.html"
  },
  {
    "title": "Arctic Tundra Warming Contributes to Climate Change",
    "date_str": "December 10, 2024",
    "summary": "Arctic ecosystems are transitioning from carbon sinks to sources due to increasing wildfires and thawing permafrost. This shift has not occurred for potentially thousands of years and highlights the sensitive response of Arctic environments to climate change.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/10/climate/arctic-emissions-carbon-ice-warming.html"
  },
  {
    "title": "With an Eye on China, Australia Strikes a Deal With Nauru",
    "date_str": "December 10, 2024",
    "summary": "Nauru pledged to avoid security pacts without Australia's approval in exchange for financial aid.\nAustralia has not officially commented on the agreement, but it is expected to enhance regional security ties.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/10/world/australia/australia-treaty-nauru.html"
  }
]