[
  {
    "title": "Survivors of Auschwitz Share Urgent Message as Historical Memory Wanes",
    "date_str": "January 28, 2025",
    "summary": "On the 80th anniversary of the liberation of Auschwitz, 56 survivors, joined by world leaders, shared their recollections and sounded a warning against the horrors of the past. They highlighted that as memories fade, it is imperative to keep the lessons of the Holocaust alive. President Volodymyr Zelenskyy, Ukraine's President, issued a virtual address, while German President Frank-Walter Steinmeier urged vigilance against the rise of intolerance and hatred.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c20p33pz3pzo",
    "url": ""
  },
  {
    "title": "Democratic Republic of Congo Hospitals Strain Under Siege of Goma",
    "date_str": "January 28, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cyv4606y4jzo",
    "url": ""
  },
  {
    "title": "Poland warns against restarting Russia gas supplies",
    "date_str": "January 28, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c1m5p21pmy2o",
    "url": ""
  },
  {
    "title": "Colombia Agrees to Deportation Flights to Prevent Trade Dispute with US",
    "date_str": "January 28, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c20p36e62gyo",
    "url": ""
  },
  {
    "title": "Trump Warns World Leaders to Cooperate or Face Repercussions",
    "date_str": "January 28, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cglynrxjyl5o",
    "url": ""
  },
  {
    "title": "Lebanon Faces a Mammoth Disposal Challenge: Removing War-Torn Rubble",
    "date_str": "January 28, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/28/world/middleeast/lebanon-israel-hezbollah-war-debris.html",
    "url": ""
  },
  {
    "title": "Kremlin Elevates Veterans, Learning from Past Wartime Experiences",
    "date_str": "January 28, 2025",
    "summary": "Russian veterans of the Chechnya and Afghanistan conflicts faced societal stigma and silence upon their return home. In light of the current conflict in Ukraine, there is now a significant public movement to change this situation, advocating for recognition and support for these veterans. This effort is being driven by key players such as veteran groups and government officials, who aim to break the cycle of silence and stigma surrounding Russian veterans. The initiative draws upon the historical context of past conflicts and their impact on the lives of those who fought in them.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/28/world/europe/russia-ukraine-veterans.html",
    "url": ""
  },
  {
    "title": "Colombia Faces Crisis over Trump's Deportation Policies",
    "date_str": "January 27, 2025",
    "summary": "Colombian President Gustavo Petro's refusal to accept military planes carrying deportees from the United States, an action that angered President Donald Trump, has highlighted the heightened tensions surrounding the issue of deportations. The move reflects Petro's leftist stance and his opposition to the hardline immigration policies of the Trump administration. It has also put pressure on the Colombian government to find alternative solutions for deported individuals while preserving relations with the United States.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/27/world/americas/colombia-trump-deportation-flights-migrants.html",
    "url": ""
  },
  {
    "title": "Palestinian Militant Group Releases Video of Civilian Hostage in Gaza",
    "date_str": "January 27, 2025",
    "summary": "Israel detained Arbel Yehud, a civilian, violating the cease-fire agreement reached on January 19. The Israeli authorities failed to release him as scheduled with the initial two groups of hostages, raising concerns about Israel's commitment to the deal. The cease-fire, brokered by Egypt, aimed to de-escalate tensions between Israel and Palestinian groups following cross-border attacks. Key players include Israel, with the Israeli authorities in charge of the detainee's release, and Egypt, which played a pivotal role in negotiating the agreement.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/27/world/middleeast/arbel-yehud-civilian-hostage-gaza.html",
    "url": ""
  },
  {
    "title": "European Union to Gradually Reduce Sanctions Imposed on Syria",
    "date_str": "January 27, 2025",
    "summary": "European foreign ministers have established a \"road map\" for gradually lifting financial constraints. This significant move aims to address the ongoing economic challenges faced by the region. Key players involved in this decision-making process include the foreign ministers of various European countries. The decision was made after careful consideration of the context and background of the situation, including the economic impact of financial restrictions on European nations. The staged approach to lifting restrictions will allow for a gradual return to financial stability while ensuring that necessary safeguards are in place.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/27/world/europe/eu-syria-sanctions.html",
    "url": ""
  }
]