[
  {
    "title": "Russian Strikes Kill Eight and Damage Kyiv Apartment Building, Officials Report",
    "link": "https://www.bbc.com/news/articles/ce930z8g9mvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 31 Jul 2025 12:08:05 GMT",
    "summary": "Russian forces launched strikes on Kyiv, hitting an apartment block and killing eight people, including a child and their mother. Ukrainian officials report this attack represents the highest number of child casualties in Kyiv during the war, highlighting the ongoing human cost of the conflict. These strikes occur within the broader context of Russia's continued military campaign against Ukraine, signifying an escalation in attacks targeting civilian areas. The BBC reported on this event, underscoring the international media's attention to the conflict and its impact on civilian populations.",
    "date_str": "July 31, 2025"
  },
  {
    "title": "Dozens Died in Gaza While Seeking Food, According to Hospital Reports, During US Envoy's Visit to Israel",
    "link": "https://www.bbc.com/news/articles/c74d82pdxjzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 31 Jul 2025 10:36:05 GMT",
    "summary": "Amidst a dire humanitarian crisis, dozens of Palestinians have died in Gaza while seeking food aid, according to hospital sources. The circumstances surrounding the deaths remain contested, with the Israeli military stating they fired warning shots as crowds gathered around aid lorries but claim to be unaware of casualties resulting from their fire. Simultaneously, a U.S. envoy, Witkoff, has arrived in Israel, likely to engage in diplomatic efforts related to the ongoing conflict and humanitarian situation. These events occur within the broader context of the ongoing Israel-Gaza war, exacerbating concerns over civilian safety and aid access. The situation highlights the urgent need for de-escalation and increased humanitarian assistance to address the growing needs of the population in Gaza.",
    "date_str": "July 31, 2025"
  },
  {
    "title": "Russian Missile Strike Kills and Wounds Ukrainian Servicemen at Training Unit",
    "link": "https://www.bbc.com/news/articles/cwyeg1l00rno?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Wed, 30 Jul 2025 12:48:31 GMT",
    "summary": "Amidst the ongoing conflict, Russia struck a Ukrainian military training unit, resulting in casualties. Ukraine's military reported three fatalities following the Russian strike, which Russia corroborated by releasing a video purportedly showing the event. This incident underscores the continued intensity of military operations and the targeting of Ukrainian military infrastructure by Russian forces. The attack follows a protracted period of heightened tensions and active combat between the two nations. These events exacerbate the already precarious security situation in the region.",
    "date_str": "July 31, 2025"
  },
  {
    "title": "An Israeli Strike Severely Damaged a Seaside Refuge in Gaza",
    "text": "The Israeli military said it killed at least three Hamas operatives at Al-Baqa Cafe. It also killed a journalist, an artist and two best friends reconciling after a fight.",
    "link": "https://www.nytimes.com/2025/07/30/world/middleeast/gaza-cafe-strike.html",
    "date_str": "July 30, 2025",
    "source": "NYT",
    "summary": "The Israeli military conducted a strike at Al-Baqa Cafe, killing at least three Hamas operatives, marking a continuation of targeted operations against the militant group. However, the strike also resulted in the deaths of a journalist, an artist, and two civilians, underscoring the potential for civilian casualties in densely populated areas during conflict. This incident will likely fuel further scrutiny of Israel's targeting practices and the proportionality of force employed in its ongoing operations against Hamas within the broader context of the Israeli-Palestinian conflict. International observers and human rights organizations will likely investigate the circumstances surrounding the strike and its impact on non-combatants."
  },
  {
    "title": "A Surprise Attack in East Africa Has Allies Fighting Each Other",
    "text": "Eight people were reported dead after Ugandan soldiers crossed the border into South Sudan and skirmished with troops there.",
    "link": "https://www.nytimes.com/2025/07/30/world/africa/uganda-south-sudan-skirmish.html",
    "date_str": "July 30, 2025",
    "source": "NYT",
    "summary": "Ugandan soldiers crossed the border into South Sudan, clashing with South Sudanese troops and resulting in eight fatalities, escalating tensions between the two East African nations. The incident highlights the fragile security situation along the porous border, where both countries have previously accused each other of supporting rebel groups. Ugandan People's Defence Forces' (UPDF) involvement is likely tied to its historical presence in South Sudan aimed at combating regional instability and protecting its own security interests. This latest incursion could undermine efforts to foster stability and cooperation in the volatile region."
  }
]