[
  {
    "title": "Russia Cautions Against Speculation Following Azerbaijan Airlines Tragedy",
    "date_str": "December 26, 2024",
    "summary": "In Kazakhstan, an Azerbaijan Airlines passenger plane crashed, killing 38 people. Russia has cautioned against speculating about the cause of the crash, urging restraint in formulating hypotheses until the investigation is complete. The plane was en route to Russia from Kazakhstan when it went down shortly after takeoff from Aktau airport near the Caspian Sea.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cvgp3qx0q7wo",
    "url": ""
  },
  {
    "title": "Pope Francis Calls for Negotiations to Resolve Ukraine-Russia Conflict",
    "date_str": "December 26, 2024",
    "summary": "On Christmas Day, Pope Francis led a call for negotiations to end the Ukraine-Russia conflict in his Christmas message, emphasizing the urgent need for a ceasefire in the war. The Pope also urged for the release of hostages held by Hamas in Gaza.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce8en1jn3n5o",
    "url": ""
  },
  {
    "title": "Ukraine's War Stamps Infuse Patriotism, Humor, and Colorful Language into Postal Communications",
    "date_str": "December 26, 2024",
    "summary": "Ukraine's war stamps have become a popular means to boost morale and promote patriotism domestically while also enhancing the country's international image. These stamps, some featuring patriotic designs and others bearing Ukrainian swear words, have been released by Ukrposhta, the country's postal service, since the beginning of the conflict.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cly4w8z28xzo",
    "url": ""
  },
  {
    "title": "Kenyan Forces Patrol Haiti's Gang-Ridden Zone",
    "date_str": "December 26, 2024",
    "summary": "In response to gang violence in Haiti's capital, Kenyan UN forces have been deployed to quell unrest. The BBC patrolled alongside these officers, witnessing the impact of the conflict on local residents. The gang warzone is characterized by intense street battles and human suffering, with families forced to abandon their homes and live in makeshift shelters. The UN forces aim to restore peace and order by securing key locations and working with Haitian authorities to apprehend gang members.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8xj5xqq9w8o",
    "url": ""
  },
  {
    "title": "War Shatters a Young Woman's Dreams, Compelling Her To Heal Its Wounded Warriors",
    "date_str": "December 26, 2024",
    "summary": "Amidst Sudan's civil war, a young woman played a vital role in treating civilians and combatants, working in a front-line clinic. Operating in a highly volatile environment, she faced suspicion and mistrust from both sides of the conflict. Her efforts exemplified the challenges and risks faced by health workers in humanitarian crises, highlighting the urgent need for protection and support for these dedicated individuals.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/26/world/africa/sudan-war-rsf-medical-clinic.html",
    "url": ""
  },
  {
    "title": "Famine Looms in Northern Gaza, Sparking U.S. Criticism",
    "date_str": "December 25, 2024",
    "summary": "The Gaza data collection dispute underscores challenges faced by humanitarian organizations in their efforts to provide aid amid the ongoing conflict. The dispute has hindered accurate assessments of needs and effective distribution of resources. Key players include the United Nations, which is leading the humanitarian response, and local Palestinian authorities, who have expressed concerns about data security and privacy. The broader context of the dispute includes the long-standing humanitarian crisis in Gaza and the complexities of operating in conflict zones.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/25/world/middleeast/northern-gaza-famine-warning-dispute.html",
    "url": ""
  },
  {
    "title": "Israel Intercepts Houthi Missile and Threatens Militant Group’s Leaders",
    "date_str": "December 24, 2024",
    "summary": "Following threats by Israel's defense minister to target Yemen's Houthi leadership, the Israeli military repelled an attack, the significance of which remains under investigation. The Houthi group is a key player in the ongoing Yemen conflict, supported by Iran. This incident highlights the ongoing tensions and potential escalation between Israel and Yemen, as well as the involvement of regional powers.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/24/world/middleeast/israel-houthis-yemen-missile.html",
    "url": ""
  }
]