[
  {
    "title": "Ballistic Missile Attack Kills One in Kyiv, Ukraine Confirms",
    "date_str": "February 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce85x4792w6o",
    "url": ""
  },
  {
    "title": "Whistleblower Alleges Shell Ignored Warnings of Oil Spill Cleanup Scam",
    "date_str": "February 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c0rqe85q1jno",
    "url": ""
  },
  {
    "title": "Swedish woman convicted of genocide for IS crimes against Yazidis",
    "date_str": "February 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce3lq39zpp0o",
    "url": ""
  },
  {
    "title": "Biologists Honor Warrior Princess With Striped-Faced Fish Named San",
    "date_str": "February 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cwywq42ng8yo",
    "url": ""
  },
  {
    "title": "Germany's Automotive Sector Faces Critical Challenges and Seeks Solutions",
    "date_str": "February 12, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cz6pzwj6qq7o",
    "url": ""
  },
  {
    "title": "Israel's Netanyahu Threatens Military Response in Gaza if Hostages Remain Captive",
    "date_str": "February 11, 2025",
    "summary": "Israel's Prime Minister Netanyahu threatened to end the Gaza ceasefire if Hamas does not release captive Israelis. The number of hostages demanded by Netanyahu remains unspecified. This announcement comes in response to existing tensions between the two sides, with Netanyahu citing the holding of hostages as a provocation. The ceasefire, brokered by Egypt, remains fragile, and Netanyahu's ultimatum raises concerns about its longevity.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/11/world/middleeast/israel-hamas-hostages-cease-fire.html",
    "url": ""
  },
  {
    "title": "International Nations Condemn Trump's Metal Tariffs and Threaten Countermeasures",
    "date_str": "February 11, 2025",
    "summary": "President Trump's imposition of tariffs on steel and aluminum has drawn criticism from Canada, Mexico, and European nations. These countries fear that the tariffs will spark a global trade war. Key players involved include President Trump and the governments of Canada, Mexico, and Europe. The imposition of tariffs has been driven by concerns over the trade deficit and the need to protect domestic industries, but the potential consequences are significant.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/11/world/canada/trump-metals-tariff-canada-mexico.html",
    "url": ""
  },
  {
    "title": "Russia Witnesses Intensified Fighting Amidst the Ongoing Conflict in Ukraine",
    "date_str": "February 12, 2025",
    "summary": "Russian soldiers confront intense resistance as they attempt to dislodge Ukrainian forces from a Russian-held enclave, leading to concerns among trapped civilians about a potential humanitarian crisis. The Times conducted interviews with Russian soldiers, revealing the challenges faced in this ongoing conflict. Key players include the Russian military and Ukrainian forces, with the Ukrainian resistance stalling Russian advances. The conflict has significant implications for the broader geopolitical landscape, highlighting the ongoing tension and complexities surrounding the war in Ukraine.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/12/world/europe/kursk-russia-war-ukraine.html",
    "url": ""
  },
  {
    "title": "Cease-Fire in Gaza at Risk as Netanyahu Vows Renewed Attacks",
    "date_str": "February 11, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/11/world/middleeast/israel-hamas-ceasefire-hostages.html",
    "url": ""
  },
  {
    "title": "More Than 175 World War II Practice Bombs Found at Playground in England",
    "date_str": "February 10, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/10/world/europe/wwii-bombs-playground-england.html",
    "url": ""
  }
]