[
  {
    "title": "Zelensky Says Attacks Persist Despite Putin's Easter Truce Promise",
    "link": "https://www.bbc.com/news/articles/c787v5gxny7o",
    "source": "BBC",
    "pub_date": "Sun, 20 Apr 2025 09:57:19 GMT",
    "summary": "In a significant development, Ukrainian President Volodymyr Zelenskyy has reported the continuation of Russian attacks despite a declared \"Easter truce.\" This contrasts with the Russian Defense Ministry's assertion that its forces adhered to the truce and accused Ukraine of violating it. The ongoing conflict highlights the complex dynamics and lack of adherence to previously announced ceasefire agreements. This situation further escalates tensions in the region and undermines efforts for peaceful resolution of the war.",
    "date_str": "April 20, 2025"
  },
  {
    "title": "US Strikes on Yemen Oil Terminal Reportedly Kill At Least 74, According to Houthis",
    "link": "https://www.bbc.com/news/articles/clywg335680o",
    "source": "BBC",
    "pub_date": "Sat, 19 Apr 2025 03:46:57 GMT",
    "summary": "The United States conducted airstrikes on an oil terminal in Yemen, resulting in at least 58 casualties, according to Houthi sources. The US stated the attacks aimed to curb supplies and funding for the Houthis, who condemned the strikes as a war crime. This incident occurs amidst the ongoing conflict in Yemen, with the Houthis controlling significant territory and the US actively involved in counterterrorism efforts. This escalation underscores the complex geopolitical dynamics within the region, with the US and the Houthis as the primary actors.",
    "date_str": "April 20, 2025"
  },
  {
    "title": "Carrying a Child and Luggage, I Fled a Sudanese Camp Seeking Safety",
    "link": "https://www.bbc.com/news/articles/cn80v2d7elzo",
    "source": "BBC",
    "pub_date": "Fri, 18 Apr 2025 16:05:54 GMT",
    "summary": "The ongoing civil war in Sudan has once again uprooted the lives of residents in Zamzam camp, the largest displacement camp in the country.  Fathiya Mohammed and other camp residents, displaced previously, were forced to flee due to the conflict, highlighting the continued instability. This renewed displacement underscores the humanitarian crisis exacerbated by the conflict between the Sudanese Armed Forces and the Rapid Support Forces.  The situation signifies a breakdown in the already fragile conditions in the region, leading to further hardship and instability for vulnerable populations.",
    "date_str": "April 20, 2025"
  },
  {
    "title": "Ukraine Claims Russia Violated Easter Truce Agreement",
    "text": "President Zelensky of Ukraine said the front lines had seen artillery fire and drone attacks, and that his troops were responding in kind.",
    "link": "https://www.nytimes.com/2025/04/20/world/europe/ukraine-russia-easter-truce.html",
    "date_str": "April 20, 2025",
    "source": "NYT",
    "summary": "Ukrainian President Volodymyr Zelensky announced intensified hostilities along the front lines, indicating a notable increase in artillery and drone attacks and Ukraine's retaliatory actions. This development signals a potential escalation of the ongoing conflict, with Zelensky's statements highlighting the precarious security situation. The exchange of fire underscores the continued instability in the region and reflects the persistent challenges Ukraine faces in defending its territory. The context emphasizes the need for continued international attention and support for Ukraine."
  },
  {
    "title": "Putin Declared an Easter Truce, Which Ukraine Met With Skepticism",
    "text": "President Vladimir V. Putin of Russia said that he had ordered his forces to “stop all military activity” from Saturday evening through Sunday. Ukraine’s leader said Putin was trying to “play with people’s lives.”",
    "link": "https://www.nytimes.com/2025/04/19/world/europe/russia-ukraine-easter-truce.html",
    "date_str": "April 19, 2025",
    "source": "NYT",
    "summary": "President Vladimir Putin has announced a temporary cessation of military activities in Ukraine from Saturday evening through Sunday. This unilateral ceasefire, a move likely timed for the Orthodox Christmas holiday, presents a limited window of reduced hostilities. Ukrainian President Volodymyr Zelenskyy has criticized the pause, viewing it as a disingenuous attempt to manipulate public opinion. The declaration comes amidst protracted conflict and signals Russia's continued strategic efforts, even if temporarily, to control the narrative surrounding the ongoing war."
  },
  {
    "title": "Israeli Attacks in Gaza Have Killed Dozens, According to the Health Ministry",
    "text": "Israel was keeping up its intense bombing campaign in the enclave, which has exacted a heavy price on civilians struggling to find safe places to shelter.",
    "link": "https://www.nytimes.com/2025/04/19/world/middleeast/israel-gaza-strikes-death-toll.html",
    "date_str": "April 19, 2025",
    "source": "NYT",
    "summary": "Israel continues its intensive bombing campaign in the Gaza Strip, resulting in significant civilian casualties amid the ongoing conflict. This sustained aerial bombardment highlights the severity of the humanitarian crisis and the challenges in protecting non-combatants. The Israeli military's actions and their impact on civilians are central to the ongoing escalation. This context underscores the complex dynamics of the conflict, with civilian protection becoming a paramount concern in the face of continued hostilities."
  }
]