[
  {
    "title": "Israeli Military Declares Yemen's Main Airport Fully Disabled After Strikes",
    "link": "https://apnews.com/article/israel-yemen-houthis-airport-23c27ae5ef0b8c9c8860dbb79abee5ad",
    "source": "Associated Press",
    "date_str": "May 06, 2025",
    "summary": "No summary available"
  },
  {
    "title": "Ukraine Declares Russian Ceasefire a Sham Amid Hundreds of Violations",
    "link": "https://www.bbc.com/news/articles/cn8zlyynjv4o",
    "source": "BBC",
    "pub_date": "Thu, 08 May 2025 11:28:58 GMT",
    "summary": "In advance of Russia's World War Two Victory Day celebrations, Russian President Vladimir Putin called for a three-day ceasefire in Ukraine, which Kyiv has since labeled a \"farce.\"  Ukraine's government reported hundreds of ceasefire violations, indicating Russia's failure to uphold the truce.  This development signifies the ongoing challenges of achieving a lasting ceasefire and the deep distrust between the key players, with Russia and Ukraine at odds. This follows the pattern of continuous fighting in the war, raising questions about the sincerity of Russia's diplomatic overtures.",
    "date_str": "May 08, 2025"
  },
  {
    "title": "Israeli Strikes in Gaza Kill 33, According to Health Ministry Reports",
    "link": "https://www.bbc.com/news/articles/c3676r17gg4o",
    "source": "BBC",
    "pub_date": "Wed, 07 May 2025 18:03:50 GMT",
    "summary": "On May 7, 2025, Israeli strikes on a restaurant and market in Gaza City resulted in the deaths of 33 people, according to the health ministry. These strikes, targeting a community kitchen in the Rimal neighborhood, occurred amidst the ongoing conflict between Israel and Hamas. The Israeli government is the primary actor responsible for the strikes. This incident highlights the continuing violence within the Israeli-Palestinian conflict, where civilian casualties are a recurring concern.",
    "date_str": "May 08, 2025"
  },
  {
    "title": "Russia's Military Displays Hide Underlying Economic and Diplomatic Weaknesses",
    "text": "The annual Moscow parade marking victory over Nazi Germany is expected to be the largest in years, with world leaders in attendance, as the Kremlin tries to link that triumph to the war in Ukraine.",
    "link": "https://www.nytimes.com/2025/05/08/world/europe/russia-military-parade.html",
    "date_str": "May 08, 2025",
    "source": "NYT",
    "summary": "The Kremlin is preparing for its largest Victory Day parade in years, a significant event marking the defeat of Nazi Germany, intending to connect historical triumph with its ongoing war in Ukraine. Russian President Vladimir Putin will lead the event, likely showcasing military hardware and personnel as a demonstration of strength. The presence of world leaders at the Moscow parade suggests efforts by Russia to garner international support, or at least tacit acceptance, for its actions in Ukraine, while drawing upon historical narratives of resistance against perceived existential threats. This carefully orchestrated event occurs amidst continued Western condemnation of Russia’s aggression and ongoing military operations in Ukraine."
  }
]