[
  {
    "title": "North Korea says new hypersonic missile will 'contain' rivals",
    "date_str": "January 07, 2025",
    "summary": "North Korea claims to have successfully launched a new hypersonic missile, asserting that its development will strengthen its defense capabilities in the Pacific region. This launch marks Pyongyang's first missile test in two months and was conducted while US Secretary of State Antony Blinken visited Seoul. North Korea insists that the missile's purpose is to \"contain\" its rivals, emphasizing its ability to deter external threats and ensure the security of the nation.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/crrwyv75g5xo",
    "url": ""
  },
  {
    "title": "Michael J. Fox, Bono, and Anna Wintour Receive Prestigious Medal of Freedom",
    "date_str": "January 07, 2025",
    "summary": "President Joe Biden awarded the Presidential Medal of Freedom, the nation's highest civilian honor, to 19 distinguished individuals including actors Michael J. Fox and Denzel Washington, singer Bono, fashion icon Anna Wintour, and former Secretary of State Hillary Clinton. The President praised the recipients for their extraordinary contributions to American society, highlighting their work in fields ranging from music and film to diplomacy and activism.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c2dx6gd0k66o",
    "url": ""
  },
  {
    "title": "Austria Faces Potential Far-Right Chancellorship for First Time Since World War II",
    "date_str": "January 06, 2025",
    "summary": "Following the failure of coalition talks among mainstream Austrian parties, Heinz-Christian Strache, leader of the right-wing Freedom Party, has been tasked with forming a government. The Freedom Party, known for its anti-immigration and pro-Russia stance, has been on the rise in Austria in recent years, capitalizing on public discontent with immigration and the European Union. Strache's potential appointment as Chancellor sparks concerns about the party's influence on Austrian foreign and domestic policy, particularly its ties to Russia and its opposition to EU integration.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/06/world/europe/austria-coalition-far-right-chancellor.html",
    "url": ""
  }
]