[
  {
    "title": "Ukrainian Ministers Resign Amidst Corruption Scandal",
    "link": "https://apnews.com/article/russia-ukraine-war-corruption-scandal-6e33b63b8071f46140956d4d23ab00de",
    "source": "Associated Press",
    "date_str": "November 12, 2025",
    "summary": "Ukraine's justice and energy ministers resigned amidst a significant corruption scandal involving the state nuclear power company, implicating high-level officials. The resignations occurred amid ongoing efforts by President Volodymyr Zelenskyy's government to combat corruption, a key requirement for further integration with European institutions and continued Western aid during the conflict with Russia. This scandal highlights the persistent challenges Ukraine faces in addressing corruption, potentially undermining international support and hindering its progress toward EU membership. The probe comes as Zelenskyy works to reassure allies that the government is tackling endemic graft."
  },
  {
    "title": "European Drone Industry Sees Opportunity Amid NATO's Counter-Threat Efforts",
    "link": "https://apnews.com/article/denmark-drones-mydefence-weibel-scientific-russia-ukraine-dfc8f1c5bf7f1592d4c1fc940e4c88ce",
    "source": "Associated Press",
    "date_str": "November 12, 2025",
    "summary": "Amidst escalating drone warfare following Russia's 2022 invasion of Ukraine and unprecedented drone intrusions into NATO airspace, companies like MyDefence and Weibel Scientific supply anti-drone technology to both Ukraine and NATO. These systems detect and counter unmanned aerial vehicles, addressing growing security concerns. The deployment of this technology highlights Europe's increased vigilance and investment in defense measures against drone threats. Dan Hermansen and Peter Røpke are figures associated with these companies."
  },
  {
    "title": "Gal Gadot Will Receive Genesis Prize for Wartime Support of Israel",
    "link": "https://apnews.com/article/gal-gadot-israel-hamas-gaza-genesis-prize-hollywood-3b674679ece9e27db14f9ebc948f5bf5",
    "source": "Associated Press",
    "date_str": "November 11, 2025",
    "summary": "Israeli actress Gal Gadot received Israel's Genesis Prize for her unwavering support of Israel amidst criticism from the entertainment industry. The Genesis Prize Foundation recognized Gadot for her advocacy during the 2024-2025 Israel-Hamas conflict. Awarding the prize highlights the ongoing divisions within the entertainment world regarding the Israeli-Palestinian conflict. Figures associated with the Genesis Prize include Michael Bloomberg, Barbra Streisand, Michael Douglas, Steven Spielberg, and Robert Kraft, who have historically supported the prize and its mission. This award occurs within the broader context of the ongoing geopolitical tensions and debates surrounding Israel's actions and international perceptions."
  },
  {
    "title": "Yemeni Houthis Signal the End of Attacks",
    "link": "https://apnews.com/article/mideast-wars-yemen-houthis-red-sea-ee7be23641e9e3fd227d2c1677e03472",
    "source": "Associated Press",
    "date_str": "November 11, 2025",
    "summary": "Amid a shaky ceasefire in the Gaza Strip, Yemen's Houthi rebels have signaled a halt to their attacks targeting Israel and commercial shipping in the Red Sea, de-escalating tensions in a vital international waterway. The Houthis, a key player in Yemen's ongoing conflict, launched these attacks in the preceding months, citing solidarity with Palestinians and seeking to pressure Israel. This cessation of hostilities comes as the international community, including actors such as the United States, grapples with the broader regional instability stemming from the conflict. While the reason for the Houthis shift remains unconfirmed, the group’s actions significantly impacted global trade routes and heightened concerns about maritime security, especially given their links to Iran."
  },
  {
    "title": "A Russian Drone Strike on Kyiv Apartments Caused Deaths in a Wave of Attacks",
    "link": "https://www.bbc.com/news/articles/cn4jn94gyllo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 14 Nov 2025 11:02:54 GMT",
    "summary": "Russian forces launched drone strikes across Kyiv, hitting six areas of the capital and a market in the south. A drone struck a block of flats, resulting in the death of four people, while attacks elsewhere killed two others. This escalation by Russia intensifies the ongoing conflict with Ukraine and increases the risk of further civilian casualties, raising concerns among international observers. Ukraine continues to seek international support to bolster its air defenses against Russian attacks. The attacks highlight the vulnerability of civilian infrastructure in urban centers amidst the broader geopolitical tensions between Russia and the West.",
    "date_str": "November 14, 2025"
  },
  {
    "title": "The United States Urges International Action to Halt Weapons Supply to Sudanese Paramilitaries",
    "link": "https://www.bbc.com/news/articles/c17p1nwy7q8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 14 Nov 2025 08:20:20 GMT",
    "summary": "Amidst ongoing conflict in Sudan, Senator Marco Rubio urges the international community to take decisive action to halt weapons supplies reaching the Rapid Support Forces (RSF). Reports indicate the RSF have been committing atrocities, including sexual violence, exacerbating the already dire humanitarian situation. The senator's call comes as the conflict between the RSF and the Sudanese army continues to destabilize the region and undermine prospects for a peaceful transition. International intervention aims to prevent further escalation of the conflict and protect civilians from further harm. Ultimately, these efforts target the supply chains that enable the RSF to perpetuate violence.",
    "date_str": "November 14, 2025"
  },
  {
    "title": "China Summoned Japan's Ambassador Amid Ongoing Taiwan Dispute",
    "link": "https://www.bbc.com/news/articles/crklvx2n7rzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 14 Nov 2025 08:39:44 GMT",
    "summary": "Tensions escalate between China and Japan as Japanese PM Sanae Takaichi suggests Tokyo might undertake military action if Beijing attacks Taiwan, prompting a sharp rebuke from China. This exchange highlights the ongoing sensitivity surrounding Taiwan's status, which China views as a breakaway province. Japan's stance underscores its strategic interest in regional stability and its alliance with the United States, both of which influence its approach to the Taiwan issue. The diplomatic spat occurs against a backdrop of increasing Chinese military activity near Taiwan, raising concerns about potential conflict in the region and drawing international attention to the cross-strait dynamic. Ultimately, this exchange underscores the complex interplay of historical grievances, geopolitical ambitions, and security alliances shaping East Asia's security landscape.",
    "date_str": "November 14, 2025"
  }
]