[
  {
    "title": "Who Are the Rebels in Syria?",
    "date": "2024-12-08T07:40:24+00:00",
    "date_str": "December 08, 2024",
    "summary": "Rebel forces have entered the Syrian capital Damascus with reports that President Bashar al-Assad has fled the country by plane to an unknown location. The initial attack was led by the Islamist militant group Hayat Tahrir al-Sham ( HTS ) - which has a long and involved history in the Syrian conflict. HTS is designated as a terrorist organisation by the UN, US, Turkey and other countries. It appears to have brought down the end of the regime in less than two weeks.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/ce313jn453zo",
    "region": "Middle East"
  },
  {
    "title": "A $6.2m Banana, a Crypto Empire and Trump's Potential Conflicts",
    "date": "2024-12-08T01:54:44+00:00",
    "date_str": "December 08, 2024",
    "summary": "Chinese crypto entrepreneur Justin Sun invested $ 30m in World Liberty Financial. Trump and his family are now in the position to collect roughly $ 20m - and potentially far more. Mr Sun is currently fighting fraud charges in the US related to his own crypto business. Trump has faced questions about conflicts of interest before.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c4gzz5wdg41o",
    "region": "Global"
  },
  {
    "title": "Prince William and Trump Meet After Notre-dame Reopening",
    "date": "2024-12-07T23:19:30+00:00",
    "date_str": "December 07, 2024",
    "summary": "Prince of Wales met US President-elect Donald Trump while visiting France. The pair met at the ceremonial reopening of Notre-Dame cathedral in Paris. The medieval cathedral has been closed since a major fire tore through it in 2019. William had also been due to meet Trump and Dr Biden earlier in the day but was delayed by weather.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c05ppeym6jro",
    "region": "Asia"
  },
  {
    "title": "Where Is Bashar? Rumours Swirl in Syria Despite Official Denials",
    "date": "2024-12-07T21:20:55+00:00",
    "date_str": "December 07, 2024",
    "summary": "Mood in Damascus appears to be one of confusion and fear as rebel factions approach. symbols of the power of the Assad dynasty have been torn down or toppled. Rumours are swirling over the whereabouts of President Bashar al-Assad. If he is now out of the picture, a power vacuum will re-emerge. There is no unified opposition that is in place to take over.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/czxdd2r2191o",
    "region": "Middle East"
  },
  {
    "title": "Five Dead, More Feared Missing After the Hague Flat Explosions",
    "date": "2024-12-07T21:17:05+00:00",
    "date_str": "December 07, 2024",
    "summary": "Explosions rocked a block of flats in The Hague in the Netherlands. At least five people have died and four others injured. The cause of the explosions is not yet clear. Dutch police said a car drove away at very high speed shortly after.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/clykk717n1ko",
    "region": "Middle East"
  },
  {
    "title": "Romanian Court Annuls Result of Presidential Election First Round",
    "date": "2024-12-06T20:59:13+00:00",
    "date_str": "December 06, 2024",
    "summary": "Romania 's constitutional court has annulled the result of the first round of voting in the presidential election. It means the process will be restarted from scratch, with the government due to decide a date for a new vote. The first round was won by Calin Georgescu, an almost unknown far-right Nato-sceptic who has previously praised Vladimir Putin.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cn4x2epppego",
    "region": "Africa"
  },
  {
    "title": "Iran's Uranium Enrichment 'worrisome' - Nuclear Watchdog",
    "date": "2024-12-06T19:39:02+00:00",
    "date_str": "December 06, 2024",
    "summary": "Rafael Grossi is director general of the International Atomic Energy Agency. He said Iran was increasing its stockpile of uranium enriched to 60 %. This is just below the level of purity needed for a nuclear weapon. Mr Grossi warned Israel against attacking Iranian nuclear facilities.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c20ee6qylwgo",
    "region": "Middle East"
  },
  {
    "title": "Putin's Western Adversaries Are in Disarray",
    "date": "2024-12-08T08:06:42+00:00",
    "date_str": "December 08, 2024",
    "summary": "Vladimir Putin might be able to capitalize on the adage of never to waste a good crisis. France, Germany, Romania and South Korea have been vocal opponents of his full-scale invasion of Ukraine. Western-led sanctions could lead to political ructions of their own.",
    "source": "Reuters",
    "link": "https://biztoc.com/x/92c9b470e92be053?ref=ff",
    "region": "Europe"
  },
  {
    "title": "Syrians in Homs Topple Regime Statue As Rebels Claim Victory | Wsj News",
    "date": "2024-12-08T07:38:05+00:00",
    "date_str": "December 08, 2024",
    "summary": "Crowds in Homs celebrated the arrival of opposition fighters and toppled a statue of President Assad 's father. Hafez al-Assad was President Assad's father and the father of Syria's current president, Bashar Assad. The statue of Hafez was toppled by opposition fighters.",
    "source": "Reuters",
    "link": "https://biztoc.com/x/fa0dcf7550ca67e5?ref=ff",
    "region": "Middle East"
  },
  {
    "title": "Russia's Shadow War in Europe",
    "date": "2024-12-08T07:33:37+00:00",
    "date_str": "December 08, 2024",
    "summary": "Russia is slowly ratcheting up the pressure on Nato rivals to see what it can get away with. Steering clear of open conflict, Moscow is slowly increasing the pressure. Moscow is gradually ratchets up the Pressure on Nato Rivals to seeWhat it canget away with.",
    "source": "Reuters",
    "link": "https://biztoc.com/x/d6abd32986eed0a3?ref=ff",
    "region": "Europe"
  }
]