[
  {
    "title": "Determining African Representation at the Grammy Awards",
    "date_str": "February 02, 2025",
    "summary": "The controversy surrounding the Grammy Award for African music intensified with the nomination of Chris Brown, an American artist. The award, intended to recognize African musicians, sparked debates about eligibility criteria and cultural identity. Prominent figures in the music industry, including Nigerian singer Burna Boy, criticized the inclusion of non-Africans, arguing that it undermined the integrity of the category. Academy officials defended their decision, stating that Brown's inclusion was based on the global reach and influence of his music. Despite the controversy, the award ceremony proceeded, celebrating both African and non-African artists in the category.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c4gxe7xxjd0o",
    "url": ""
  },
  {
    "title": "Rare Metal in Your Phone Fuels War in Democratic Republic of Congo",
    "date_str": "February 02, 2025",
    "summary": "In the Democratic Republic of Congo, smartphones and other electronic devices often contain coltan, a rare metal found in abundance in the country. The mining of coltan has played a significant role in the ongoing conflict, with rebels controlling mines and using the profits to fund their activities. This has resulted in human rights violations, environmental degradation, and the displacement of local communities. The situation remains complex and requires comprehensive solutions to address the underlying causes of the conflict and promote sustainable resource management.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cn01k8948v1o",
    "url": ""
  },
  {
    "title": "FAA's Primary Air Traffic Alerting System Malfunctions",
    "date_str": "February 02, 2025",
    "summary": "The Federal Aviation Administration (FAA) has deployed a backup system due to a technical issue. Transportation Secretary Sean Duffy announced this measure as the FAA addresses the problem. This disruption stems from an underlying issue that has yet to be resolved. The situation highlights the importance of reliable aviation infrastructure and the FAA's ongoing efforts to ensure the safety and efficiency of air travel.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/02/us/notam-outage-faa-alerts.html",
    "url": ""
  }
]