[
  {
    "title": "Hamas lists 34 hostages it may free under ceasefire",
    "date_str": "January 06, 2025",
    "summary": "Amidst continued Israeli airstrikes in Gaza, Hamas has released a list of 34 hostages they may release as part of a ceasefire agreement. The list comes as new Israeli airstrikes over the weekend killed dozens in Gaza. Key players involved in the situation include Hamas and Israeli authorities. The conflict stems from ongoing tensions and violence between Israel and Palestinian militants in Gaza, highlighting the ongoing instability and humanitarian crisis in the region.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c0kv0y1vd6mo",
    "url": ""
  },
  {
    "title": "N Korea fires first ballistic missile in two months - Seoul",
    "date_str": "January 06, 2025",
    "summary": "North Korea has launched its first ballistic missile in two months, a significant move that comes amid a visit to South Korea by US Secretary of State Antony Blinken. According to officials in Seoul, the missile was fired eastward from an area near Pyongyang. The launch has sparked concern in the region and is seen as a clear signal of North Korea's ongoing missile development program. Blinken is currently in the region to meet with key leaders and discuss the ongoing nuclear and missile threat posed by North Korea.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/crrwyv75g5xo",
    "url": ""
  },
  {
    "title": "President Biden Honors Michael J. Fox, Bono, and Anna Wintour with the Presidential Medal of Freedom",
    "date_str": "January 06, 2025",
    "summary": "President Joe Biden bestowed the Presidential Medal of Freedom, the United States' highest civilian honor, upon actor Michael J. Fox, musician Bono, and fashion icon Anna Wintour, recognizing their contributions to society. The ceremony occurred during a White House event attended by award recipients including Denzel Washington and Hillary Clinton and underscored the significance of their work in the fields of entertainment, advocacy, and culture.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c2dx6gd0k66o",
    "url": ""
  },
  {
    "title": "Christianity Gains Momentum in Predominantly Muslim Region",
    "date_str": "January 04, 2025",
    "summary": "Christian converts in Muslim-majority Kosovo seek to reclaim their pre-Islamic heritage, which they believe aligns with their aspirations for European integration. Led by Father Anton Lushaj, these converts aim to revitalize ancient Christian traditions and establish a connection with their presumed spiritual roots. The effort has the support of the Catholic Church and some political figures seeking to strengthen Kosovo's ties to the West. Amidst the historical complexities of the region, the Christian revival reflects the ongoing struggle between religious and ethnic identities in shaping national narratives.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/04/world/europe/kosovo-albanians-christianity-islam.html",
    "url": ""
  },
  {
    "title": "Treasury Department Imposes Sanctions on Chinese Tech Company Following Data Breach",
    "date_str": "January 03, 2025",
    "summary": "The Financial Crimes Enforcement Network (FinCEN) has sanctioned a company for facilitating support to the Chinese hacking group Flax Typhoon, which infiltrated global networks from 2022 to 2023. The penalties aim to disrupt malicious cyber activity and hold accountable those involved in supporting cyber threats. The sanctions were imposed in collaboration with the FBI and U.S. Treasury Department.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/03/us/politics/treasury-chinese-sanctions.html",
    "url": ""
  },
  {
    "title": "Countries Warns on Alcohol's Potential Cancer Risk",
    "date_str": "January 03, 2025",
    "summary": "South Korea has implemented a unique health risk label on alcohol packaging, becoming the first nation globally to explicitly warn of liver cancer. This groundbreaking measure underscores the rising awareness of alcohol's health hazards, particularly in South Korea, where liver disease is a significant public health concern. The move follows the global trend towards alcohol health risk labeling, with approximately a quarter of countries now implementing such warnings.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/03/world/alcohol-cancer-warnings-countries.html",
    "url": ""
  }
]