[
  {
    "title": "Ukraine Drone Attack Causes Fire at Sochi Oil Depot, Russian Authorities Report",
    "link": "https://www.bbc.com/news/articles/ckglyv396ppo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 03 Aug 2025 07:21:03 GMT",
    "summary": "Amidst the ongoing conflict, Ukraine reportedly launched a drone attack that ignited a fire at an oil depot in Sochi, Russia, according to Russian authorities. Simultaneously, Ukraine reported that Russian missiles struck Mykolaiv, resulting in injuries to at least seven people. These events highlight the continued escalation and geographic expansion of the conflict between Ukraine, led by Volodymyr Zelensky, and Russia, led by Vladimir Putin. This exchange of attacks underscores the vulnerability of both nations' infrastructure and the human cost of the war, further complicating diplomatic efforts to de-escalate the crisis. The attacks also emphasize the evolving nature of warfare with the increased use of drone technology.",
    "date_str": "August 03, 2025"
  },
  {
    "title": "Ukrainian Officials Are Detained in Military Drone Corruption Investigation",
    "link": "https://www.bbc.com/news/articles/c4gq3xwr357o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 03 Aug 2025 00:35:01 GMT",
    "summary": "Ukrainian authorities detained officials amidst a military drone corruption probe, signaling an effort to combat graft within the defense sector. The arrests occurred just two days after Ukraine restored the independence of its anti-corruption agencies, highlighting the government's renewed commitment to transparency. These actions demonstrate Kyiv's resolve to address corruption concerns as it continues to rely on international aid and military assistance in its conflict. While the article does not name specific individuals, the move likely involves figures within the defense ministry or procurement agencies responsible for acquiring drone technology. This probe underscores the importance of accountability and effective resource management in Ukraine's ongoing war effort.",
    "date_str": "August 03, 2025"
  },
  {
    "title": "Aid Group Confirms Worker Death in Gaza HQ Attack by Israeli Military",
    "link": "https://www.bbc.com/news/articles/cx2x5eyl676o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 03 Aug 2025 10:32:45 GMT",
    "summary": "Amidst the ongoing Israel-Gaza conflict, the Palestine Red Crescent accuses the Israeli military of deliberately striking its Gaza headquarters, resulting in the death of one aid worker. Israel claims they possess no information regarding the incident. The event raises concerns about the protection of humanitarian personnel and infrastructure in conflict zones, adding to the complexities of the Israeli-Palestinian conflict. This comes as international organizations continue to call for de-escalation and adherence to international humanitarian law. The lack of clarity surrounding the attack underscores the need for independent investigations to determine the facts and ensure accountability.",
    "date_str": "August 03, 2025"
  }
]