[
  {
    "title": "Myanmar Military Shuts Down Cybercrime Center, Detaining Over 2,000",
    "link": "https://apnews.com/article/scam-centers-cybercrime-myanmar-a2c9fda85187121e51bd0efdf29c81da",
    "source": "Associated Press",
    "date_str": "October 26, 2025",
    "summary": "Myanmar's military junta dismantled a large-scale cybercrime operation located near the Thailand border, arresting over 2,000 individuals. The raid on the \"KK Park\" scam center in Myawaddy township also resulted in the seizure of dozens of Starlink satellite internet terminals. This action highlights the ongoing struggle against cybercrime in Southeast Asia and the military's efforts to assert control, particularly in border regions where such illicit activities often flourish, amid the broader context of political instability following the 2021 coup. The use of Starlink raises questions about the proliferation of technologies enabling illegal operations in conflict zones."
  },
  {
    "title": "Zelensky Appeals for Air Defense Assistance After Russian Attacks Kill Ukrainians",
    "link": "https://apnews.com/article/russia-ukraine-zelenskyy-missile-ballistic-kyiv-4381b48b931d7ed32e44a6d671b97dd5",
    "source": "Associated Press",
    "date_str": "October 25, 2025",
    "summary": "Russian forces launched missile and drone attacks on Ukraine, resulting in at least four fatalities and twenty injuries. Ukraine's President Zelenskyy responded by urgently appealing to international partners for enhanced air defense systems. The attacks represent a continued escalation of the conflict that began in 2022, highlighting the vulnerability of Ukrainian civilians and infrastructure to Russian aerial assaults. This incident underscores the ongoing need for advanced military aid to bolster Ukraine's defense capabilities amid the protracted war."
  },
  {
    "title": "Sudanese Army Surrenders El-Fasher to RSF Paramilitary Forces After Intense Siege",
    "link": "https://www.bbc.com/news/articles/clyld9w0283o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Tue, 28 Oct 2025 11:32:34 GMT",
    "summary": "Amidst ongoing conflict in Sudan, the Rapid Support Forces (RSF) gained control of the strategically significant city of El-Fasher after an 18-month siege, marking a setback for the Sudanese army, led by Abdel Fattah al-Burhan. This takeover raises concerns, as the UN reports the RSF committed atrocities, highlighting the deteriorating humanitarian situation. El-Fasher's fall could further destabilize the Darfur region and exacerbate the existing power struggle between the army and the RSF, who have been vying for control since clashes erupted in April 2023. The conflict stems from a power struggle between al-Burhan and RSF leader Mohamed Hamdan Dagalo, derailing Sudan's transition to civilian rule following the ouster of Omar al-Bashir in 2019.",
    "date_str": "October 28, 2025"
  },
  {
    "title": "King of Jordan States International Troops Won't Enforce Gaza Peace",
    "link": "https://www.bbc.com/news/articles/cge5ngz11xpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Mon, 27 Oct 2025 06:01:02 GMT",
    "summary": "King Abdullah of Jordan stated to the BBC that international troops would likely hesitate to enforce peace in Gaza without an existing ceasefire. His statement underscores the complexities of deploying international forces into active conflict zones and highlights the prerequisite of establishing peace before any such deployment. This perspective from a key regional player like Jordan is crucial given ongoing discussions surrounding potential international involvement in Gaza following recent escalations between Israel and Hamas. Abdullah's remarks serve as a cautionary note amid debates on the future security architecture of the region.",
    "date_str": "October 28, 2025"
  },
  {
    "title": "Sudan's Military Has Withdrawn From a Key Darfur City After Months of Fighting",
    "text": "Gen. Abdel Fattah al-Burhan confirmed that Sudan’s military had retreated from El Fasher, a decisive shift in control of the country’s sprawling Darfur region.",
    "link": "https://www.nytimes.com/2025/10/28/world/africa/sudan-el-fasher-burhan-rsf.html",
    "date_str": "October 28, 2025",
    "source": "NYT",
    "summary": "General Abdel Fattah al-Burhan announced the Sudanese military's withdrawal from El Fasher, signaling a significant power shift in Darfur. This retreat hands greater control of the strategic region to rival factions amidst the ongoing conflict. The Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) battle for national dominance, making the fight for El Fasher crucial due to its location and resources. The withdrawal impacts the broader struggle for control within Sudan, potentially reshaping regional power dynamics and further destabilizing the country."
  },
  {
    "title": "U.N. Inquiry: Russia's Drone Attacks on Civilians Constitute a War Crime",
    "text": "In the city of Kherson, in southern Ukraine, small drones routinely target ordinary people by dropping hand grenades, and record video documenting their attacks, a U.N. commission reported.",
    "link": "https://www.nytimes.com/2025/10/27/world/europe/russia-drones-target-civilians.html",
    "date_str": "October 27, 2025",
    "source": "NYT",
    "summary": "A U.N. commission finds that actors routinely deploy small drones armed with hand grenades against civilians in Kherson, Ukraine, raising concerns about targeted attacks. These attacks, documented by video recordings made by the drones themselves, expose the vulnerability of ordinary people in the conflict zone and demonstrate a novel tactic. This report underscores the increasing use of readily available technology in modern warfare to inflict harm upon non-combatants. The incident also highlights the difficulty of attributing responsibility for the attacks."
  }
]