[
  {
    "title": "'no-one Slept in Syria Last Night' - How News of Assad's Toppling Spread",
    "date": "2024-12-08T11:16:34+00:00",
    "date_str": "December 08, 2024",
    "summary": "Residents in Damascus have told of an anxious wait for news on what was happening in Syria 's capital city overnight. After several hours of reports of rebels getting closer and closer, the forces declared Damascus free of long-time ruler Bashar al-Assad in the early hours of Sunday. Unverified videos circulating on social media show people cheering in the streets and welcoming the rebel fighters, as well as inmates being freed from the notorious Saydnaya prison.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2772e082do",
    "region": "Middle East"
  },
  {
    "title": "Watch: Bbc Reports from Inside Damascus",
    "date": "2024-12-08T10:08:25+00:00",
    "date_str": "December 08, 2024",
    "summary": "The BBC 's Barbara Plett-Usher says it is relatively calm in Damascus after rebels took control of the Syrian capital. People in Tel Aviv and Beirut shared feelings of relief and doubt as they reacted to the news. Israel launches extensive air strikes on Beirut 's southern suburbs after its military issued evacuation orders in the area. Drone footage released by the Israeli military on Thursday is said to show Yahya Sinwar in the moments before he was killed.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/ce8xy02n4mjo",
    "region": "Middle East"
  },
  {
    "title": "End of Assad Rule Will Reshape Region's Balance of Power",
    "date": "2024-12-08T07:32:16+00:00",
    "date_str": "December 08, 2024",
    "summary": "The fall of Bashar al-Assad was almost unthinkable just a week ago. With the help of Russia and Iran, he crushed the rebels, and survived. The end of the Assad family 's five-decade rule will reshape the balance of power in the region. Iran, again, is seeing its influence suffer a significant blow. A lot of people are happy to see Assad go. But what happens next?",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8j99447gj1o",
    "region": "Middle East"
  },
  {
    "title": "What Just Happened in Syria?",
    "date": "2024-12-08T07:28:59+00:00",
    "date_str": "December 08, 2024",
    "summary": "President Bashar al-Assad took power in 2000 after his father had ruled for almost three decades. Thirteen years ago, he brutally crushed a peaceful pro-democracy uprising - which turned into a devastating civil war. More than half a million people were killed and 12 million were forced to flee their homes. But last Wednesday, an Islamist anti-government group called Hayat Tahrir al-Sham ( HTS) successfully led a major offensive in the north-west.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c99x0l1d432o",
    "region": "Middle East"
  },
  {
    "title": "Crowds Gather in Damascus After Rebels Declare City 'free'",
    "date": "2024-12-08T05:39:16+00:00",
    "date_str": "December 08, 2024",
    "summary": "Rebel forces in Damascus have declared the capital city free of long-time ruler Bashar al-Assad in the early hours of Sunday. Lebanon 's health ministry says 22 people have died and more than 117 were left wounded after air strikes in central Beirut. Drone footage released by the Israeli military on Thursday is said to show Sinwar in the moments before he was killed. On the one-year anniversary of the 7 October Hamas attacks in Israel, survivor Hadas Kalderon speaks to the BBC.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c75wwppvkp3o",
    "region": "Middle East"
  }
]