[
  {
    "title": "Satellite Photos Suggest Iran Conducted an Undeclared Missile Test",
    "link": "https://apnews.com/article/iran-missile-test-israel-nuclear-20e455ff76632d7b67fe2633cf19e37b",
    "source": "Associated Press",
    "date_str": "September 25, 2025",
    "summary": "Satellite imagery analyzed by the Associated Press indicates that Iran likely conducted an undeclared missile test at its Imam Khomeini Spaceport. This action, carried out by the Iranian government, raises concerns given the ongoing tensions in the region and Iran's nuclear ambitions. The launch site's scorched launchpad suggests a recent test, adding to scrutiny from international actors, particularly Israel. Such tests occur within the context of ongoing discussions surrounding Iran's missile program and its compliance with international agreements, further escalating regional instability."
  },
  {
    "title": "AP and Reuters Seek Answers From Israel Regarding Journalist Deaths in Airstrike",
    "link": "https://apnews.com/article/media-israel-gaza-press-deaths-9480fbada27a4ad15f4cde5b5cec7cb1",
    "source": "Associated Press",
    "date_str": "September 25, 2025",
    "summary": "Amidst the ongoing Israel-Hamas war, the Associated Press and Reuters are pressing the Israeli government for explanations regarding an airstrike that occurred last month in Gaza, which resulted in the deaths of five journalists. These news agencies demand transparency and accountability from Israel concerning the circumstances surrounding the strike. The incident raises concerns about the protection of journalists in conflict zones and the potential targeting of media personnel during military operations. The Israeli government, led by Benjamin Netanyahu, has yet to provide a comprehensive response."
  },
  {
    "title": "Netanyahu Criticized Palestinian Recognition As Dozens Walked Out of His UN Speech",
    "link": "https://www.bbc.com/news/articles/cderxxylpzdo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 26 Sep 2025 16:41:44 GMT",
    "summary": "At the United Nations, Israeli Prime Minister Benjamin Netanyahu rebuked growing international recognition of Palestine, prompting dozens of officials and diplomats to walk out in protest as he began to speak. This display underscores the deep divisions persisting over the Israeli-Palestinian conflict, particularly regarding Palestinian statehood, despite ongoing international efforts toward a two-state solution. The walkout signifies strong opposition to Netanyahu's stance and highlights the continued sensitivity surrounding the issue within the international community. The event took place amidst long-standing tensions and stalled peace negotiations between Israel and the Palestinians.",
    "date_str": "September 27, 2025"
  }
]