[
  {
    "title": "Indian Pharmaceutical Firm Uncovered as Keystone of West African Opioid Crisis",
    "date_str": "February 21, 2025",
    "summary": "An Indian pharmaceutical company was exposed by a BBC undercover investigation for providing West Africa with an addictive cocktail drug, which executives admitted to being \"very harmful.\" The drug maker, based in Hyderabad, has allegedly been supplying the region with the drug, which contains codeine, for several years. The BBC team also discovered that the drug is being illegally diverted to other countries, including Nigeria and Ghana, where it is fueling an opioid crisis. The investigation has sparked outrage and calls for action from authorities and health organizations.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cwyew21yyjzo",
    "url": ""
  },
  {
    "title": "Tourists Urged to Steer Clear of Mount Etna's Lava Flow",
    "date_str": "February 21, 2025",
    "summary": "After an eruption of Mount Etna, Italian authorities have warned tourists to avoid the hot lava. Several individuals have been reported injured due to venturing too close to the hazardous volcanic material. The incident underscores the importance of respecting established boundaries and adhering to safety guidelines in areas known for geological activity.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c0eg1qzl30go",
    "url": ""
  },
  {
    "title": "Chinese Warships to Conduct Live Fire Drills, Raising Concerns in Australia and New Zealand",
    "date_str": "February 21, 2025",
    "summary": "In response to a pre-announced exercise in the Tasman Sea, commercial flights were diverted out of precaution. Key players involved included the vessels engaged in the exercise and relevant aviation authorities. The decision aimed to maintain safety and minimize potential risks in the designated airspace during the exercise, which prompted the precautionary rerouting of commercial flights.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/21/world/australia/chinese-warships-drills-new-zealand.html",
    "url": ""
  },
  {
    "title": "Israel Raises Terrorism Alert After Multiple Bus Explosions",
    "date_str": "February 20, 2025",
    "summary": "Israel's ongoing raids in the West Bank and the imminent expiration of its cease-fire with Hamas in Gaza have heightened tensions, leading to attempted attacks on Thursday that disrupted public transportation but caused no injuries. The Israeli government implemented security measures to address the situation, while the Palestinian Authority condemned the attacks and called for an end to the violence.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/20/world/middleeast/bus-explosions-israel-tel-aviv.html",
    "url": ""
  },
  {
    "title": "United States Objects to Labeling Russia as Aggressor in G7 Invasion Statement",
    "date_str": "February 20, 2025",
    "summary": "The United States has objected to a G7 statement commemorating the anniversary of Russia's invasion of Ukraine, following President Trump's assertion that Ukraine initiated the conflict. The statement, drafted by the group's members, aims to reaffirm support for Ukraine and condemn Russia's aggression. The US's opposition to the text underscores ongoing tensions within the G7 and deepens the divide with its allies on the matter.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/20/world/europe/us-g7-russia-ukraine-war.html",
    "url": ""
  },
  {
    "title": "Chinese Warships in Proximity to Sydney Alarm Australia and New Zealand",
    "date_str": "February 20, 2025",
    "summary": "Three Chinese vessels sailed unusually far south in Australia's exclusive economic zone, prompting curiosity despite not violating international law. The vessels' undeclared mission has raised concerns, particularly given the strained diplomatic relations between China and Australia. The incident highlights potential tensions in the region and the importance of maintaining open lines of communication between the involved parties.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/20/world/australia/chinese-ships-tasman-nz.html",
    "url": ""
  }
]