[
  {
    "title": "43,000 troops killed in war with Russia, Zelensky says",
    "date_str": "December 09, 2024",
    "summary": "Amidst the ongoing conflict, Ukrainian President Zelensky acknowledges significant casualties with an estimated 43,000 Ukrainian soldiers killed and 370,000 injured, while claiming heavy Russian losses. Despite lacking independent verification, Zelensky's admission signals a willingness to provide transparency, prompted by U.S. President-elect Trump's inaccurate figures, while highlighting the global consensus that Russia's tactics result in a disproportionately high number of casualties.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c5yv75nydy3o"
  },
  {
    "title": "A $6.2m banana, a crypto empire and Trump's potential conflicts",
    "date_str": "December 09, 2024",
    "summary": "Chinese crypto entrepreneur Justin Sun's $23.5 million investment in World Liberty Financial, a cryptocurrency firm partnered with former President Donald Trump, has raised concerns about potential influence-peddling and conflicts of interest. Despite government ethics experts highlighting the heightened risk of corruption or its perception, Trump's team maintains that he severed ties with his business empire before entering office and is solely motivated by patriotism.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c4gzz5wdg41o"
  },
  {
    "title": "South Korea's emotional protesters watch impeachment hopes fade",
    "date_str": "December 09, 2024",
    "summary": "On Saturday, South Korean President Yoon Suk Yeol's impeachment vote was narrowly averted after an apology and opposition boycott, despite large-scale protests demanding his removal for an attempted martial law declaration. The demonstrations, which drew an estimated 100,000 people, echoed global concerns about democratic backsliding and regime legitimacy, with protest chants invoking themes of resistance and accountability.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cj0rrn7e1qgo"
  },
  {
    "title": "Moment Georgian press attacked by masked men",
    "date_str": "December 09, 2024",
    "summary": "In Georgia, escalating pro-EU protests sparked by governmental authoritarianism have led to an assault on journalists covering the demonstrations, highlighting Tbilisi's deteriorating media freedom and political tensions. The incident adds to the global concerns over press suppression and democratic backsliding, particularly in countries aspiring to integrate with Europe.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/c07ggrnxx45o"
  },
  {
    "title": "On secret military island, a mother strives to raise her children normally",
    "date_str": "December 09, 2024",
    "summary": "The prolonged confinement of Sri Lankan Tamil asylum seekers in a remote Diego Garcia migrant camp has raised concerns about their well-being and education. Despite fleeing persecution, the families have been stranded in a \"cage-like\" environment, highlighting the complexities of global migration and the challenges faced by those seeking refuge. The camp's limited resources and lack of formal education have prompted the asylum seekers, including trained educators, to create their own means of entertainment and learning.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp9nnr4gel2o"
  }
]