[
  {
    "title": "Sudanese Army Advances Significantly in Bid to Recapture War-Torn Capital",
    "date_str": "February 08, 2025",
    "summary": "The Sudanese army has made significant advancements in its efforts to recapture the war-torn capital, Khartoum. The army's actions follow the outbreak of a civil war in the country. Witnesses have reported the presence of shrapnel and stray ammunition falling in residential neighborhoods. The army's gains have been facilitated by its superior military capabilities.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cq5gp74nqn6o",
    "url": ""
  },
  {
    "title": "Nations Stand United in Support of International Criminal Court Amid US Sanctions",
    "date_str": "February 08, 2025",
    "summary": "In support of the International Criminal Court (ICC), over two dozen countries, including the United Kingdom, France, and Germany, reaffirmed its importance to international justice. The move came after the Trump administration imposed sanctions on the court's top officials, prompting concerns over the integrity of the ICC's work investigating alleged war crimes committed by American personnel in Afghanistan. The ICC plays a vital role in prosecuting individuals responsible for serious crimes when national courts are unable or unwilling to do so.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2p19l24g2o",
    "url": ""
  },
  {
    "title": "Who Controls the Conflict in the Democratic Republic of Congo?",
    "date_str": "February 08, 2025",
    "summary": "As the M23 rebels make gains in the Democratic Republic of Congo (DR Congo), regional actors have met to address the escalating crisis. Rwanda and Burundi have been accused of supporting the rebels, while Uganda has denied these allegations. The UN has called for an end to all external interference in the conflict, which has displaced thousands of civilians and raised concerns about regional stability.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp8qp6p39e9o",
    "url": ""
  },
  {
    "title": "Scientists Estimate Duration of Santorini's Ongoing Seismic Activity",
    "date_str": "February 08, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp8qpn2p795o",
    "url": ""
  },
  {
    "title": "Trump Intensifies Military Action in Somalia",
    "date_str": "February 08, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cyv4270gljpo",
    "url": ""
  },
  {
    "title": "War's Devastating Impact on Ukraine's Educational System",
    "date_str": "February 08, 2025",
    "summary": "The ongoing conflict in Ukraine has severely disrupted education, with students in frontline regions被迫 attending classes underground or virtually. As a result, Ukrainian children are facing academic and social setbacks. This disruption is a consequence of the ongoing conflict and has been highlighted by experts as a major challenge for the country's future.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/europe/ukraine-russia-war-education.html",
    "url": ""
  },
  {
    "title": "Sudan Witnesses Escalating Conflict Resulting in Significant Loss of Life",
    "date_str": "February 07, 2025",
    "summary": "In northeastern Africa, the military engages in an escalating conflict with paramilitary forces over territorial control. This battle, fueled by long-standing tensions, threatens regional stability and further destabilization of the region. Key players include the national army and the paramilitary groups, which are aligned with different political factions and local actors. The conflict has already displaced thousands and intensified humanitarian suffering in an area already facing widespread poverty and insecurity.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/07/world/africa/sudan-clashes.html",
    "url": ""
  },
  {
    "title": "Trump's Trade War Paused, but Objectives and Resolution Remain Elusive",
    "date_str": "February 08, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/canada/a-trade-war-is-on-hold-but-trumps-motives-and-a-fix-remain-uncertain.html",
    "url": ""
  },
  {
    "title": "Grenfell Tower: A Reminder of Tragic Loss and Calls for Architectural Reforms",
    "date_str": "February 07, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/07/world/europe/grenfell-tower-demolition-memorial-debate.html",
    "url": ""
  },
  {
    "title": "Pakistan to Force Tens of Thousands of Afghan Refugees Out of the Capital",
    "date_str": "February 07, 2025",
    "summary": "Pakistan has ordered the deportation of 1.4 million registered Afghan refugees by March 31, aligning with President Trump's suspension of refugee admissions to the United States. This directive intensifies the pressure on the already vulnerable Afghan refugee population, leaving them with the daunting task of seeking refuge in other countries or facing deportation. The key players involved are the Pakistani government and Afghan refugees, while the broader context highlights the complex geopolitical situation in the region and the challenges faced by refugees in seeking asylum.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/07/world/asia/pakistan-afghanistan-refugees.html",
    "url": ""
  }
]