[
  {
    "title": "David Lammy Expresses Horror After Encountering Sudanese War Victims",
    "date_str": "January 26, 2025",
    "summary": "After visiting Sudanese refugees in Chad, UK Foreign Secretary David Lammy expressed shock at the evidence of war crimes committed in Sudan. Witnesses shared accounts of atrocities, including extrajudicial killings, sexual violence, and the use of chemical weapons. Lammy condemned the ongoing violence and urged the international community to intervene, emphasizing the need to prevent further suffering and hold perpetrators accountable.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/czxkw60q3p1o",
    "url": ""
  },
  {
    "title": "Thai Couples Celebrate Same-Sex Marriage as Country Legalizes Unions",
    "date_str": "January 26, 2025",
    "summary": "On January 23, 2025, Thailand became the first country in Southeast Asia to legalize same-sex marriage. Couples were seen marrying at a Bangkok mall, expressing their joy and the significance of the legal change. The move is a major step forward for LGBT rights in the region and was celebrated by advocacy groups and individuals alike.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/videos/cwypjle469zo",
    "url": ""
  },
  {
    "title": "Israel's Welcome for Women Alerting Troops of Gaza Raid",
    "date_str": "January 25, 2025",
    "summary": "Following suspicious activity reports from young female spotters, Hamas launched an attack, resulting in the deaths of 15 spotters and the abduction of seven. Israel negotiated the release of four spotters on Saturday. The incident highlights the critical role of young women in providing information to the Israeli army and the ongoing tensions between Israel and Hamas.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/25/world/middleeast/israel-spotters-hostages.html",
    "url": ""
  },
  {
    "title": "Hostage Dispute Between Israel and Hamas Leaves Palestinian Families in Limbo",
    "date_str": "January 25, 2025",
    "summary": "Israel has suspended movement to northern Gaza until plans are established for the release of Arbel Yehud, an Israeli civilian woman detained in the territory. The Israeli government's decision stems from concerns about the well-being and repatriation of Yehud, highlighting the ongoing tensions between Israel and Gaza. Key players in this situation include the Israeli government and Hamas, the governing body of Gaza, which holds Yehud captive. The incident underscores the complex and fraught nature of the Israeli-Palestinian conflict, particularly as it concerns the safety of civilians and the potential for humanitarian crises.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/25/world/middleeast/israel-hamas-gaza-hostage-yehud.html",
    "url": ""
  }
]