[
  {
    "title": "Sudan Severed Ties with the UAE Due to Alleged Paramilitary Support",
    "link": "https://www.bbc.com/news/articles/cly1ygvxvq3o",
    "source": "BBC",
    "pub_date": "Wed, 07 May 2025 08:15:58 GMT",
    "summary": "In response to ongoing conflict and alleged support for the Rapid Support Forces (RSF), Sudan has severed ties with the United Arab Emirates (UAE).  The Sudanese army accuses the UAE of backing the RSF, while the UAE denies these allegations.  This diplomatic break follows continued drone strikes on Port Sudan, highlighting the ongoing instability within the country.  These events demonstrate the complex regional dynamics and the struggle for power in Sudan.",
    "date_str": "May 07, 2025"
  },
  {
    "title": "Israel Reportedly Attacked Sanaa's Main Airport in Yemen",
    "link": "https://www.bbc.com/news/articles/c7050j07gedo",
    "source": "BBC",
    "pub_date": "Tue, 06 May 2025 18:25:13 GMT",
    "summary": "Israel reportedly attacked Sanaa International Airport in Yemen, hitting three civilian planes, the departures hall, the runway, and a military air base. The attack, reported by the BBC, highlights the ongoing conflict and the involvement of Israel in the Yemeni civil war. The key players in this situation are Israel, which launched the attack, and the Houthis, who control Sanaa. This action takes place amidst a complex geopolitical landscape and the ongoing conflict between the Saudi-led coalition and the Houthi rebels.",
    "date_str": "May 07, 2025"
  },
  {
    "title": "Attacks on a Sudanese Civilian Haven Continue for a Third Day",
    "text": "Drone strikes hit a fuel depot, airport and a hotel in Port Sudan, bringing violence to a city that had so far been spared in the devastating civil war.",
    "link": "https://www.nytimes.com/2025/05/06/world/africa/port-sudan-attacks.html",
    "date_str": "May 06, 2025",
    "source": "NYT",
    "summary": "Recent drone strikes in Port Sudan, impacting a fuel depot, airport, and hotel, mark a significant escalation of violence in the Sudanese civil war, extending the conflict's reach to a previously safe haven. This action underscores the ongoing instability and the potential for the war to expand, impacting critical infrastructure and potentially endangering civilians. The specific actors responsible for the attacks remain unclear, though the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) are the primary parties engaged in the conflict. These attacks demonstrate the devastating consequences of the ongoing civil war and further destabilize the country's fragile political and humanitarian situation."
  },
  {
    "title": "Israel Responds to Houthi Attack by Bombing Yemen's Primary Airport",
    "text": "The strikes came after the Houthis fired a missile that struck near Israel’s main airport. President Trump later said the U.S. would stop bombing the Houthis because they do not want to fight anymore.",
    "link": "https://www.nytimes.com/2025/05/06/world/middleeast/israel-yemen-attack-sana-airport.html",
    "date_str": "May 06, 2025",
    "source": "NYT",
    "summary": "Following a missile attack near Israel's primary airport by Yemen's Houthi rebels, the United States launched retaliatory strikes. This action, though not detailed in its scope, signals heightened tensions in the region and highlights the continued threat posed by the Houthis. Former President Trump subsequently announced the cessation of further U.S. bombing, suggesting a shift in U.S. strategy towards de-escalation, potentially driven by the assessment that the Houthis were no longer pursuing further conflict. The events reflect the complex dynamics of the conflict, involving the Houthis, the U.S., and, implicitly, Israel, underscoring the interwoven nature of regional security challenges."
  },
  {
    "title": "Israel Intercepts Drone Amidst Houthi Pledge of Continued Strikes",
    "text": "The Israeli military said it had intercepted an unmanned vehicle a day after President Trump said the U.S. would step back from conflict with the Iran-backed group.",
    "link": "https://www.nytimes.com/2025/05/07/world/middleeast/israel-houthis.html",
    "date_str": "May 07, 2025",
    "source": "NYT",
    "summary": "The Israeli military intercepted an unmanned aerial vehicle, a day after President Trump signaled a potential reduction in U.S. involvement with Iran-backed groups. This incident underscores the ongoing tensions in the region, particularly the proxy conflict between Israel and Iran, which are both key players. President Trump's statement, which implied a decreased U.S. presence, may embolden Iran-backed groups and complicate efforts to de-escalate the conflict. The interception highlights the persistent threats faced by Israel and the potential for further escalation despite Washington's shift in posture."
  }
]