[
  {
    "title": "US Offers $25 Million Reward for Maduro's Arrest",
    "date_str": "January 11, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c4g9ezyw0keo",
    "url": ""
  },
  {
    "title": "United States and United Kingdom Intensify Sanctions Targeting Russian Oil Sector",
    "date_str": "January 11, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cn8xlj9kkkmo",
    "url": ""
  },
  {
    "title": "Carter's Diplomacy Averted Nuclear War with North Korea",
    "date_str": "January 11, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cpee202y907o",
    "url": ""
  },
  {
    "title": "Researchers Suggest Gaza War Death Toll May Be Substantially Higher",
    "date_str": "January 11, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cqjvl4klzweo",
    "url": ""
  },
  {
    "title": "Supreme Court Considers TikTok Ban Due to National Security Concerns",
    "date_str": "January 11, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cz9g91gn5ddo",
    "url": ""
  },
  {
    "title": "The Art of Conflict: Ukraine's Cultural Heritage Under Siege",
    "date_str": "January 11, 2025",
    "summary": "In response to Kyiv's assertion of its distinct identity, Ukrainian soldiers have adopted an image embodying a 19th-century painting of Cossacks, signifying their resilience in the face of adversity. This symbolic gesture highlights the enduring influence of historical imagery in shaping national narratives, with the current conflict serving as a backdrop for the appropriation of past artistic representations. The image has resonated with the public, becoming a poignant visual representation of the country's struggle for self-determination.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/11/world/europe/ukraine-photo-painting-culture-war.html",
    "url": ""
  },
  {
    "title": "The 2024 Climate Emergency: Alarming Temperatures and Urgent Solutions",
    "date_str": "January 09, 2025",
    "summary": "Global temperatures surpassed a significant threshold in 2023, driving concerns about the efficacy of international efforts to mitigate climate change. The rise in temperature has prompted governments and policymakers to reassess their commitments and strategies for reducing greenhouse gas emissions. Scientists and policymakers have emphasized the urgent need for more ambitious measures to limit global warming and mitigate its potential consequences. Key players, including the Intergovernmental Panel on Climate Change, the United Nations Environment Programme, and national governments, are collaborating to develop solutions and implement policies aimed at achieving the goals of the Paris Agreement.",
    "source": "NYT",
    "link": "https://www.nytimes.com/interactive/2025/01/09/climate/2024-heat-record-climate-goal.html",
    "url": ""
  },
  {
    "title": "United States Imposes Sanctions Targeting Russia's Energy Sector",
    "date_str": "January 10, 2025",
    "summary": "In response to Russia's ongoing invasion of Ukraine, the Biden administration has launched a campaign against the Russian \"shadow fleet\" of vessels used to circumvent sanctions and has implemented measures to limit Russian oil and gas production. This crackdown, led by the United States, aims to further isolate Russia economically and pressure its government. The administration has worked closely with European allies, including the United Kingdom, in this endeavor, recognizing the critical role of these countries in enforcing sanctions and reducing dependence on Russian energy.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/10/us/politics/us-russia-sanctions.html",
    "url": ""
  },
  {
    "title": "House Approves Imposition of Sanctions on I.C.C. Officials for Investigating Israel",
    "date_str": "January 09, 2025",
    "summary": "Republicans and President-elect Donald Trump strongly support the passage of a measure that is likely to be enacted due to Republican control of the Senate. The measure, which has not been specified in the provided text, faces strong support among Republicans, who currently hold majority control in the Senate. This support, coupled with Trump's endorsement, has increased the likelihood of its eventual enactment.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/09/us/politics/icc-sanctions-house-israel.html",
    "url": ""
  },
  {
    "title": "Meet Pierre Poilievre, the Populist Challenger Aiming to Lead Canada",
    "date_str": "January 09, 2025",
    "summary": "Conservative leader Pierre Poilievre maintains a significant lead in polls ahead of the upcoming Canadian general election, reflecting voter dissatisfaction and the party's efforts to capitalize on economic concerns. Poilievre has been actively campaigning, targeting policies he deems ineffective, while Prime Minister Justin Trudeau faces challenges in addressing economic hardships. The election, expected in 2025, will pit Poilievre and the Conservatives against Trudeau and the Liberal Party, with voters focused on economic issues and seeking a change in government.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/09/world/canada/pierre-poilievre-conservative-leader-canada.html",
    "url": ""
  }
]