[
  {
    "title": "Iran Held a State Funeral for Military Leaders Killed in the Israel Conflict",
    "link": "https://www.bbc.com/news/articles/cvg978nkwxro",
    "source": "BBC",
    "pub_date": "Sat, 28 Jun 2025 12:22:23 GMT",
    "summary": "Following a recent ceasefire, Iran held a state funeral for military leaders and nuclear scientists who died in the conflict with Israel. The ceremony underscores the escalating tensions between Iran and Israel, particularly concerning Iran's nuclear program and regional influence. These deaths and the subsequent public mourning risk further destabilizing the region.",
    "date_str": "June 29, 2025"
  },
  {
    "title": "Israeli Strikes in Gaza Kill at Least 81, According to Hamas Health Ministry",
    "link": "https://www.bbc.com/news/articles/czry8g5n80zo",
    "source": "BBC",
    "pub_date": "Sun, 29 Jun 2025 06:18:07 GMT",
    "summary": "Amidst the ongoing Israel-Gaza conflict, Israeli strikes in Gaza reportedly killed at least 81 people, according to the Hamas-run health ministry. Witnesses and hospital staff report that one strike hit near tents housing displaced people, resulting in at least 11 deaths, highlighting the dire humanitarian situation within the Gaza Strip. These events occur within the broader context of escalating tensions between Israel and Hamas, further complicating regional stability and international efforts to broker a ceasefire. The reported casualties add to the already significant human toll of the conflict, raising concerns about potential war crimes and the protection of civilian populations.",
    "date_str": "June 29, 2025"
  },
  {
    "title": "Iran Held a State Funeral for Military Commanders and Nuclear Scientists",
    "text": "A procession of marchers honored prominent figures killed during the 12-day war with Israel.",
    "link": "https://www.nytimes.com/2025/06/28/world/middleeast/iran-funerals-israel-war.html",
    "date_str": "June 28, 2025",
    "source": "NYT",
    "summary": "Mourners commemorated individuals who died during the recent 12-day conflict with Israel, highlighting ongoing tensions in the region. This procession served as a public display of grief and solidarity, potentially fueling further polarization between involved communities. The event underscores the human cost of the conflict, which continues to impact Israeli-Palestinian relations and raises concerns about future stability."
  }
]