[
  {
    "title": "Ukraine's War Stamps Convey Humor, Patriotism, and Profanity",
    "date_str": "December 25, 2024",
    "summary": "Ukraine has issued war stamps infused with humor, patriotism, and profanity to boost morale domestically and promote its image abroad. Key stamps feature a defiant depiction of a border guard with a raised middle finger, a bold statement of resilience against Russian aggression. These stamps are a testament to Ukraine's ability to find levity and resilience amidst adversity.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cly4w8z28xzo",
    "url": ""
  },
  {
    "title": "Russian Vessel, Target of US Sanctions, Sinks After Engine Room Explosion",
    "date_str": "December 25, 2024",
    "summary": "A Russian cargo ship, the Ursa Major, has sunk in the Mediterranean Sea between Spain and Algeria after an engine room explosion. The vessel was carrying a crew of 12, two of whom remain missing. The Ursa Major, which was under US sanctions since 2018 for alleged links to Russian intelligence, was reportedly transporting goods from Israel to Syria. Spanish and Algerian authorities are conducting a search and rescue operation, while the cause of the explosion is under investigation.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c627n83ezlwo",
    "url": ""
  },
  {
    "title": "Hong Kong Announces Rewards for Apprehending Fugitive Activists",
    "date_str": "December 25, 2024",
    "summary": "Hong Kong authorities have announced rewards of HK$1 million for information leading to the arrest of six activists charged with violating the city's national security law. The activists are Andy Li, Ray Wong, Kevin Lai, Lester Shum, Jimmy Sham, and Avon Leung, all of whom are currently abroad. The move reflects the ongoing crackdown on political dissent in Hong Kong and aims to deter further protests against the Chinese government's tightening grip on the city.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cvgmj87248no",
    "url": ""
  },
  {
    "title": "Kenyan Forces Patrol Haiti's Gang-Controlled Warzone",
    "date_str": "December 25, 2024",
    "summary": "In Haiti's capital, Port-au-Prince, Kenyan peacekeepers are deployed as part of a UN mission to combat escalating gang violence. Their patrols reveal the intense conflict in the city, where humanitarian aid organizations struggle to assist residents trapped in crossfire. The presence of child soldiers and the use of sexual violence as a weapon add to the crisis, and even the peacekeepers themselves have become targets of attacks.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c8xj5xqq9w8o",
    "url": ""
  },
  {
    "title": "US-Backed Militias in Afghanistan Outperform Taliban in Violence and Abuses",
    "date_str": "December 24, 2024",
    "summary": "A lack of long-term strategy by successive US administrations fostered conditions favorable to the Taliban's resurgence. Amidst the blame game between former Presidents Trump and Biden, an investigation reveals that US policies unwittingly laid the foundation for the Taliban's victory in Afghanistan. The Taliban's takeover highlighted a failure in US efforts to stabilize the country, despite significant support from the Afghan military and billions of dollars in aid.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/24/world/asia/afghanistan-taliban-us-militias.html",
    "url": ""
  },
  {
    "title": "Israel Intercepts Houthi Missile and Threatens Militant Group’s Leaders",
    "date_str": "December 24, 2024",
    "summary": "Israel successfully repelled an attack by the Yemeni group after its defense minister threatened to eliminate their leadership. This incident occurred amidst heightened tensions between the two entities. Key players involved include the Israeli Defense Minister and the Yemeni group. The Israeli defense minister's prior vow to remove the group's leaders suggests a potential escalation in the conflict.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/24/world/middleeast/israel-houthis-yemen-missile.html",
    "url": ""
  },
  {
    "title": "Romania's Canceled Vote Strengthens Russia's Propaganda Influence",
    "date_str": "December 23, 2024",
    "summary": "The Romanian government annulled the first round of presidential elections after Moscow-backed candidate Victor Ponta emerged victorious. Western nations welcomed the decision as a step towards safeguarding democracy, while critics within Romania raised concerns about its potential impact on the country's democratic institutions. The move underscores ongoing tensions between Romania and Russia, with Bucharest seeking closer ties to the European Union and NATO, while Moscow attempts to maintain influence in the region.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/23/world/europe/romania-election-russia.html",
    "url": ""
  }
]