[
  {
    "title": "Israeli Military Claims Strikes Have Fully Disabled Yemen's Main Airport",
    "link": "https://apnews.com/article/israel-yemen-houthis-airport-23c27ae5ef0b8c9c8860dbb79abee5ad",
    "source": "Associated Press",
    "date_str": "May 06, 2025",
    "summary": "No summary available"
  },
  {
    "title": "Israeli Forces Have Closed UN-Run Schools in East Jerusalem",
    "link": "https://www.bbc.com/news/articles/cqxej00w3wno",
    "source": "BBC",
    "pub_date": "Thu, 08 May 2025 15:22:48 GMT",
    "summary": "Israeli forces have closed schools in East Jerusalem run by UNRWA, affecting hundreds of Palestinian students. This action follows an earlier Israeli ban on UNRWA, raising concerns about the future of educational services for Palestinian children. The closures represent a significant escalation of tensions in the region, with the Israeli government as the primary actor, and impact children in East Jerusalem as a result. This move further complicates the already fraught context of the Israeli-Palestinian conflict, particularly regarding the provision of essential services to Palestinian populations.",
    "date_str": "May 09, 2025"
  },
  {
    "title": "Ukrainian Soldiers and Civilians Reject Russia's Ceasefire, Claiming No Truce Exists",
    "link": "https://www.bbc.com/news/articles/c5y63dvj5dqo",
    "source": "BBC",
    "pub_date": "Fri, 09 May 2025 01:25:39 GMT",
    "summary": "In the Donetsk region of Ukraine, the BBC interviewed Ukrainian soldiers and civilians, finding that they do not recognize any actual truce despite Russian claims of a ceasefire. These individuals reported continued fighting and shelling, undermining any perception of a cessation of hostilities. The report, by BBC's Yogita Limaye, highlights the discrepancies between Russia's pronouncements and the on-the-ground realities experienced by Ukrainian soldiers and residents. This context is crucial for understanding the ongoing conflict's complex dynamics and the challenges in achieving any lasting peace settlement.",
    "date_str": "May 09, 2025"
  },
  {
    "title": "Russia's Military Actions Conceal Underlying Economic and Diplomatic Weaknesses",
    "text": "The annual Moscow parade marking victory over Nazi Germany is expected to be the largest in years, with world leaders in attendance, as the Kremlin tries to link that triumph to the war in Ukraine.",
    "link": "https://www.nytimes.com/2025/05/08/world/europe/russia-military-parade.html",
    "date_str": "May 08, 2025",
    "source": "NYT",
    "summary": "The Kremlin is preparing for its Victory Day parade in Moscow, anticipating its largest iteration in years, a display intended to connect the historical defeat of Nazi Germany to its ongoing war in Ukraine. Russian President Vladimir Putin likely seeks to leverage the event, with the presence of attending world leaders, to bolster domestic support and potentially signal international solidarity for Moscow's actions. This is occurring amidst heightened geopolitical tensions and isolation for Russia following its invasion of Ukraine, making the parade a key platform for the Kremlin to project strength and legitimacy. The event's size and guest list will be carefully scrutinized for indicators of Russia's global standing and the evolving international landscape."
  }
]