[
  {
    "title": "Over 700 Killed in Fighting in Democratic Republic of Congo",
    "date_str": "February 01, 2025",
    "summary": "Since Sunday, at least 700 people have been killed during an escalation of fighting in the Democratic Republic of Congo's eastern region. M23 rebels, a Tutsi-led armed group, captured the city of Goma, forcing UN peacekeepers to withdraw from the area amidst heavy casualties. The UN estimates that approximately 2,800 additional individuals sustained injuries as a result of the conflict.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c78xvgvy172o",
    "url": ""
  },
  {
    "title": "Phone Ownership Linked to Mining of Rare Metals in the Democratic Republic of Congo",
    "date_str": "February 01, 2025",
    "summary": "The Democratic Republic of Congo's armed conflict involves rebel groups controlling mines rich in coltan, a mineral used in electronics such as mobile phones. The extraction of coltan fuels the ongoing conflict and generates significant revenue for rebel groups, perpetuating the cycle of violence and instability in the region.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cn01k8948v1o",
    "url": ""
  },
  {
    "title": "South Africa and Rwanda Engage in Diplomatic Dispute Amid DR Congo Conflict",
    "date_str": "February 01, 2025",
    "summary": "In the Democratic Republic of Congo (DRC), South Africa and Rwanda have engaged in a diplomatic rift over the ongoing conflict. Rwanda has denounced South Africa's role as a peacemaker or mediator, accusing the country of lacking the necessary qualifications. South Africa's involvement stems from its membership in the Southern African Development Community (SADC), which has been tasked with resolving the crisis in the DRC. Despite Rwanda's skepticism, SADC remains actively involved in the peace negotiations.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c78w1ze7v25o",
    "url": ""
  },
  {
    "title": "North Korean Troops Absent from Ukraine Front Lines",
    "date_str": "January 30, 2025",
    "summary": "North Korea's elite forces were deployed to support Russia in the Ukraine conflict, but have now been withdrawn due to heavy casualties. The deployment of these troops was significant as it represented North Korea's first known military engagement outside the Korean Peninsula in decades. Russia's reliance on foreign fighters underscores the challenges it has faced in its military campaign. The withdrawal of North Korean troops suggests that their losses may have been unsustainable and that Russia's manpower shortage is persisting.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/01/30/world/europe/north-korea-troops-ukraine-russia.html",
    "url": ""
  }
]