[
  {
    "title": "Columbia Protester Mahmoud Khalil Was Arrested by ICE and Faces Deportation",
    "link": "https://apnews.com/article/columbia-university-mahmoud-khalil-ice-440828980a4ee7bf4ddcf3d123e02b3e",
    "source": "Associated Press",
    "date_str": "March 11, 2025",
    "summary": "Following his involvement in student-led protests at Columbia University last spring regarding the war in Gaza, Mahmoud Khalil, a U.S. green card holder, is facing potential deportation by U.S. Immigration and Customs Enforcement (ICE). The protests, and Khalil's role in leading them, have placed him under scrutiny by the U.S. government, with former President Donald Trump's rhetoric on immigration potentially influencing the situation.  Khalil's case highlights the intersection of immigration enforcement, political activism, and the ongoing debate surrounding the Israeli-Palestinian conflict, raising concerns about free speech and due process."
  },
  {
    "title": "A Fashion Show in Kashmir Has Sparked Controversy Over Cultural Impact",
    "link": "https://www.bbc.com/news/articles/clynd24rnngo",
    "source": "BBC",
    "pub_date": "Sun, 16 Mar 2025 00:31:53 GMT",
    "summary": "A fashion show held in Gulmarg, a snowy town in Indian-administered Kashmir, has ignited controversy. The event, featuring designs by Shivan and Narresh, is significant because it has sparked debate over cultural appropriateness in the region. The context of the controversy involves long-standing tensions and sensitivities surrounding the display of Western-style fashion in the predominantly Muslim area.",
    "date_str": "March 16, 2025"
  },
  {
    "title": "Do Ukrainians Believe a Ceasefire Would End the War?",
    "link": "https://www.bbc.com/news/videos/c4g7473l2lgo",
    "source": "BBC",
    "pub_date": "Sat, 15 Mar 2025 00:08:45 GMT",
    "summary": "A recent BBC video report gauges Ukrainian public sentiment regarding a potential ceasefire with Russia, a pivotal juncture in the ongoing conflict.  The report features interviews with residents of Kyiv, revealing a spectrum of opinions on whether a ceasefire would genuinely lead to an end to the war.  The key players are the Ukrainian public, represented by the interviewees, and Russia, whose actions and perceived intentions are central to their views.  The interviews offer a snapshot of Ukrainian public opinion, a critical factor influencing the government's stance on negotiations, amid the backdrop of sustained hostilities and uncertainty about Russia's long-term goals.",
    "date_str": "March 16, 2025"
  },
  {
    "title": "Ukrainian Women Are Slowly Starting to Report Wartime Sexual Assault",
    "text": "Thousands of women may have been raped by Russian soldiers, experts say, but have kept quiet for fear of the stigma. But that is changing.",
    "link": "https://www.nytimes.com/2025/03/15/world/europe/ukraine-women-sexual-violence-war.html",
    "date_str": "March 15, 2025",
    "source": "NYT",
    "summary": "Experts suggest that a significant but unknown number of Ukrainian women have likely been raped by Russian soldiers, a war crime impacting the ongoing conflict. The silence surrounding these atrocities stems from widespread societal stigma and fear, which complicates investigations and support for victims. While specific perpetrators are largely unidentified, the Russian military is implicated as the instigator of these acts. This situation occurs amidst Russia's ongoing invasion of Ukraine and represents a concerning aspect of the broader human rights crisis."
  },
  {
    "title": "U.N. Says Trump Aid Cuts Could Threaten Refugee Survival, Leading to Deaths",
    "text": "At the world’s largest refugee camp, for Rohingya people in Bangladesh, the food allowance per person is set to fall to just $6 per month, far below what aid officials say is required for survival.",
    "link": "https://www.nytimes.com/2025/03/14/world/asia/trump-aid-cuts-refugees-rohingya.html",
    "date_str": "March 14, 2025",
    "source": "NYT",
    "summary": "The World Food Programme (WFP) is drastically cutting monthly food allowances for Rohingya refugees in Bangladesh's largest camp to a mere $6 per person, significantly below the minimum survival level as determined by aid officials. This reduction stems from a critical funding shortfall, threatening the food security of the approximately one million Rohingya refugees who fled persecution in Myanmar and sought refuge in Bangladesh. The WFP, the primary provider of food assistance in the camp, is the key actor facing the difficult decision of prioritizing limited resources, while Bangladesh continues to host the vast majority of Rohingya refugees, underscoring its important role in the crisis. This decision underscores the persistent humanitarian challenges associated with the protracted Rohingya refugee crisis, the funding fatigue among international donors, and the increasing vulnerability of a population already grappling with displacement and limited resources."
  },
  {
    "title": "A Finnish Court Convicts Russian Mercenary for War Crimes in Ukraine",
    "text": "Voislav Torden, a commander in a Russian paramilitary group, was sentenced to life in prison for the attack and mutilation of Ukrainian soldiers in 2014.",
    "link": "https://www.nytimes.com/2025/03/14/world/europe/russia-ukraine-war-crimes-conviction-finland.html",
    "date_str": "March 14, 2025",
    "source": "NYT",
    "summary": "In a significant development related to the ongoing conflict in Ukraine, a Russian paramilitary commander, Voislav Torden, received a life sentence for his role in the 2014 attack and subsequent mutilation of Ukrainian soldiers. This verdict, handed down by an undisclosed court, underscores the continued efforts to address war crimes and human rights violations perpetrated during the initial stages of the Russo-Ukrainian war. The sentencing of Torden, a leader within a Russian-aligned paramilitary group, highlights the complex web of actors involved in the conflict and raises questions regarding accountability for atrocities committed by non-state entities. This case serves as a crucial reminder of the enduring impact of the conflict and the importance of prosecuting those responsible for violations of international law."
  }
]