[
  {
    "title": "Petersburg Building Receives National Historic Landmark Designation",
    "date_str": "December 17, 2024",
    "summary": "President Biden established the Frances Perkins National Monument, commemorating the legacy of the first female Cabinet secretary. The monument recognizes Perkins' pivotal role in shaping labor policies during President Franklin D. Roosevelt's administration, including the establishment of the Social Security system and the 40-hour workweek. This initiative was supported by Secretary of Labor Marty Walsh and Interior Secretary Deb Haaland, who collaborated on the proclamation. Perkins' legacy continues to inspire efforts to advance labor rights and promote gender equality.",
    "source": "Associated Press",
    "link": "https://apnews.com/article/biden-national-monument-frances-perkins-labor-3b58f0c1bae51fe26017acb3688eb505",
    "url": ""
  },
  {
    "title": "Saudi Warnings Ignored Regarding Magdeburg Suspect, Says Frank Gardner",
    "date_str": "December 22, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c98l95d1773o",
    "url": ""
  },
  {
    "title": "German Police Investigate Market Attack Security and Warnings",
    "date_str": "December 22, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c5y4q4eny2do",
    "url": ""
  },
  {
    "title": "Russia is executing more and more Ukrainian prisoners of war",
    "date_str": "December 22, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/c7ve11lr247o",
    "url": ""
  },
  {
    "title": "Negotiations for a Gaza Ceasefire Nearing Completion, Palestinian official Informs BBC",
    "date_str": "December 22, 2024",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cgq1l5kv2npo",
    "url": ""
  },
  {
    "title": "US Military Aircraft Lost in Red Sea Incident",
    "date_str": "December 22, 2024",
    "summary": "US pilots were involved in a \"friendly fire\" incident over the Red Sea that resulted in their F/A-18 fighter jet being shot down. The incident occurred during a military operation where the pilots were accidentally targeted by allied forces. Both pilots were able to safely eject from the aircraft and were subsequently rescued. This incident underscores the importance of robust coordination and communication in military operations.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cj30zk1jnmno",
    "url": ""
  },
  {
    "title": "The Ukraine Conflict's Impact: 'The Nutcracker' as a Cultural Casualty",
    "date_str": "December 22, 2024",
    "summary": "Lithuania's national opera house suspended performances of Tchaikovsky's \"Swan Lake\" in protest against Russia's invasion of Ukraine. However, the new Minister of Culture ignited controversy by expressing admiration for the Russian composer, prompting a heated debate within the artistic community and the public. The decision to resume or continue the boycott remains unresolved, highlighting the complex interplay between art, politics, and national identity in the aftermath of the conflict.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/22/world/europe/-nutcracker-lithuania-russia-ukraine.html",
    "url": ""
  },
  {
    "title": "Iran Faces Critical Energy Shortage, Leading to Industrial Shutdowns",
    "date_str": "December 21, 2024",
    "summary": "Amidst geopolitical challenges, Iran faces a severe energy crisis despite possessing vast natural gas and crude oil reserves. The crisis underscores Iran's vulnerability despite its energy wealth and highlights the role of international sanctions, aging infrastructure, and mismanagement in exacerbating the situation. Key players include the Iranian government, which is facing domestic pressure to address the issue, and international stakeholders who have imposed sanctions on Iran's energy sector. The crisis has significant implications for Iran's economy, stability, and its international relations.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/21/world/middleeast/iran-economy-energy-crisis.html",
    "url": ""
  },
  {
    "title": "Houthi Missile Strikes Tel Aviv Amid Escalating Attacks",
    "date_str": "December 20, 2024",
    "summary": "The Israeli military engaged its air defenses, which failed to intercept a projectile that struck a playground in an Israeli city, causing minor injuries to several individuals. Key players in the incident include the Israeli military and the unidentified group responsible for the projectile's launch. This event underscores the persistent security challenges facing Israel and the need for effective air defense systems given the threat posed by projectile attacks.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/20/world/middleeast/israel-tel-aviv-missile-yemen.html",
    "url": ""
  },
  {
    "title": "Trudeau's Resignation Echoes Earlier Political Turmoil",
    "date_str": "December 21, 2024",
    "summary": "Prime Minister Justin Trudeau's demotion of Jody Wilson-Raybould from the Justice portfolio in 2019 sparked the SNC-Lavalin affair, leading to her resignation from Cabinet. This incident has significant parallels to the recent departure of Chrystia Freeland, who also left the government amid tensions with Trudeau. The context is critical, as it highlights the significant impact of political controversies on the stability and cohesion of the Canadian government.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/21/world/canada/in-top-ministers-resignation-shades-of-an-earlier-political-crisis-for-trudeau.html",
    "url": ""
  },
  {
    "title": "Terrorism Resurges in Pakistan Decade After Counterterrorism Campaign",
    "date_str": "December 21, 2024",
    "summary": "Political instability, declining public support, and economic challenges are jeopardizing Pakistan's progress in combating militancy following the 2014 school attack. Key players, including the government and security forces, face challenges in countering these vulnerabilities. The situation highlights the importance of addressing underlying political and economic factors to sustain Pakistan's efforts against terrorism.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2024/12/21/world/asia/pakistan-terrorism.html",
    "url": ""
  }
]