[
  {
    "title": "Five People Died Amidst Ukrainian and Russian Drone Attacks",
    "link": "https://www.bbc.com/news/articles/cvgv3ppl7m3o",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 11:31:12 GMT",
    "summary": "Amidst the ongoing conflict, Ukraine and Russia exchanged drone attacks, resulting in casualties on both sides. Ukrainian strikes on Dnipro led to the deaths of three people, while Russian attacks on the Rostov region killed two. These cross-border attacks underscore the continued escalation of the conflict and highlight the increasing reliance on drone warfare by both Ukraine and Russia. The reciprocal strikes exemplify the challenges in de-escalating the conflict between the two nations as each side retaliates. This exchange further strains diplomatic efforts aimed at resolving the larger geopolitical crisis involving Russia and Ukraine.",
    "date_str": "July 27, 2025"
  },
  {
    "title": "School Leavers Are Dying for Russia in Putin's War in Ukraine",
    "link": "https://www.bbc.com/news/articles/ce9xkg7dmd5o",
    "source": "BBC",
    "pub_date": "Sat, 26 Jul 2025 00:54:03 GMT",
    "summary": "Despite Russia's assurances that it would not deploy soldiers under 18, the BBC has found evidence indicating that young school-leavers are dying in the conflict in Ukraine. This contradicts promises made by Vladimir Putin's government regarding the composition of its forces. The deployment and death of these young soldiers, if substantiated, highlights a potential violation of international norms regarding the involvement of minors in armed conflicts and raises concerns about Russia's recruitment and deployment practices. This situation unfolds against the backdrop of the ongoing war in Ukraine, further complicating the already fraught geopolitical landscape. The reporting underscores the human cost of the war and the potential for misrepresentation of facts by key actors.",
    "date_str": "July 27, 2025"
  },
  {
    "title": "War Amputees Discover New Purpose Through Golf",
    "text": "The sport helps Ukrainian soldiers who have lost limbs in the war against Russia to heal and to master their prosthetics, rehabilitation experts say.",
    "link": "https://www.nytimes.com/2025/07/25/world/europe/ukraine-war-amputees-golf.html",
    "date_str": "July 25, 2025",
    "source": "NYT",
    "summary": "Adaptive sports are aiding Ukrainian soldiers recovering from war injuries, particularly amputations sustained in the conflict with Russia. These sports serve as a crucial tool in the soldiers' physical and psychological rehabilitation, facilitating the process of adjusting to and mastering prosthetic limbs. Ukrainian rehabilitation experts actively promote and utilize these activities, recognizing their significant benefits for wounded veterans. The ongoing war with Russia, which has resulted in numerous casualties and disabilities, makes these rehabilitation efforts vital for the long-term well-being and reintegration of Ukrainian soldiers into society."
  },
  {
    "title": "Israel Has Paused Some Military Operations in Gaza Amid Growing Hunger Concerns",
    "text": "Operations in three parts of the enclave were temporarily halted on Sunday to allow more aid to enter the territory, the Israeli military said. It was unclear if the decision would relieve the hunger crisis in Gaza.",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-aid-hunger.html",
    "date_str": "July 27, 2025",
    "source": "NYT",
    "summary": "The Israeli military temporarily suspended operations in select areas of Gaza to facilitate increased aid delivery, a move intended to address the worsening humanitarian crisis. While the pause aims to alleviate widespread hunger, its ultimate impact remains uncertain. This decision occurs amidst mounting international pressure on Israel to improve humanitarian access to the enclave, where the conflict has severely restricted the flow of essential supplies to the Palestinian population."
  }
]