[
  {
    "title": "Russian Attacks in Ukraine Have Doubled Since Trump's Inauguration",
    "link": "https://www.bbc.com/news/articles/c5yl6eegv63o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Wed, 06 Aug 2025 07:46:45 GMT",
    "summary": "Since Donald Trump's inauguration and his calls for peace, Russia has doubled its missile and drone attacks on Ukraine. This escalation occurs despite Trump's stated intention to end the war, highlighting a divergence between rhetoric and action. Russia, under the leadership of Vladimir Putin, continues its military campaign against Ukraine. The conflict, rooted in long-standing geopolitical tensions, underscores the complexities of achieving a resolution amidst competing strategic interests of key players like the United States, Russia and Ukraine.",
    "date_str": "August 06, 2025"
  },
  {
    "title": "UN Warns Starvation Threatens Besieged Sudan City Residents",
    "link": "https://www.bbc.com/news/articles/c776njyl74po?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Tue, 05 Aug 2025 13:59:07 GMT",
    "summary": "The UN warns that residents of El-Fasher, Sudan, face starvation as the Rapid Support Forces (RSF) have encircled the city, preventing food deliveries for over a year. This blockade exacerbates the already dire humanitarian situation stemming from the ongoing Sudanese civil war between the RSF and the Sudanese army. The conflict, which began in April 2023, has displaced millions and created a severe food crisis, particularly impacting vulnerable populations in the Darfur region. International actors are attempting to negotiate access and aid to the city.",
    "date_str": "August 06, 2025"
  },
  {
    "title": "A Truce Has Quieted the Syrian City Torn by Sectarian Clashes",
    "text": "The fighting has stopped in the southern city of Sweida, three weeks after a deadly eruption of violence. But the area remains tense as clashes continue beyond the city.",
    "link": "https://www.nytimes.com/2025/08/06/world/middleeast/syria-truce-sweida.html",
    "date_str": "August 06, 2025",
    "source": "NYT",
    "summary": "Fighting initially erupted in Sweida, Syria, three weeks prior, but despite ceasing within the city limits, violence persists in the surrounding areas, signaling continued instability. Syrian government forces and various local armed groups remain key actors, vying for control and influence in the region. This persistent unrest underscores the fragility of the Assad regime's control in southern Syria and highlights the complex dynamics between the central government and local actors in a region marked by long-standing grievances and a history of autonomy."
  },
  {
    "title": "Sudan's Civil War Is Shifting Westward, Bringing Violence",
    "text": "Since the Sudanese Army drove its paramilitary rival from the capital in March, the two sides are battling for territorial gains in the Kordofan region.",
    "link": "https://www.nytimes.com/2025/08/06/world/africa/sudan-war-kordofan-darfur.html",
    "date_str": "August 06, 2025",
    "source": "NYT",
    "summary": "Fighting intensifies in Sudan's Kordofan region as the Sudanese Army and the paramilitary Rapid Support Forces (RSF) vie for control, marking a significant escalation since the army expelled the RSF from Khartoum in March. These territorial battles in Kordofan hold strategic importance due to the region's agricultural resources and its location bordering Darfur. The conflict between the army and the RSF, rooted in power struggles and disputes over integrating the paramilitary into the military, destabilizes Sudan's transition and threatens regional security. Ultimately, the conflict exacerbates the existing humanitarian crisis and hinders any potential path towards a stable, civilian-led government."
  }
]