[
  {
    "title": "What Key Players Demand from Ukraine Peace Negotiations",
    "date_str": "February 18, 2025",
    "summary": "European powers in Paris seek a comprehensive peace agreement, while Russian and US officials in Saudi Arabia aim to secure commitments for a ceasefire and prisoner exchange. Key players involved include Germany, France, Ukraine, Russia, and the United States. The war has had significant consequences, with tens of thousands of casualties and widespread devastation, making a resolution crucial. The ongoing talks represent an attempt to find a diplomatic solution to the conflict and alleviate the human suffering caused by the war.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cwypy119yzno",
    "url": ""
  },
  {
    "title": "The Conflict in the Democratic Republic of Congo Explained",
    "date_str": "February 18, 2025",
    "summary": "In the Democratic Republic of Congo, M23 rebels have made significant advances, capturing strategic towns in the mineral-rich east, including Goma. The group, led by Congolese Tutsi General Sultani Makenga, seeks greater autonomy for the country's eastern provinces. The fighting, which has also drawn in local militias, government forces, and the UN peacekeeping mission, MONUSCO, has displaced thousands of civilians. The international community, particularly the African Union and the United Nations, has expressed concern over the escalation and called for immediate cessation of hostilities.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cgly1yrd9j3o",
    "url": ""
  },
  {
    "title": "Desperation to Return Home Ends in Tragedy for Displaced Father",
    "date_str": "February 18, 2025",
    "summary": "The ongoing conflict in Lebanon has displaced thousands, with efforts to reach Israel-occupied southern towns obstructed. Despite the challenges, some individuals have attempted the perilous journey, leading to tragic consequences. This man's death highlights the ongoing humanitarian crisis as civilians bear the brunt of the conflict. Key players involved include Lebanese civilians and Israeli forces. The situation is exacerbated by the historical tensions and geopolitical complexities surrounding the region.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/world/europe/israel-lebanon-hezbollah-displaced.html",
    "url": ""
  },
  {
    "title": "Gil Won-ok, Victim of Wartime Sex Slavery Who Fought for Japan’s Apology, Dies at 96",
    "date_str": "February 18, 2025",
    "summary": "None",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/world/asia/korea-comfort-women-advocate-obituary.html",
    "url": ""
  },
  {
    "title": "Trump Withdraws Loyal Soldier from Foreign Aid Battle",
    "date_str": "February 18, 2025",
    "summary": "A meeting between Hungarian official [Name] and Peter Marocco, a Trump-appointed U.S. official overseeing foreign aid, underscores a shift in diplomatic relations between the two countries. This encounter, indicative of improved ties, follows a period of tension due to differences in policy and values. Marocco's presence signifies the U.S. commitment to engaging with Hungary on matters of mutual interest, potentially fostering closer cooperation in the future.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/18/us/politics/foreign-aid-marocco-trump.html",
    "url": ""
  }
]