[
  {
    "title": "Yemen's Houthi rebels signal end of attacks",
    "link": "https://apnews.com/article/mideast-wars-yemen-houthis-red-sea-ee7be23641e9e3fd227d2c1677e03472",
    "source": "Associated Press",
    "date_str": "November 11, 2025",
    "summary": "Amidst a shaky ceasefire in the Gaza Strip, Yemen's Houthi rebels have signaled a halt to their attacks targeting Israel and commercial shipping in the Red Sea. The Houthis, a key player in Yemen's ongoing conflict and backed by Iran, had launched these attacks in professed solidarity with Palestinians. This cessation of hostilities in the Red Sea, a crucial global trade route, could ease international shipping concerns and potentially de-escalate regional tensions. Previously, these attacks had prompted responses and condemnation from various international actors."
  },
  {
    "title": "Ukrainian Attacks Cause Power and Heating Disruptions in Major Russian Cities",
    "link": "https://apnews.com/article/russia-ukraine-war-drones-blackout-731788c7974d2ddb63af41dc618ccb99",
    "source": "Associated Press",
    "date_str": "November 09, 2025",
    "summary": "Amidst the ongoing Russia-Ukraine war, Ukrainian strikes have impacted two major Russian cities near the border, causing disruptions to power and heating, according to reports from local Russian officials. The strikes highlight Ukraine's evolving capacity to project force across the border, potentially escalating the conflict and raising questions about Russia's ability to protect its own infrastructure. While the specific actors involved in planning and executing the strikes remain unconfirmed, these actions occur within the broader context of intensified fighting and mutual targeting of critical infrastructure by both sides. This development could presage a new phase of the conflict, characterized by increased attacks on civilian infrastructure and a wider geographic scope."
  },
  {
    "title": "Russian Drone Strike on Ukrainian City Kills Three and Injures Twelve While Residents Slept",
    "link": "https://apnews.com/article/russia-ukraine-war-drone-strikes-attacks-civilians-74750e88cda59c26c7e56da6c5614bf2",
    "source": "Associated Press",
    "date_str": "November 08, 2025",
    "summary": "On November 8, 2025, Russian forces struck an apartment building and energy sites in eastern Ukraine, resulting in at least four deaths and twelve injuries, according to Ukrainian authorities. The attacks, conducted with drones, exemplify the ongoing conflict between Russia and Ukraine, with targets increasingly impacting civilian infrastructure. This escalation occurs amid a broader geopolitical context involving key figures such as Vladimir Putin, Volodymyr Zelenskyy, and debates within the European Union regarding the conflict. The international community closely monitors these developments as they continue to shape the trajectory of the war."
  },
  {
    "title": "Israeli Settlers Set Fire to Palestinian Warehouse and Land Amid West Bank Attacks",
    "link": "https://www.bbc.com/news/articles/c78zygz4xg9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Wed, 12 Nov 2025 11:06:48 GMT",
    "summary": "Israeli settlers perpetrated arson attacks against Palestinian property in the West Bank, targeting an industrial area, a Bedouin village, and farmland near Tulkarm, resulting in injuries to several Palestinians. These attacks, part of a surge in settler violence, exacerbate tensions between Israelis and Palestinians and undermine efforts to achieve a lasting peace. The ongoing violence in the West Bank, a territory under Israeli occupation, continues to pose a significant challenge to regional stability and international diplomacy. Yolande Knell reported on this event for the BBC.",
    "date_str": "November 12, 2025"
  },
  {
    "title": "Fog Enables Russian Forces to Advance Further in Pokrovsk",
    "link": "https://www.bbc.com/news/articles/cx276px3280o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Wed, 12 Nov 2025 07:49:11 GMT",
    "summary": "Amidst the ongoing conflict in Ukraine, Russian forces are exploiting dense fog to advance further into the strategically important town of Pokrovsk. Viral video footage indicates Russian soldiers are openly entering the city using civilian vehicles like cars and motorbikes. This tactical maneuver aims to gain ground in the contested region. The BBC reports on these developments, highlighting the continued impact of the war on Ukrainian territory.",
    "date_str": "November 12, 2025"
  },
  {
    "title": "Israel Arrests 4 After Jewish Extremist Attack in Occupied West Bank",
    "text": "Dozens of masked Israelis attacked an industrial zone, torching vehicles and wounding Palestinians, according to Palestinian officials.",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/israel-extremist-attack-west-bank.html",
    "date_str": "November 11, 2025",
    "source": "NYT",
    "summary": "Settler violence surged as masked Israelis attacked an industrial zone, setting fire to vehicles and injuring Palestinians, escalating tensions in the occupied West Bank. These actions, condemned by Palestinian authorities, represent a continuation of escalating unrest between Israeli settlers and Palestinian communities. This incident highlights the ongoing challenges to security and stability and exacerbates the already fragile prospects for a peaceful resolution to the Israeli-Palestinian conflict, further complicating international efforts to de-escalate the situation."
  }
]