[
  {
    "title": "Zelensky Says Russia Seeks to Obstruct Peace Talks and Extend War",
    "link": "https://www.bbc.com/news/articles/ckgjpmg4r23o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 22 Aug 2025 20:27:18 GMT",
    "summary": "Amidst the ongoing conflict, Ukrainian President Volodymyr Zelensky accuses Russia of attempting to obstruct peace negotiations in order to prolong the war. Zelensky urges Western allies to intensify sanctions against Moscow if Russia demonstrates a lack of interest in pursuing a peaceful resolution. This accusation highlights the deep distrust and stalled diplomatic progress between Ukraine and Russia, furthering geopolitical tensions. The call for increased sanctions aims to pressure Russia into engaging more constructively in negotiations, reflecting the international community's continued efforts to resolve the conflict diplomatically.",
    "date_str": "August 23, 2025"
  },
  {
    "title": "North Korea Honors Soldiers for Fighting in Ukraine",
    "text": "The North’s leader, Kim Jong-un, publicly consoled bereaved families, as well as awarding medals to soldiers returning from the force he has sent to aid Russia.",
    "link": "https://www.nytimes.com/2025/08/22/world/asia/north-korea-ukraine-ceremony.html",
    "date_str": "August 22, 2025",
    "source": "NYT",
    "summary": "Kim Jong-un aims to solidify domestic support and project an image of benevolence by publicly consoling bereaved families and awarding medals to soldiers. These actions follow North Korea's dispatch of troops to assist Russia, likely in its war in Ukraine, a move that strengthens the burgeoning strategic alliance between the two nations. This assistance underscores North Korea's ongoing willingness to defy international sanctions in exchange for potential economic and technological gains from Russia. The situation further complicates regional security dynamics and reinforces concerns about the transfer of military technology and personnel."
  }
]