[
  {
    "title": "Putin Claims Super Weapons Can Obliterate Targets at High Speed",
    "link": "https://www.bbc.com/news/articles/cgeqj1q8gj4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 21 Aug 2025 23:24:37 GMT",
    "summary": "Russia and China currently lead the global race to develop hypersonic missiles, prompting concerns about a potential shift in military capabilities. The United States is actively working to catch up in this advanced weapons technology, while the United Kingdom currently possesses no hypersonic missile program. This disparity raises questions about the strategic balance and the West's ability to deter or respond to potential threats. As hypersonic weapons development accelerates, nations face pressure to innovate and modernize their arsenals in response to perceived vulnerabilities. The rapid advancements in hypersonic missile technology could reshape international security dynamics and escalate existing geopolitical tensions.",
    "date_str": "August 22, 2025"
  },
  {
    "title": "Peace Transformed the Village That War Once Affected Me",
    "text": "Fifteen years after a combat photographer lost his legs to a land mine, he returned to the place in Afghanistan where it happened.",
    "link": "https://www.nytimes.com/2025/08/21/world/asia/afghanistan-joao-silva.html",
    "date_str": "August 21, 2025",
    "source": "NYT",
    "summary": "A combat photographer revisited the Afghan site of a 2009 landmine explosion, marking fifteen years since the life-altering incident. This return highlights the enduring legacy of conflict and the continued presence of landmines in Afghanistan, a region still grappling with instability and reconstruction. The photographer's journey underscores the personal and lasting impact of war on individuals, while also implicitly drawing attention to the broader challenges faced by Afghanistan in addressing the ongoing threat of unexploded ordnance. His experience speaks to the difficult realities of war, which impact those directly involved, as well as the wider community around them."
  },
  {
    "title": "North Korea Honors Soldiers for Their Service in the Ukraine War",
    "text": "The North’s leader, Kim Jong-un, publicly consoled bereaved families, as well as awarding medals to soldiers returning from the force he has sent to aid Russia.",
    "link": "https://www.nytimes.com/2025/08/22/world/asia/north-korea-ukraine-ceremony.html",
    "date_str": "August 22, 2025",
    "source": "NYT",
    "summary": "Kim Jong-un publicly consoled bereaved families and awarded medals to soldiers returning from Russia, signaling North Korea's ongoing support for Moscow in its war efforts. These actions underscore the deepening partnership between North Korea and Russia, likely involving the provision of North Korean manpower and resources to bolster Russia's military capabilities. This growing alignment defies international sanctions and raises concerns about regional security and the potential for further escalation of the conflict."
  }
]