[
  {
    "title": "Turkish Official Suspects Mines, Missiles, or Drones Hit Black Sea Tankers",
    "link": "https://apnews.com/article/tankers-russia-sanctions-shadow-fleet-mines-drones-black-sea-76dce005c40a0bf38faf2fbf8be71e38",
    "source": "Associated Press",
    "date_str": "November 29, 2025",
    "summary": "Ukraine employed \"Sea Baby\" naval drones to strike two Russian oil tankers in the Black Sea near Turkey, marking an escalation in Kyiv's strategy to disrupt Moscow's maritime capabilities. A Ukrainian security services official confirmed the operation to the Associated Press, highlighting Ukraine's increasing reliance on unmanned vehicles to target Russian assets. These attacks against Russian oil infrastructure in the Black Sea aim to undermine Russia's ability to fund its war effort and demonstrate Ukraine's resolve in the conflict. The strikes follow earlier incidents and underscore the growing tensions in the Black Sea, a critical waterway for regional trade and security."
  },
  {
    "title": "Ukraine's Attacks on Tankers in Black Sea Escalate Conflict with Russia",
    "link": "https://www.bbc.com/news/articles/cp9ky5z2gx0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sun, 30 Nov 2025 06:22:36 GMT",
    "summary": "Amidst the ongoing conflict, Ukraine escalated its operations against Russia by striking two tankers in the Black Sea with naval drones. These tankers were reportedly used to circumvent Western sanctions imposed on Russia, highlighting the economic dimension of the conflict. Ukraine's actions signal a strategic effort to disrupt Russia's logistical capabilities and economic activities in the Black Sea. The incident involves Ukraine and Russia and underscores the tensions surrounding maritime routes and sanctions enforcement. This event takes place against the backdrop of the larger war and Western efforts to economically isolate Russia.",
    "date_str": "November 30, 2025"
  },
  {
    "title": "Hamas-Run Health Ministry Reports Over 70,000 Deaths in Gaza Since Israeli Offensive",
    "link": "https://www.bbc.com/news/articles/c8e97kl240lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Sat, 29 Nov 2025 23:16:22 GMT",
    "summary": "Since the start of Israel's offensive, the Hamas-run health ministry reports that over 70,000 people have died in Gaza, highlighting the devastating consequences of the ongoing conflict. Recent casualties include two young brothers reportedly killed in an Israeli airstrike, underscoring the fragility of the current ceasefire. This escalation occurs against the backdrop of the ongoing Israel-Hamas war, significantly impacting regional stability and humanitarian concerns. The international community closely monitors the situation as key players, including Israel and Hamas, navigate ceasefire negotiations.",
    "date_str": "November 30, 2025"
  },
  {
    "title": "Gazans Report Israeli Forces Killed Two Children During Ongoing Violence",
    "text": "The Israeli military said it had fired on two “suspects” on Saturday who had crossed cease-fire lines in southern Gaza and did not comment on reports that they were young children.",
    "link": "https://www.nytimes.com/2025/11/29/world/middleeast/israeli-forces-gaza-children-attack.html",
    "date_str": "November 29, 2025",
    "source": "NYT",
    "summary": "The Israeli military engaged two individuals who breached the cease-fire line in southern Gaza, escalating tensions in the already volatile region. This incident raises concerns about adherence to the existing truce and the potential for further escalation between Israel and Palestinian factions. The Israel Defense Forces (IDF) has yet to confirm or deny reports that the individuals involved were minors, fueling international scrutiny of its rules of engagement. Against the backdrop of ongoing negotiations for a more comprehensive peace agreement, the incident underscores the fragility of the current ceasefire and the deep-seated mistrust between the involved parties."
  },
  {
    "title": "Drawn by Employment, Individuals Were Entrapped in Russia's Conflict",
    "text": "The South African government is investigating how more than a dozen men unwittingly ended up on the front line in Russia’s war on Ukraine.",
    "link": "https://www.nytimes.com/2025/11/29/world/africa/south-africa-russia-ukraine-fighters-zuma.html",
    "date_str": "November 29, 2025",
    "source": "NYT",
    "summary": "The South African government launched an investigation into the recruitment and deployment of its citizens to fight in Russia's war in Ukraine, highlighting Pretoria's concern over potential violations of its neutrality and foreign military assistance laws. These men reportedly joined the conflict unknowingly, underscoring potential exploitation and raising questions about recruitment networks. This incident occurs within the context of South Africa's officially neutral stance on the Russia-Ukraine war and its historic ties with Moscow. The investigation seeks to determine the extent of the recruitment activities and hold those responsible accountable, preserving South Africa's international standing and adherence to legal frameworks."
  },
  {
    "title": "Israeli Forces Allegedly Killed Two Palestinians After Apparent Surrender, Video Indicates",
    "text": "The Israeli authorities said they were investigating the shooting, which came amid days of extensive military operations in the West Bank.",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/israel-west-bank-shooting-palestinians-video.html",
    "date_str": "November 28, 2025",
    "source": "NYT",
    "summary": "Israeli authorities are investigating a recent shooting in the West Bank, an event intensifying scrutiny of escalating Israeli military operations in the region. These operations follow days of heightened military activity, raising concerns about potential human rights violations and fueling further instability. The investigation's findings will likely impact international perceptions of Israel's security policies and the ongoing Israeli-Palestinian conflict. The probe comes as key international players monitor the situation, urging restraint to prevent further escalation of violence and protect civilian populations."
  }
]