[
  {
    "title": "Ten People Died in the Deadliest Israeli Raid in Southern Syria in Months",
    "link": "https://www.bbc.com/news/articles/cp89k31krz4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 28 Nov 2025 10:39:06 GMT",
    "summary": "Israel conducted a raid on Beit Jinn in southern Syria, resulting in the deaths of ten individuals in what they describe as an operation targeting a militant group. This marks the deadliest Israeli operation in Syria for several months, highlighting the ongoing tensions and conflict between Israel and militant groups operating in Syria. The raid underscores Israel's continued efforts to counter perceived threats along its border amidst the complex backdrop of the Syrian civil war. The event will likely exacerbate existing regional tensions and could prompt retaliatory actions from militant groups or their allies.",
    "date_str": "November 28, 2025"
  },
  {
    "title": "Israeli Troops Reportedly Kill Two Palestinians After Apparent Surrender",
    "link": "https://www.bbc.com/news/articles/c8dyqzm0rp4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 27 Nov 2025 21:24:50 GMT",
    "summary": "Israeli troops in the West Bank killed two Palestinians, sparking controversy as initial reports suggest the individuals were surrendering. The Palestinian Authority condemned the killings, characterizing them as a war crime, while an Israeli minister publicly defended the soldiers' actions. This incident occurs against the backdrop of heightened tensions and ongoing conflict in the region, further complicating efforts to de-escalate the Israeli-Palestinian conflict. The event raises concerns about adherence to international law and rules of engagement by Israeli forces in the occupied territories. The differing reactions highlight the deep divisions and the challenges in achieving accountability and justice in the Israeli-Palestinian arena.",
    "date_str": "November 28, 2025"
  },
  {
    "title": "France Will Reintroduce Military Service After a Twenty-Five Year Hiatus",
    "link": "https://www.bbc.com/news/articles/c0edw7g7z79o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 27 Nov 2025 12:14:30 GMT",
    "summary": "In 2026, France will reinstate a limited form of military service, offering 3,000 volunteer positions, according to President Emmanuel Macron who believes preparation is key to avoiding danger. This marks a shift 25 years after France phased out conscription, reflecting a potential response to evolving security concerns in Europe, particularly in light of tensions involving Russia and Germany. The voluntary program signals France's attempt to bolster national unity and defense capabilities amid geopolitical uncertainty. Hugh Schofield reports on the development as it unfolds.",
    "date_str": "November 28, 2025"
  },
  {
    "title": "Shooting Suspect's Conflict Journey Spanned Afghanistan and America",
    "text": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces.",
    "link": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
    "date_str": "November 27, 2025",
    "source": "NYT",
    "summary": "Following the Taliban's resurgence in Afghanistan, Rahmanullah Lakanwal, a former member of an Afghan paramilitary unit that cooperated with U.S. forces, sought refuge in the United States. Lakanwal's case highlights the continued ripple effects of the U.S. withdrawal from Afghanistan and its impact on Afghans who risked their safety by working with American personnel. This event underscores the ongoing challenges the United States faces in addressing the humanitarian and security consequences of its foreign policy decisions in Afghanistan. The United States now grapples with the moral imperative to support those Afghans vulnerable due to their association with the U.S. mission."
  }
]