[
  {
    "title": "Russian Strikes Cause Damage and Injuries in Kyiv",
    "link": "https://apnews.com/article/ukraine-russia-war-airstrikes-74c456c48b64e93300b4cf05bc60f6dd",
    "source": "Associated Press",
    "date_str": "October 10, 2025",
    "summary": "Russian forces launched drone and missile strikes against Kyiv on October 10, 2025, wounding at least 20 people and damaging residential buildings, while a separate attack killed a child. Ukrainian authorities, including President Volodymyr Zelenskyy and Kyiv Mayor Vitali Klitschko, are responding to the damage and casualties caused by the strikes. These attacks by Russia, led by Vladimir Putin, mark a continued escalation in the Russia-Ukraine war, impacting civilian infrastructure and causing blackouts across Ukraine. The strikes underscore the ongoing vulnerability of Ukrainian cities and the human cost of the conflict."
  },
  {
    "title": "Israel and Hamas Agreed to Exchange Hostages and Prisoners During Gaza War Pause",
    "link": "https://apnews.com/article/israel-hamas-hostages-trump-peace-plan-e3d0ce091be56cc29207e566ff1603af",
    "source": "Associated Press",
    "date_str": "October 09, 2025",
    "summary": "In a significant step towards de-escalation, the Israeli Cabinet approved President Trump's plan for a ceasefire in Gaza and the release of hostages held by Hamas. This decision, reached after a devastating two-year war that destabilized the Middle East, signals a potential turning point in the conflict. The agreement, involving key players such as the Israeli government and Hamas, aims to halt hostilities and secure the freedom of remaining captives. The approval comes amidst ongoing international efforts to mediate a lasting resolution between Israel and Hamas."
  },
  {
    "title": "Major Russian Strikes Sever Power in Kyiv and Ukraine",
    "link": "https://www.bbc.com/news/articles/cvgq2vnxzlvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 10 Oct 2025 21:12:11 GMT",
    "summary": "Russian forces launched major strikes targeting Ukraine, causing widespread power outages, particularly in Kyiv where 380,000 consumers face electricity cuts. These attacks, part of Russia's ongoing war against Ukraine, cripple essential infrastructure and exacerbate the humanitarian crisis as winter approaches. The strikes, conducted by Russia, demonstrate a continued effort to weaken Ukraine's resolve and capacity to resist, impacting civilians across the country. This escalation occurs amidst stalled negotiations and signals a potential shift towards intensified targeting of civilian infrastructure by Russia.",
    "date_str": "October 11, 2025"
  },
  {
    "title": "The United States Will Deploy 200 Troops to Israel to Oversee the Gaza Ceasefire",
    "link": "https://www.bbc.com/news/articles/cpvl97r4e8jo?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Fri, 10 Oct 2025 09:58:12 GMT",
    "summary": "The United States plans to deploy 200 troops to Israel as part of a multinational force to monitor the Gaza ceasefire. This force will likely include personnel from Egypt, Qatar, Turkey, and the UAE. The move underscores the U.S.'s commitment to de-escalating tensions between Israel and Palestine and fostering regional stability through international cooperation. The establishment of this multinational force is intended to provide a more stable and secure environment following recent conflicts.",
    "date_str": "October 11, 2025"
  },
  {
    "title": "North Korea Showcases New Missiles During Parade Attended by Chinese and Russian Officials",
    "text": "The parade, held in North Korea’s capital to celebrate the 80th anniversary of the ruling Workers’ Party, ​gave its leader a chance to show off his growing power.",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/north-korea-military-parade-china-russia.html",
    "date_str": "October 11, 2025",
    "source": "NYT",
    "summary": "North Korea celebrated the 80th anniversary of its ruling Workers' Party with a military parade showcasing leader Kim Jong-un's consolidation of power. The event, staged in Pyongyang, provided Kim a platform to display advancements in the nation's military capabilities, signaling defiance against international sanctions and highlighting his regime's focus on defense. This display occurred amidst ongoing economic challenges and stalled denuclearization talks, reinforcing North Korea's strategic posture in the region. The parade underscores Kim Jong-un’s resolve to strengthen his authority and project an image of national strength despite external pressures."
  }
]