[
  {
    "title": "Israeli Strike in Yemen Reportedly Kills Eight Houthis",
    "link": "https://www.bbc.com/news/articles/c8rvmx60g07o?at_medium=RSS&at_campaign=rss",
    "source": "BBC",
    "pub_date": "Thu, 25 Sep 2025 19:47:14 GMT",
    "summary": "On September 25, 2025, Israel reportedly conducted a strike against Houthi targets in Yemen, resulting in eight fatalities, further escalating tensions in the Middle East. While the Israeli military claims they targeted security and military installations, the Houthis allege that the strike hit civilian infrastructure. This action occurs against a backdrop of ongoing regional instability, with the Houthis playing a significant role in the Yemeni civil war and frequently engaging in hostile actions against neighboring countries. The event underscores the complex and volatile nature of the region, potentially drawing in other actors and exacerbating existing conflicts.",
    "date_str": "September 26, 2025"
  },
  {
    "title": "Israel Launched Attacks on Yemen's Capital One Day After a Houthi Drone Strike",
    "text": "The Israeli military said it was targeting sites linked to the Houthi militia, but a witness said a residential building was hit. A day earlier, a Houthi drone hit the Israeli city of Eilat.",
    "link": "https://www.nytimes.com/2025/09/25/world/middleeast/israel-yemen-houthis.html",
    "date_str": "September 25, 2025",
    "source": "NYT",
    "summary": "Following a Houthi drone strike on Eilat, Israel retaliated by targeting sites allegedly connected to the Houthi militia in Yemen, marking an escalation of regional tensions. While the Israeli military claims it targeted military sites, reports indicate a residential building also sustained damage. These exchanges highlight the expanding scope of the conflict beyond Gaza and involve the Houthis, a Yemen-based group backed by Iran, further complicating regional security dynamics and raising concerns about a wider conflagration."
  },
  {
    "title": "Abbas Claims Israel Committed War Crimes and Dismisses Hamas' Future in Gaza",
    "text": "Mahmoud Abbas, the president of the Palestinian Authority, delivered a speech by video to the U.N. General Assembly on Thursday in which he thanked countries for recognizing Palestinian statehood.",
    "link": "https://www.nytimes.com/2025/09/25/world/middleeast/abbas-hamas-gaza-war-unga.html",
    "date_str": "September 25, 2025",
    "source": "NYT",
    "summary": "President Abbas addressed the UN General Assembly, using the platform to express gratitude to nations that have recognized Palestinian statehood, highlighting the ongoing diplomatic efforts to secure international legitimacy for a future Palestinian state. This speech, delivered virtually, underscores the Palestinian Authority's continued push for recognition despite stalled peace negotiations with Israel and persistent internal divisions within the Palestinian territories. The international recognition Abbas cited aims to strengthen the Palestinian position in potential future negotiations. Abbas likely hopes to leverage international support to pressure Israel into restarting peace talks and to gain greater influence in international forums."
  }
]