[
  {
    "title": "African Leaders Call for Immediate Ceasefire in Democratic Republic of Congo",
    "date_str": "February 09, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cew5q04q427o",
    "url": ""
  },
  {
    "title": "Global Health at Risk as US Suspends Overseas Funding",
    "date_str": "February 09, 2025",
    "summary": "The Trump administration's freezing of USAID, the U.S. government's international development agency, has raised concerns among experts about its potential impact on global health. Experts warn that the cuts could hinder efforts to prevent and control infectious diseases, delay vaccine and treatment development, and exacerbate health disparities worldwide. The freezing of USAID will have a direct impact on disease control efforts, as it funds programs that combat malaria, tuberculosis, and HIV/AIDS. It may also slow the development of new vaccines and treatments for these and other diseases. Additionally, the cuts could affect humanitarian assistance and food aid provided by USAID, further exacerbating health challenges in developing countries.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2q13113wwo",
    "url": ""
  },
  {
    "title": "Sudanese Army Secures Significant Advances in Recapturing the Embattled Capital",
    "date_str": "February 09, 2025",
    "summary": "The Sudanese army has made significant gains in its operation to recapture the war-torn capital of Khartoum, as it seeks to end the ongoing civil war. The army's advances have been met with heavy resistance from rebel forces, and the fighting has resulted in civilian casualties. The conflict in Sudan has been ongoing for several years and has displaced millions of people. International humanitarian organizations have consistently condemned the violence and urged parties to find a peaceful resolution.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cq5gp74nqn6o",
    "url": ""
  },
  {
    "title": "Dozens of Countries Stand Behind International Criminal Court After U.S. Sanctions",
    "date_str": "February 09, 2025",
    "summary": "Despite sanctions from the United States, dozens of member states, including the UK, Germany, and France, reaffirmed their support for the International Criminal Court (ICC), deeming it crucial for international justice. The ICC has faced criticism for its investigations into alleged war crimes committed by US forces in Afghanistan and its potential investigation into Israeli actions in the Palestinian territories.",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cx2p19l24g2o",
    "url": ""
  },
  {
    "title": "Unveiling the Puppet Masters Behind the Crisis in the Democratic Republic of the Congo",
    "date_str": "February 09, 2025",
    "summary": "No summary available",
    "source": "BBC",
    "link": "https://www.bbc.com/news/articles/cp8qp6p39e9o",
    "url": ""
  },
  {
    "title": "War's Devastating Impact on Ukraine's Education System",
    "date_str": "February 08, 2025",
    "summary": "Ukrainian students face severe educational disruptions due to ongoing conflict, compelling them to attend classes underground or remotely, particularly in frontline areas. This crisis threatens to widen educational and social disparities among Ukrainian children as experts express concern over the long-term implications for their academic and developmental well-being. The conflict has also disrupted critical infrastructure, exacerbating the challenges faced by schools and students. Key players involved include the Ukrainian government, international aid organizations, and educational institutions. The crisis underscores the urgent need for international support to ensure the continuity of education and protect the future of Ukraine's children.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/europe/ukraine-russia-war-education.html",
    "url": ""
  },
  {
    "title": "Trade War Paused as Trump's Intentions and Solutions Remain Unclear",
    "date_str": "February 08, 2025",
    "summary": "U.S. President Donald Trump announced tariffs against Canada, threatening to escalate trade tensions. However, after a meeting with Canadian Prime Minister Justin Trudeau, he suspended the tariffs for 30 days. The talks highlighted the ongoing trade dispute and the uncertainty surrounding Trump's demands. The delay provides an opportunity for further negotiations, aiming to resolve the outstanding issues and prevent the implementation of the tariffs.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/08/world/canada/a-trade-war-is-on-hold-but-trumps-motives-and-a-fix-remain-uncertain.html",
    "url": ""
  },
  {
    "title": "Grenfell Tower, a Death Trap, Should Serve as a Sobering Reminder",
    "date_str": "February 07, 2025",
    "summary": "The British government has confirmed plans to demolish the Grenfell Tower in London, where a 2017 fire killed 72 people. The decision has elicited mixed reactions, with survivors and bereaved families expressing both anger and relief. The Grenfell Tower fire exposed serious safety concerns with the cladding used on high-rise buildings, leading to a government inquiry and widespread calls for reform. The demolition will commence as soon as possible, subject to safety and regulatory approvals.",
    "source": "NYT",
    "link": "https://www.nytimes.com/2025/02/07/world/europe/grenfell-tower-demolition-memorial-debate.html",
    "url": ""
  }
]